{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-19T01:01:17.948511"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-19T01:01:07.799665"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-19T01:01:07.799667"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-19T01:01:07.534707"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-19T01:01:07.534717"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-19T01:01:07.534690"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-19T01:01:07.799661"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-19T01:01:07.799663"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-19T01:01:07.534710"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-19T01:01:07.799649"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-19T01:01:07.534712"
      }
    ],
    "reddit": [
      {
        "id": "1o8zqpq",
        "title": "Should I fire a client that's 50% of my revenue? Losing my mind here",
        "selftext": "I run a small accounting consultancy. One client pays me $5k/month and has been with me for almost 2 years. They're literally almost half my revenue.\n\nThe problem: they're a nightmare. Disorganized records, last-minute requests every week, constant \"urgent\" messages on weekends. They treat deadlines like suggestions. Last month I stayed up until 2am 3 nights in a row because they send me a box of receipts the day before their filing deadline.\n\nEveryone tells me to stop serving them. My partner says I'm miserable every Sunday night. My friends say no client is worth this stress.\n\nBut here's the thing - $5k/month is $5k/month. That's half my income. If I fire them, I'd need to replace that with 2-3 smaller clients, and I barely have time to do sales because this client eats up all my time.\n\nSo I'm stuck in this loop of keeping them = good income, constant stress, no time to grow or Fxxk them off = happy life, almost 50% revenue cut, risk of not replacing the revenue\n\nI have about 4 months savings. Part of me thinks \"just rip the band-aid off\" but then I panic about paying rent.\n\nHas anyone been in this situation? What did you do? I need to make a decision soon because I'm burning out fast.\n\nHappy but broke, or stressed but paid?",
        "subreddit": "smallbusiness",
        "author": "Normal-Gear283",
        "score": 582,
        "num_comments": 530,
        "created_utc": 1760703516.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o8zqpq/should_i_fire_a_client_thats_50_of_my_revenue/",
        "fetched_at": "2025-10-19T01:01:14.873431"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 468,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-19T01:01:16.947109"
      },
      {
        "id": "1o9e7a7",
        "title": "Pricing awkwardness with friends",
        "selftext": "I run a home bakery. My boss (from my day job) asked to order 12 custom cupcakes. I would usually charge $60 for a project like this but gave her a discount and told her it would be $50. I prefaced it by saying that cost conversations with friends/coworkers can be awkward, but that custom cupcakes are time consuming and then shared the price. She said “$50 for 12 cupcakes?!” My face turned bright red and I was like “um yeah… if you want I can do toppers rather than a custom design and lower the price.” And then she was like “no, I want to showcase your design so it’s fine, I’ll pay the full amount” as if she is doing me a favor… \n\nI’m guessing this is a common experience for small business owners. Just looking for some solidarity because even though I know she was wrong, I’m still feeling mortified. Also wondering if this price sounds shocking to anyone else? Thanks for reading❤️",
        "subreddit": "smallbusiness",
        "author": "ummmmm7171",
        "score": 328,
        "num_comments": 190,
        "created_utc": 1760737537.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o9e7a7/pricing_awkwardness_with_friends/",
        "fetched_at": "2025-10-19T01:01:14.873415"
      },
      {
        "id": "1o92uqt",
        "title": "How Wise destroyed my business in one day - With €50,000 frozen",
        "selftext": "Hi everyone,\n\nI’m posting here to warn all entrepreneurs, freelancers, and small businesses using Wise Business.\n\nMy account was closed today, October 17, after more than 3 weeks of absurd exchanges with their so-called “compliance” team.\n\nI currently have €50,000 frozen, with no access, no refund date, and no concrete explanation.\n\n How it all started\n\nAt the end of September, I received a standard email:\n\n“We need to verify the source of your company’s funds.”\n\nNothing unusual at first.\n\nI provided every possible document:\n\nCompany registration documents\n\nClient contract + invoices\n\nBank statements\n\nSWIFT message\n\nHandwritten loan agreement and proof of family loan for starting capital\n\nA full explanation of the company structure and income source\n\nEverything was clear, traceable, and consistent.\n\nThen the nightmare began\n\nFor 3 weeks, I received emails from six different agents (each time a new name, each time ignoring the conversation history).\n\nEach one asked for the same documents again, just worded differently:\n\n“Please send external bank statements.” (already done)\n\n“Explain the origin of the capital.” (already explained 3 times)\n\n“Provide your tax declaration.” (impossible, new company)\n\n“Send the payslips of your relatives who helped fund you.” (??)\n\nEvery time, I took the time to explain, reformat files, add more proof, and provide detailed explanations.\n\nI gave them everything, black and white.\n\nAnd still — nothing moved forward.\n\n🚨 October 17: sudden account closure\n\nThis morning, I received the following message:\n\n“Your account has been closed. You can appeal and wait 30 days.”\n\nNo reason given.\n\nNo summary of their decision.\n\nNo timeline to recover my funds.\n\nResult:\n\n\\- €50,000 frozen\n\n\\- Business operations halted\n\n\\- Dozens of detailed emails ignored, no clear response\n\n\\- My opinion after this experience\n\nWise is no longer a reliable solution for professionals.\n\nThey act like a bank — but without transparency, accountability, or logic.\n\nTheir compliance team feels robotic, demanding contradictory and absurd documents, often impossible for small businesses to provide.\n\nAnd the worst part: they can shut down your account without warning, even if your file is clean.\n\nHonestly, it’s shameful.\n\nI regret ever trusting them.\n\nIf your business relies on Wise — withdraw your funds while you still can.\n\n❓Questions for the community\n\nHas anyone else here had their Wise account closed with money stuck inside?\n\nHow long did it take before you got your funds back?",
        "subreddit": "smallbusiness",
        "author": "absolutslay",
        "score": 219,
        "num_comments": 55,
        "created_utc": 1760711378.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o92uqt/how_wise_destroyed_my_business_in_one_day_with/",
        "fetched_at": "2025-10-19T01:01:14.873464"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 175,
        "num_comments": 49,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-19T01:01:16.947157"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 168,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-19T01:01:16.947151"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 115,
        "num_comments": 73,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-19T01:01:16.947120"
      },
      {
        "id": "1o9tl7r",
        "title": "Best web hosting in 2025? Still worth sticking with the big names?",
        "selftext": "Running a ckuple of small business sites and using SiteGround right now, but I’ve tried Bluehost and Namecheap in the past for different projects. Uptime has been fine, but support and renewal pricing keep getting frustrating. For the best web hosting in 2025, is there a clear winner for long-term reliability and transparent pricing, or are the newer players like Cloudways or A2 Hosting actually better for scaling? Are there specific features or pitfalls I should watch for if I switch hosts this year?",
        "subreddit": "Entrepreneur",
        "author": "Hour_Jello_1853",
        "score": 70,
        "num_comments": 24,
        "created_utc": 1760787861.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o9tl7r/best_web_hosting_in_2025_still_worth_sticking/",
        "fetched_at": "2025-10-19T01:01:09.687801"
      },
      {
        "id": "1o9xfdu",
        "title": "HOLY. We just got our FIRST real customer!! (I’m shaking lol)",
        "selftext": "Okay so after 4 months of blood, caffeine, and too much Stack Overflow.... someone actually paid real money for my thing.  \nOur startup - A Reddit, Linkedin, Twitter based lead Generation tool for businesses looking for sales.  \nNever thought seeing that first ₹1500 payment would feel like winning the lottery.  \nNow back to pretending we have a roadmap 😅",
        "subreddit": "smallbusiness",
        "author": "Unhappy_Sense_952",
        "score": 70,
        "num_comments": 29,
        "created_utc": 1760798052.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o9xfdu/holy_we_just_got_our_first_real_customer_im/",
        "fetched_at": "2025-10-19T01:01:14.873405"
      },
      {
        "id": "1o9ystk",
        "title": "Joined a Series-A startup and it’s chaos. Should I quit or stay? ( I will not promote)",
        "selftext": "Hey folks,\n\nI joined a Series-A startup recently as a tech lead. On paper, the vision sounded amazing. It's  a super-flexible platform meant to work for any company, in any industry.\n\nThe pay is good and the people are nice. \n\nBut two weeks in, here’s what I’m seeing:\n\n1. Trying to do everything:\nThe founders want to build something that works for everyone, across every possible use case. There’s no clear niche or focus. Just “we’ll handle all kinds of clients.”\n\n\n2. Product constantly breaking:\nThey trying to bring all in one app. The system works with few demos, but when setup or real customer data is in progress, it breaks. Every new customer is unique in their requirements, and instead of saying no or prioritizing, the team feels compelled to make it bespoke which ruins other parts of the product.\n\n3. Fragile technical foundation:\nManagement is very non-technical. There's constant pressure from sales to \"just make it work.\" Many clients pay less than 1000 dollars but every single one demands high-touch service. (Its more VC money than customer revenue)\n\n4. Burnout and team fatigue:\nThere have already been some people who've left. The ones remaining all appear to be exhausted (and annoyed). Most dev work is outsourced to contractors and have 4 or 5 engineers in office. They are aggressively hiring without any plan. \n\n5. No actual forward progress:\nEvery week is a new fire drill. New clients come in, something breaks, quick fix, another feature breaks and it goes on. They rely on vibe code shortcuts and one-off hacks, so debugging and ownership are very difficult. \n\n\n\nI’ve been here barely two weeks, and people are already holding me accountable for issues that have existed for months.\n\nSo I’m wondering:\n\n1) Is this kind of chaos normal for a Series-A startup?\n\n2) Has anyone ever witnessed a horizontal \"serve-everyone\" product plan come to reality?\n\n3) If you were standing in my position, would you stick around to try to steer it or cut losses early before getting dragged down with it?\n\nWould really appreciate some honest thoughts from people who have been in this position.\n\n(I will not promote)\n",
        "subreddit": "startups",
        "author": "rg_cyborg77",
        "score": 60,
        "num_comments": 97,
        "created_utc": 1760801355.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1o9ystk/joined_a_seriesa_startup_and_its_chaos_should_i/",
        "fetched_at": "2025-10-19T01:01:13.363747"
      }
    ]
  }
}