{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-28T08:13:24.824952"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-28T08:13:16.681772"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-28T08:13:16.279956"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-28T08:13:16.279943"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-28T08:13:16.681768"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-28T08:13:16.681770"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-28T08:13:16.681774"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-09-28T08:13:16.279962"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-28T08:13:16.279958"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-28T08:13:16.681757"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-28T08:13:16.279960"
      }
    ],
    "reddit": [
      {
        "id": "1nr3s2c",
        "title": "You don’t get a 6-figure business until you start thinking like one.",
        "selftext": "At 27, I was stuck around \\~$40k/year in my business.\n\nI thought the problem was marketing. Or the product. Or the economy.\n\nIn reality, it was me.\n\nI was hanging around people who complained all day.\n\nI thought small (how to save $50, not how to earn $5,000).\n\nI acted like a freelancer, not a business owner.\n\nThe shift happened when I started surrounding myself with people making way more than me. Their conversations were completely different:\n\nNot “how do I get more clients this week?” but “how do I systemize acquisition so I never worry again?”\n\nWithin 18 months, my business jumped past 6-figures.\n\nSame skills. Same market. Different me.\n\nLesson: your business doesn’t outgrow your identity.\n\nQuestion for the sub: What’s one habit you adopted that actually unlocked growth for you?",
        "subreddit": "Entrepreneur",
        "author": "emojidomain",
        "score": 726,
        "num_comments": 178,
        "created_utc": 1758899150.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nr3s2c/you_dont_get_a_6figure_business_until_you_start/",
        "fetched_at": "2025-09-28T08:13:17.369498"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 460,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-28T08:13:23.823538"
      },
      {
        "id": "1nrf51y",
        "title": "My two year old bootstrapped startup does $1.7 million per year profit with one employee and I'm considering leaving. What would you do in my shoes? [I will not promote]",
        "selftext": "I've been working on my data education startup for about 2 years now and it's done way better financially than I could have ever thought possible. I left my job in big tech in 2023 making $600k and I never thought I would be able to match that type of income with startups.\n\nMy startup did $750k in 2023, $1.1m in 2024, on pace for $1.7-2m this year.\n\nI guess for the last 3-4 months now I have felt emotionally dead though. Like, I can do anything but all I can focus on is scaling the business. I'm rich but unfulfilled.\n\nI decided to take a few weeks off end of August to see if it was burnout.\n\nBut when I came back in September, it's just been 4 weeks of uphill grinding. The flowing nature of my business has gone and now it feels like every 1 hour of work is 3 hours.\n\nI'm curious what founders do in this spot because this is my first successful business.\n\nThe options I've been considering:\n\n\\- Find a cofounder\n\n\\- Exit to private equity\n\n\\- Keep working on the business but at a slower pace\n\n\\- Changing nothing and recognizing that this hard patch will get better soon\n\nFor successful founders who have hit this point, what would you do?",
        "subreddit": "startups",
        "author": "eczachly",
        "score": 364,
        "num_comments": 292,
        "created_utc": 1758926336.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nrf51y/my_two_year_old_bootstrapped_startup_does_17/",
        "fetched_at": "2025-09-28T08:13:20.612261"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 170,
        "num_comments": 43,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-09-28T08:13:23.823561"
      },
      {
        "id": "1nrr1kw",
        "title": "I'm tired 😩",
        "selftext": "Honestly, I’m tired. Everywhere I look, someone is saying they make $20k a month. Everywhere I scroll, people keep repeating, “all you need is a laptop and internet to be rich.”\n\nWell, guess what? I have a laptop. I have internet. And I’m still here applying job after job, website after website, just trying to find an opportunity to make something work.\n\nI’m not looking for sympathy. I’m just being real. I’m hungry, I’m willing to learn, and I’ll put in the work. I just need that one real shot. If there’s an opportunity out there where I can contribute and grow, I’m open.",
        "subreddit": "SaaS",
        "author": "New-Wealth-650",
        "score": 160,
        "num_comments": 131,
        "created_utc": 1758965904.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nrr1kw/im_tired/",
        "fetched_at": "2025-09-28T08:13:18.950592"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 157,
        "num_comments": 49,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-09-28T08:13:23.823553"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 153,
        "num_comments": 178,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-28T08:13:23.823595"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 114,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-28T08:13:23.823598"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 96,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-28T08:13:23.823581"
      },
      {
        "id": "1nrng19",
        "title": "Personal branding is killing product innovation and we’re all pretending it’s normal",
        "selftext": "Everyone’s going to hate this, but the whole “founder as influencer” trend is making products worse, not better. We’re so obsessed with building personal brands that we’ve forgotten how products actually spread.\nHere’s the uncomfortable truth: Most successful products spread through word of mouth, not because their founders had blue checkmarks and posted daily revenue updates.\nThink about the apps you actually use. Notion, Spotify, TikTok, WhatsApp. Can you name their founders without googling? Probably not. You heard about these from friends, coworkers, or stumbled across them naturally. The product spoke for itself.\nNow look at startup Twitter. It’s full of founders posting their MRR screenshots, celebrating every milestone, building these massive personal followings. But here’s what’s weird - when you click through to their actual products, they’re often mediocre at best. All that energy went into personal branding instead of product development.\nThe worst part? This creates a feedback loop where founders optimize for what gets engagement on social media rather than what users actually need. They build features that look good in screenshots rather than features that solve real problems.\nReal example: Those high schoolers who built Cal AI didn’t become influencers first. They just made something useful - an app that identifies calories in food photos. People couldn’t stop sharing it because it actually worked. Zero personal branding required.\nMeanwhile, you have “successful” founders with 100k followers whose products nobody talks about outside of startup circles. They’ve confused building an audience with building a business.\nThe truth is harsh: if you need to convince people your product is good through personal charisma and social media presence, your product probably isn’t that good. Great products spread because they’re genuinely useful, not because their creator is good at Twitter.\nStop following founder influencers and start focusing on what actually makes products worth sharing. The best marketing doesn’t feel like marketing at all - it’s just people who can’t shut up about something that actually improved their life.",
        "subreddit": "Entrepreneur",
        "author": "luanmaliuhao",
        "score": 88,
        "num_comments": 60,
        "created_utc": 1758952171.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nrng19/personal_branding_is_killing_product_innovation/",
        "fetched_at": "2025-09-28T08:13:17.369484"
      }
    ]
  }
}