{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-07T16:12:45.940396"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-07T16:12:37.585939"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-07T16:12:37.223279"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-07T16:12:37.223277"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-07T16:12:37.223257"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-07T16:12:37.585931"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-07T16:12:37.585936"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-07T16:12:37.585934"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-07T16:12:37.223284"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-07T16:12:37.585920"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-07T16:12:37.223275"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 472,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-07T16:12:44.938993"
      },
      {
        "id": "1opumqy",
        "title": "I've built MVPs for 25+ startups and honestly most founders waste their money on the wrong things",
        "selftext": "So I run a dev shop and we mostly work with early stage founders. After 3 years of this, I keep seeing the same mistakes over and over. Writing this because I'm tired of having the same conversation.\n\n# The stuff that kills projects:\n\n**1. Feature bloat from day one**\n\nHad a founder last month come in with a 47-page PRD. Wanted user profiles, notifications, admin dashboard, analytics, social sharing, the whole nine yards. Budget was $40k.\n\nI asked \"what's the ONE thing this app needs to do?\" and he couldn't answer. Just kept saying \"but users will expect these features.\"\n\nConvinced him to cut it down to just the core workflow. Launched in 7 weeks instead of 6 months. Got 200 signups first week. Guess what? Nobody even clicked on half the features we almost built.\n\n**2. \"We need to handle a million users\"**\n\nNo you don't. You'll be lucky to get 50 users in month 1.\n\nI had a client insist on microservices, Kubernetes, the whole enterprise stack. Spent $120k and 5 months building. Launched. Got 31 signups. Pivoted 2 months later. All that infrastructure? Completely useless.\n\nMeanwhile another client launched with a basic Next.js app on Vercel. Cost $25k, took 6 weeks. Got 500 users in month 1. Still running on the same simple setup at 5,000 users.\n\n**3. Engineering for engineering's sake**\n\nLook, I get it. If you're technical, you want to build things \"the right way.\" But your first version is going to get thrown away anyway.\n\nI've seen founders spend 2 weeks building custom auth when Firebase Auth takes 2 hours. Spend a week on \"perfect database architecture\" when they should be validating if anyone wants the product.\n\nYour MVP doesn't need Redis caching. It doesn't need API versioning. It doesn't need a message queue. Just build the thing and see if anyone uses it.\n\n**4. Desktop-first in 2024**\n\nThis one drives me crazy. \"We'll build desktop first, mobile later.\"\n\nThen they launch and everyone tries it on their phone and it's completely unusable. Buttons too small, forms are a nightmare, loads slow. Users bounce immediately.\n\n70% of traffic is mobile. If you're not mobile-first, you're basically ignoring 70% of potential users.\n\n# What actually works:\n\n**Just launch the damn thing**\n\n6-8 weeks max for an MVP. Not 6 months.\n\nStrip it down to the absolute bare minimum. One core feature that solves one problem. That's it.\n\nLaunch it to 50 people. See if they use it. See if they come back. See if they'll pay.\n\nThen build feature #2. Not before.\n\n**Actually talk to users**\n\nNot \"I'll do user research after I build it.\" Talk to them WHILE you're building.\n\nShow them ugly prototypes. Get feedback every week. Fix the biggest complaint. Show it again.\n\nBy the time you launch publicly, you've already iterated based on real feedback from 50+ conversations.\n\n**Stop trying to make it perfect**\n\nYour v1 is going to suck. That's fine. That's expected.\n\nAirbnb's first site looked like Craigslist. Twitter was just status updates, no images, no replies. Facebook was basic profile pages.\n\nThey all started ugly and iterated based on what users actually wanted.\n\n# Real talk on budgets:\n\nFounders think they need $100k+ to build an app.\n\nFor most MVPs:\n\n* $5k or less: Landing page + mockups + user interviews (validation phase)\n* $20-40k: Actual working MVP with 3 core features (6-8 weeks)\n* $5-10k/month: Iteration based on feedback\n\nYou can get to product-market fit for $30-70k over 6 months. Not $200k over a year.\n\n# Tech stack that actually makes sense:\n\nStop overcomplicating this.\n\nFrontend: React/Next.js  \nBackend: Supabase or Firebase (or just Node + Postgres if you want)  \nHosting: Vercel or Railway ($0-50/month until you have real users)  \nPayments: Stripe\n\nThat's it. This stack can handle 10,000+ users easily. When you get there, THEN optimize.\n\n# When to run away from a dev team:\n\n* They quote you without asking detailed questions about your users/problem\n* They suggest blockchain or microservices for your basic CRUD app\n* They say \"we can build anything for $X\"\n* They promise 6 month timelines for an MVP\n* They don't push back on your feature list\n\nGood teams will challenge your assumptions and try to cut scope, not inflate it.\n\n# The metric that matters:\n\nWeek 1: Do 10+ people actually use it?  \nMonth 1: Do you have 50+ signups and 20+ weekly actives?  \nMonth 3: Has anyone asked when they can pay?\n\nIf you're not hitting these, don't keep building. Either pivot or kill it.\n\nMost founders spend 6 months \"improving\" a product nobody wants. Don't be that person.\n\nAnyway, that's my rant. Happy to answer questions about MVP scoping, tech choices, realistic timelines, whatever.\n\nWe've now helped about 25 startups go from idea to first paying customers. The ones that succeeded all did the things I mentioned above. The ones that failed ignored this advice and built in isolation for 6+ months.",
        "subreddit": "SaaS",
        "author": "Ok_Pineapple_5163",
        "score": 296,
        "num_comments": 62,
        "created_utc": 1762421994.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1opumqy/ive_built_mvps_for_25_startups_and_honestly_most/",
        "fetched_at": "2025-11-07T16:12:39.897699"
      },
      {
        "id": "1oqb26w",
        "title": "What’s the most uncomfortable truth about entrepreneurship that most people don’t realize?",
        "selftext": ".",
        "subreddit": "Entrepreneur",
        "author": "RtgodDR",
        "score": 246,
        "num_comments": 258,
        "created_utc": 1762463430.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oqb26w/whats_the_most_uncomfortable_truth_about/",
        "fetched_at": "2025-11-07T16:12:38.279275"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 181,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-07T16:12:44.939024"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 180,
        "num_comments": 28,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-07T16:12:44.939007"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 167,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-11-07T16:12:44.939052"
      },
      {
        "id": "1opzo3j",
        "title": "unpopular opinion: if nobody's doing your startup idea, that's usually a red flag, not an opportunity.",
        "selftext": "I see too many founders celebrating \"no competition\" like they've found some secret market gap\n\nin reality, no competition often means:\n\n- no demand exists\n- customer acquisition costs are prohibitively high\n- the market education burden is too heavy for a small team (pay attention folks)\n- there are regulatory/compliance barriers making it unviable\n\nthe sweet spot isn't an empty market\n\nit's a crowded market with broken execution\n\nexisting competitors prove people will pay for the solution. your job is to do it better, faster, or cheaper.\n\nyes, there are exceptions (blue ocean, disruptive innovation, etc.), but for every uber there are thousands of \"first movers\" who went bankrupt educating a market they never captured.\n\nwhat's your take? am I missing something here?",
        "subreddit": "Entrepreneur",
        "author": "Odd_Awareness_6935",
        "score": 144,
        "num_comments": 60,
        "created_utc": 1762437603.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1opzo3j/unpopular_opinion_if_nobodys_doing_your_startup/",
        "fetched_at": "2025-11-07T16:12:38.279293"
      },
      {
        "id": "1oqkm3a",
        "title": "How is Tesla valued, and how can I get they afford to give Musk one trillion dollar package?",
        "selftext": "I am truly baffled at how Tesla is generating such significant revenue that they can pay Elon a trillion dollars. A part of me feels like this is just news to create perceived value and hype. \n\nI find it difficult to believe that Tesla is generating this much in sales and value. \n\nI feel that their (Tesla's) success and valuations must be linked to government contracts.",
        "subreddit": "Entrepreneur",
        "author": "KAZKALZ",
        "score": 137,
        "num_comments": 126,
        "created_utc": 1762488606.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oqkm3a/how_is_tesla_valued_and_how_can_i_get_they_afford/",
        "fetched_at": "2025-11-07T16:12:38.279270"
      },
      {
        "id": "1oq1kdq",
        "title": "Six months in and I spend more time in meetings than actually building my business",
        "selftext": "Thought being the boss meant I'd finally have control over my schedule. Six months in and it's the opposite.\n\n7 hours of meetings yesterday. Then spent hours trying to remember what was decided in each one.\n\nClient calls, team check-ins, vendor negotiations, investor updates. Everything is \"urgent\" and \"quick 15-minute chats\" turn into hour-long requirement sessions.\n\nThe worst part? Keeping track of it all. Who said what, when things are due, which client needs what follow-up. I'm constantly scrambling through scattered notes trying to piece together what was actually agreed upon.\n\nStarted this to build something meaningful. Instead I'm drowning in administrative overhead and playing catch-up on commitments I made in meetings I can barely remember.\n\nHow do you handle the constant information overload without losing your mind?",
        "subreddit": "Entrepreneur",
        "author": "ActivePirate9830",
        "score": 83,
        "num_comments": 74,
        "created_utc": 1762442121.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oq1kdq/six_months_in_and_i_spend_more_time_in_meetings/",
        "fetched_at": "2025-11-07T16:12:38.279302"
      },
      {
        "id": "1oqlcdo",
        "title": "Business idea: Helping men make their homes feel warm, welcoming, and safe, for under $250",
        "selftext": "I’m not a fancy or high-maintenance woman, but I really appreciate when a man has his life and space in order. I feel like there are so many incredible men out there who just need a little guidance with style and environment.\nA lot of guys spend money on dating or communication coaching, but then when a woman actually comes over, the space feels off. The lighting’s harsh or too bright, there’s no music, maybe it smells a little stale or feels cold (literally and emotionally). It’s not that they don’t care, it’s just that no one’s ever taught them how to make a home feel safe and inviting.\nSo I’m thinking of creating a course or guide that teaches men how to transform their space on a budget for under $250 using simple sensory design: lighting, scent, warmth, music, and personal touches.\nI’m also a licensed massage therapist, so I could include a section on the basics of slow, safe, intentional touch to help men understand the connection between physical environment and emotional comfort.\nDoes this sound like something people would actually pay for or be interested in? Any thoughts on how to structure it as a course, digital guide, or coaching?\n",
        "subreddit": "smallbusiness",
        "author": "livingonluna_",
        "score": 60,
        "num_comments": 76,
        "created_utc": 1762490928.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oqlcdo/business_idea_helping_men_make_their_homes_feel/",
        "fetched_at": "2025-11-07T16:12:43.070217"
      }
    ]
  }
}