{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-08-29T08:15:32.390662"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-08-29T08:15:25.105747"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-08-29T08:15:25.105750"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-08-29T08:15:24.857649"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-08-29T08:15:24.857642"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-08-29T08:15:24.857631"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-08-29T08:15:25.105745"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-08-29T08:15:25.105748"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-08-29T08:15:24.857646"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-08-29T08:15:25.105734"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-08-29T08:15:24.857647"
      }
    ],
    "reddit": [
      {
        "id": "1n1pv26",
        "title": "I billed $200k this month and I don't know who else to tell",
        "selftext": "hello everyone, 4 years ago, I launched my recruiting company. I have staff working with me but do most of the billing myself. I don't know what happened this summer but I got busy as heck and now I just finished invoicing $200K for the month of August (which is really the carryover from work done since June), which will allow me to hit more than 7-digit revenue for 2025 (after employees' salaries) for the first time in my life.  \nNow for the sad part, this is something I would have shared with my dad but he passed in May and I had to share with someone.   \n\nobligatory EDIT: thank you so much for your messages, this is the best thing that happened all day (well, with the $200k)",
        "subreddit": "Entrepreneur",
        "author": "hegezip",
        "score": 1850,
        "num_comments": 216,
        "created_utc": 1756321178.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n1pv26/i_billed_200k_this_month_and_i_dont_know_who_else/",
        "fetched_at": "2025-08-29T08:15:25.544436"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 443,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-08-29T08:15:31.389249"
      },
      {
        "id": "1n2dt12",
        "title": "The dark secret of entrepreneurship that no one tells you about, and how to deal with it",
        "selftext": "Saw a post earlier today about how lonely the founder’s path really is. I dropped a long reply there, but this topic hit me so deep I felt it deserved its own thread.\n\nHere’s the truth nobody hypes on LinkedIn:\n\nStarting a company is like breaking out of prison. The 9 to 5 cage feels safe through steady paycheck, social life, weekends off. But when you escape, you enter a world that’s free but brutal. Freedom comes with wounds, sacrifices, and nights when it’s just you and your doubts.\n\nIt’s not just “loneliness”, it’s being alone in your thoughts. Your friends don’t get it, family nods politely, and even co-workers (if you have any) aren’t lying awake thinking about cash flow and churn. You carry that mental weight solo.\n\nThen come the sacrifices:\n\nFinancial → You go from spending freely to questioning every expense.\n\nRejection → Months of work, 50+ investor rejections, endless pivots.\n\nBias → Judged on your passport, accent, gender, even your postcode.\n\nSide hustles → Odd jobs, freelancing, hustling just to survive.\n\nBut you’re not actually alone. Many before you walked this road, and what waits at the end of the tunnel is worth it:\n\n1. Family that stood by you\n\n2. Financial freedom\n\n3. Physical freedom\n\n4. A transformed mindset\n\nAt that point, you realize what you really gave up was just time, a fraction of what you wasted in the cage.\n\n💡 TL;DR: Entrepreneurship is dark, lonely, and brutal, but you’re not the only one walking this road. The pain is the price of freedom.\n\nStay blessed, fellow founders. Shout out if you need someone who’s been there, plenty of us are carrying candles along the path.",
        "subreddit": "Entrepreneur",
        "author": "N-Innov8",
        "score": 329,
        "num_comments": 76,
        "created_utc": 1756391430.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n2dt12/the_dark_secret_of_entrepreneurship_that_no_one/",
        "fetched_at": "2025-08-29T08:15:25.544418"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 271,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-08-29T08:15:31.389300"
      },
      {
        "id": "1n2v0by",
        "title": "I joined Reddit a year ago and now my small business is thriving 😭",
        "selftext": "A year ago I was ready to rename or give up on our business entirely and since then it’s gone from “zero to 100…real quick” and we even won an award over the summer.\n\nThis community has been such a source of support and random resources, so just wanted to say thank you! \n\nRooting for all of you and your small businesses from afar 🙌🏽",
        "subreddit": "smallbusiness",
        "author": "weddinglandia",
        "score": 186,
        "num_comments": 47,
        "created_utc": 1756432879.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n2v0by/i_joined_reddit_a_year_ago_and_now_my_small/",
        "fetched_at": "2025-08-29T08:15:30.009155"
      },
      {
        "id": "1n2cwea",
        "title": "Here’s how I got +11,000 downloads & 631 sales for my study app",
        "selftext": "First and fore most the app is freemium so that’s why only 631 sales ($7.99/mo or $39.99/year. I have yet to figure out proper monetization and better ways to get the free users to actually pay but students are notoriously broke lol\n\nIm a young female founder so I’m aware there’s lots of things I should be doing that I’m not :) any advice is welcome. Oh also sorry for any tangents I have severe adhd so yeah.\n\nHere is what DIDN’T work:\n\nX. Agencies. Maybe it’s just me but 3 out of 4 totally screwed me. Seems their business model is broken or idek. It seems it’s mostly just management fees and then outsourcing my work overseas for pennies on the dollar. Only one agency produced a profit for me but even then it wasn’t substantial enough for me to continue at this stage as it was barely above breaking even.\n\nX. Newsletter sponsorships. I know it all depends on the newsletter and their audience. But even with ones that specifically had student audiences, the conversion rate of clicks to paying subscribers was abysmal. Makes me question if newsletter people don’t also throw in some bot traffic to inflate their numbers. Again, I’m sure some are great I just never encountered them lol\n\nX. SEO. To be honest I still think everyone should do this but make it a small 20 mins a week sort of thing and don’t expect results unless you have a big budget. When you’re a startup you need to focus on quick wins and SEO is definitely not one of them for me. I did 3 months worth of daily blog posts with no significant increase in Google traffic. (Also probably best to work with someone who knows SEO but I blew through my budget so it’s best I can do now)\n\nHere is what DID work:\n\n1) Running ads on the App Store. They’re crazy expensive BUT if you A/B test you will find that one version of your app screens & messaging that does much better than others and then you can get get really low cost downloads and sales. So when students search for specific keywords on the App Store my app shows up. Start with a SMALL BUDGET because it will just eat your money. Only bump it slowly if things are working. You won’t get anything by throwing in $100 on your first day. I wasted money like that x_x\n\n2) Mass posting of viral TikToks and YouTube shorts. Like two months ago there was a viral Reddit post here about VUBO which people were using to make brain rot videos as a side hustle. That gave me an idea so shoutout to the op. I used the texting stories template also with those Minecraft running videos in the background. All my videos start with a fake iMessage conversation between two people. Something like “oh my god I got a 52% in Mr. Armstrong’s class” and an unhinged convo ensues lol. Then I mention my study app by name in the texting conversation. All those people search the App Store and find us. Took some trial and error before I made videos that crossed even 5K views but now I have an absolute banger which is gaining like 10-15k views daily for 3 weeks now. Just from 1 single TikTok that the algorithm decided to push. I’m still posting daily and trying to hire someone to help take over.\n\n3) Posting in Facebook groups where students buy and resell textbooks. Either I just flat out post about my study app or I will message people who are there and give them discounts to try my app. This one is super tedious and labor intensive and doesn’t really scale. Tbh I mostly stopped doing this as it feels spammy. And it has minimal returns. but if I was just starting over with 0 paying subscribers I would definitely go hard at this to get the ball rolling.\n\n4) Cold DMing the new followers of frat & sorority chapters on Instagram. This one is also kinda spammy and I stopped doing it lately but it did work to bring at least 10-20 paying subscribers after about two weeks of manual effort. I ended up getting temporarily banned on Instagram from doing it too much so probably just try it if it’s early on and you need first traction but maybe not the best idea long term.\n\nIf someone has any advice on what else I could try please let me know I will be super grateful. Thank you. I will also answer questions if someone has one.",
        "subreddit": "Entrepreneur",
        "author": "HolgaBlue",
        "score": 156,
        "num_comments": 24,
        "created_utc": 1756389352.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n2cwea/heres_how_i_got_11000_downloads_631_sales_for_my/",
        "fetched_at": "2025-08-29T08:15:25.544424"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 143,
        "num_comments": 172,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-08-29T08:15:31.389282"
      },
      {
        "id": "1n2627q",
        "title": "Finally I have earned 4k from my saas along with 1200 loyal users, started from 9rs, made my Parents Proud",
        "selftext": "First of all I will make clear that I am not using ai for this post so their might be grammatical errors so please ignore them.\n\nYes i have now earned 4k+ from my product, it has been 3 months after launching and I have got 1200 users who uses my service.\n\nWhen the first paid user arrived it was a moment of extreme happiness for me because the amount maybe was small (9rs) but the confidence it built in me was great because someone had actually paid for what I have built \n\nWhen I told my mom about this she was double happier 😁 than me because it was the first time I have earned something of my own and it was not from gambling or any other bad things , it was the result of my hardwork .\n\nSlowly in these 3 months i have learned a lot of things and it was a amazing journey from 0 to 1200 users and taught me about various things.\n\nOnce I faced an bot attack who was trying to fill up my database with dummy accounts but I handled that wisely and I am proud of it.\n\nThen I learned to manage the payments and many other stuff and it was really cool to implement it.\n\nI am extremely open for any type of conversation 🙂",
        "subreddit": "SaaS",
        "author": "Embarrassed_Week7327",
        "score": 142,
        "num_comments": 109,
        "created_utc": 1756367235.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n2627q/finally_i_have_earned_4k_from_my_saas_along_with/",
        "fetched_at": "2025-08-29T08:15:27.106791"
      },
      {
        "id": "1n2bx2d",
        "title": "What's the best company gift you've ever given to your employees or gotten from your employer?",
        "selftext": "We are celebrating our new product release and we would like to celebrate the occasion by getting a swag gift that we can put the new product's logo and such on for each employee. Ideally we would like to keep it to about $50 or less per gift.  \nMust be ok for men or women.  \nI would like it to be something fun they talk about for years. Yeti tumblers have been one of those items that we have done in the past.  \nWe will already be doing some personalized swag bags on top of this.\n\nETA- This is in addition to bonuses, raises, a big party, and larger ticket personalized, nonbranded gifts. Cash and gift cards are not an option for tax reasons. I beg you to please stop saying cash or gift cards. They are already getting those and it's not in my scope of power to just add it to their already fat bonuses they are getting.\n\nAnd it's not my personal business, so not my decision. I just plan the parties. :) This is literally just a fun, cute memento to be a sprinkle on top to celebrate the occasion. ",
        "subreddit": "smallbusiness",
        "author": "TeallWolf",
        "score": 136,
        "num_comments": 271,
        "created_utc": 1756386899.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n2bx2d/whats_the_best_company_gift_youve_ever_given_to/",
        "fetched_at": "2025-08-29T08:15:30.009163"
      },
      {
        "id": "1n28ez5",
        "title": "No one talks about how lonely this can get",
        "selftext": "Everyone hypes up the freedom part of being an entrepreneur. “Be your own boss.” “Work whenever you want.” “Unlimited earning potential.”\n\nAnd yeah, all of that is true on paper, But the part nobody tells you: it’s lonely as hell.\n\nWhen you’re building something, you’re the only one who really cares if it works. Your friends don’t get it, your family nods politely, and even your co-workers (if you have any) aren’t lying awake at night thinking about cash flow and customer churn.\n\nIt’s just you.\nYou’re the one waking up at 3am wondering if this is all worth it\nYou’re the one forcing yourself to keep showing up when everyone else is posting their “fun weekends” on Instagram.\n\nI’m not complaining I chose this path.\nBut I wish people were more honest about this side of it.\nThe mental weight, the self doubt, the weird mix of isolation + pressure.\n\ncurious if others here feel this too.\nHow do you deal with the loneliness part of entrepreneurship?",
        "subreddit": "Entrepreneur",
        "author": "No-Dig3205",
        "score": 126,
        "num_comments": 58,
        "created_utc": 1756376320.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n28ez5/no_one_talks_about_how_lonely_this_can_get/",
        "fetched_at": "2025-08-29T08:15:25.544430"
      }
    ]
  }
}