{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-20T16:12:28.532203"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-20T16:12:21.537928"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-09-20T16:12:21.537932"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-20T16:12:21.183064"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-20T16:12:21.183052"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-20T16:12:21.537926"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-20T16:12:21.537930"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-09-20T16:12:21.183077"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-20T16:12:21.183072"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-20T16:12:21.537914"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-20T16:12:21.183075"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 459,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-20T16:12:27.530803"
      },
      {
        "id": "1nl2pz3",
        "title": "SaaS is already dead but no one wants to admit it",
        "selftext": "Everyday this sub is flooded with screenshots of new SaaS products that are just the same AI wrapper over an API. Let’s be real most of it is slop. Nothing original nothing sticky no defensibility. The only reason any of them make money is because clients are slow to catch on and still pay for tools they don’t actually need.\n\nSaaS isn’t innovative anymore it’s a margin game. Everyone clones each other and slaps on some UI. Switching costs are low and the market is saturated. The only “wins” you see now are people who sell to clueless corporate teams that take months to change vendors. That’s not a strong business model that’s just inertia.\n\nThe crazy part is founders still think this is the golden path. It’s not. SaaS had its decade but the landscape has changed. Distribution matters more than the product. If you don’t own an audience or a channel you’re just building a disposable tool.\n\nPeople hate hearing it but SaaS is already a graveyard. The dumb clients paying invoices every month are the only thing propping it up. Once they wake up the collapse is obvious.\n",
        "subreddit": "SaaS",
        "author": "Professional-Let1245",
        "score": 234,
        "num_comments": 190,
        "created_utc": 1758286300.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nl2pz3/saas_is_already_dead_but_no_one_wants_to_admit_it/",
        "fetched_at": "2025-09-20T16:12:23.414623"
      },
      {
        "id": "1nlnu7z",
        "title": "$100k H1B fee/year/visa is a government-sponsored plan to kill startups. ‘I will not promote’",
        "selftext": "Let's be real. Big Tech can pay a $100k/year fee for an engineer without even noticing. It's a rounding error for them.\n\nFor a startup, it's a death sentence. It makes hiring the best global talent impossible.\n\nThis isn't an immigration policy, it's a massive gift to the giants, giving them a government-enforced moat to monopolize talent. It's designed to make sure the next Google can never be built.\n\nAm I missing something here?",
        "subreddit": "startups",
        "author": "pmv143",
        "score": 228,
        "num_comments": 381,
        "created_utc": 1758339473.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nlnu7z/100k_h1b_feeyearvisa_is_a_governmentsponsored/",
        "fetched_at": "2025-09-20T16:12:24.921431"
      },
      {
        "id": "1nl39t6",
        "title": "First client just asked for a refund after 3 months - how do you handle this?",
        "selftext": "Just got my first refund request from a client I've been working with for 3 months. They say the web app I built isn't what they expected even though we had weekly check ins and they approved everything along the way.\n\nI know refunds are part of business but this one stings because I put so much work into it. They're asking for the full amount back but still want to keep using the software.\n\nFor those who've been through this, how do you handle it? I'm thinking of offering 50% back since they used it for 3 months and got value from it but not sure if that's reasonable.",
        "subreddit": "Entrepreneur",
        "author": "notdl",
        "score": 199,
        "num_comments": 255,
        "created_utc": 1758287703.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nl39t6/first_client_just_asked_for_a_refund_after_3/",
        "fetched_at": "2025-09-20T16:12:22.034526"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 165,
        "num_comments": 43,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-09-20T16:12:27.530817"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 145,
        "num_comments": 177,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-20T16:12:27.530852"
      },
      {
        "id": "1nlp7kg",
        "title": "How I grew my language learning app to 100s of users using Reddit (as a solo non-coder)",
        "selftext": "Hey y'all \n\nI wanted to share the (very scrappy) story of how I built a language learning tool that now has hundreds of users - and how Reddit helped me get there.\n\nA year ago, I was watching Star Trek with my (now) wife.\nWe’re a bilingual household, and we kept pausing the video to go over vocabulary - words we clearly didn’t use in everyday life.\n\nI'm a big believer in immersion and repetition for language acquisition.\n\nThat’s when I thought:\n Wow it sure would be great if there was an app that lets me study the vocab needed before we watch something.\n\n\nSo i searched. Nothing.\nAnd like any sane person I decided to build it myself.\n\n- I didn’t know how to code at all.\n- I didn’t have funding.\n\n\nStill, after months of trying and failing to teach myself to code...I gave up.\n\nBut a recently we found out we have a baby on the way. And that lit a fire under my ass to learn faster. So I sat down, found a vibecoding platform, and built this site last month.\n\nI got a janky MVP working and launched Vocablii, a tool that turns any YouTube video into a fully interactive vocab learning experience.\n\n- It pulls the transcript from the video\n\n- Highlights all the vocabulary in order of frequency\n\n- Translates words on hover\n\n- Lets you skip words you already know\n\n- Creates flashcards with SRS\n\n- I even added some mini-games for \"fun\" practice because I'm not doing the coding so why not.\n\n\nI thought maybe a few people would find it useful.\nThen I made this Reddit post in r/languagelearning.\n\nAnd straight up overnight I had 150+ users registered users.\nEnglish teachers started reaching out.\n I had to (vibe) rewrite huge parts of the code due to feedback from real learners.\nAnd now I've had to upgrade my API subscriptions due to the traffic. \n\nAll from a single Reddit post that validated the idea.\n\n\nSo...here’s what worked...\n\n1. I built something I actually needed.\nI wasn’t trying to build a business. I was trying to solve my own problem. That made things easy. I literally thought, what would be perfect for ME, and made that. Turns out even though I'm 1-in-a-million that means there's ~8,000 people just like me\n\n2. I told the full story.\nThe job loss, the bilingual household, the new baby - people on the subreddit understood that, they related to it, they reached out and personal messages and gave their support ...I think they wanted me to win because I wasn't some faceless corporation but just some dude on reddit struggling.\n\n3. I stayed in the comments.\nEvery single user issue became a feature. Users told me what was broken, what they loved, and what they wished existed. I was literally sitting in the airport terminal adding new features and fixing bugs in real time waiting for my flight that night (vietjet delayed 3 hours so I got a lot done)\n\n\nIt’s not perfect.\nIt doesn’t work with Netflix (yet).\nIt sometimes breaks with Japanese.\nBut it’s real, and it’s helping people.\nAnd it's actually growing...\nThat’s more than I ever expected.\n\nSo what I did to actually make money with vocabii, is\n\nThe site is free to try out with 1 video.\n\nAfter that is soft locks the user to register to make more flashcard decks.\n\nFree users get 5 free YouTube video to decks conversations per month.\n\nThere's 2 paid tiers\n\n1.99 for 20 decks a month + premium features \n\n4.99 for unlimited decks a month + premium features \n\n\nWhat I found has made a difference, is I check the support email every morning. I actually talk with my users like people. Some of them have sent in requests or bugs that I'll work on. But sometimes it's just a nice conversation.\n\nAnd if you're building your own thing (language-related or not), Reddit is seriously underrated. I mean, I've used this platform since 2012 now...it used to be better but it's still dang good as a community.\n\nLet me know if you have any questions. I'm no expert on indiehacking but my little success story is something.\nHappy to share everything.",
        "subreddit": "Entrepreneur",
        "author": "CourseSpare7641",
        "score": 141,
        "num_comments": 20,
        "created_utc": 1758344073.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nlp7kg/how_i_grew_my_language_learning_app_to_100s_of/",
        "fetched_at": "2025-09-20T16:12:22.034510"
      },
      {
        "id": "1nlocd9",
        "title": "How I grew my language learning app to 100s of users using Reddit (as a solo non-coder)",
        "selftext": "Hey y'all \n\nI wanted to share the (very scrappy) story of how I built a language learning tool that now has hundreds of users - and how Reddit helped me get there.\n\nA year ago, I was watching Star Trek with my (now) wife.\nWe’re a bilingual household, and we kept pausing the video to go over vocabulary - words we clearly didn’t use in everyday life.\n\nI'm a big believer in immersion and repetition for language acquisition.\n\nThat’s when I thought:\n Wow it sure would be great if there was an app that lets me study the vocab needed before we watch something.\n\n\nSo i searched. Nothing.\nAnd like any sane person I decided to build it myself.\n\n- I didn’t know how to code at all.\n- I didn’t have funding.\n\n\nStill, after months of trying and failing to teach myself to code...I gave up.\n\nBut a recently we found out we have a baby on the way. And that lit a fire under my ass to learn faster. So I sat down, found a vibecoding platform, and built this site last month.\n\nI got a janky MVP working and launched Vocablii, a tool that turns any YouTube video into a fully interactive vocab learning experience.\n\nIt pulls the transcript from the video\n\nHighlights all the vocabulary in order of frequency\n\nTranslates words on hover\n\nLets you skip words you already know\n\nCreates flashcards with SRS\n\nI even added some mini-games for fun practice because I'm not doing the coding so why not.\n\n\nI thought maybe a few people would find it useful.\nThen I made this Reddit post in r/languagelearning.\n\nAnd straight up overnight I had 150+ users registered users.\nEnglish teachers started reaching out.\n I had to (vibe) rewrite huge parts of the code due to feedback from real learners.\nAnd now I've had to upgrade my API subscriptions due to the traffic. \n\nAll from a single Reddit post that validated the idea.\n\n\nSo...here’s what worked...\n\n1. I built something I actually needed.\nI wasn’t trying to build a business. I was trying to solve my own problem. That made things easy. I literally thought, what would be perfect for ME, and made that. Turns out even though I'm 1-in-a-million that means there's ~8,000 people just like me\n\n2. I told the full story.\nThe job loss, the bilingual household, the new baby - people on the subreddit understood that, they related to it, they reached out and personal messages and gave their support ...I think they wanted me to win because I wasn't some faceless corporation but just some dude on reddit struggling.\n\n3. I stayed in the comments.\nEvery single user issue became a feature. Users told me what was broken, what they loved, and what they wished existed. I was literally sitting in the airport terminal adding new features and fixing bugs in real time waiting for my flight that night (vietjet delayed 3 hours so I got a lot done)\n\n\nIt’s not perfect.\nIt doesn’t work with Netflix (yet).\nIt sometimes breaks with Japanese.\nBut it’s real, and it’s helping people.\nAnd it's actually growing...\nThat’s more than I ever expected.\n\nIf you're curious, the site is vocablii.com (shameless plug) free to try, freemium if you go deeper.\n\nAnd if you're building your own thing (language-related or not), Reddit is seriously underrated. I mean, I've used this platform since 2012 now...it used to be better but it's still dang good as a community.\n\nLet me know if you have any questions. I'm no expert on indiehacking but my little success story is something.\nHappy to share everything.\n",
        "subreddit": "SaaS",
        "author": "CourseSpare7641",
        "score": 125,
        "num_comments": 16,
        "created_utc": 1758341106.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nlocd9/how_i_grew_my_language_learning_app_to_100s_of/",
        "fetched_at": "2025-09-20T16:12:23.414588"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 114,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-20T16:12:27.530856"
      },
      {
        "id": "1nl794c",
        "title": "Where did you find ambitious friends who are interested in entrepreneurship and investing?",
        "selftext": "I'm 25 and have a remote corporate finance job making \\~$85k, run a mobile detailing business that will gross $65k this year (growing quickly), and own a duplex rental property. I bought the first rental property when I was 22, right out of college, and I will be closing on my 2nd property in about a week. Everything for me is about growth. \n\n  \nAs the title suggests, where do I find like-minded, ambitious people my age who are interested in finance, investing, real estate, and entrepreneurship? My current friends think I'm insane for what I do, while I still think I'm not doing enough. They say they're interested in this stuff, but never put their money where their mouth is; it's all talk. All conversations with them eventually lead back to dating, relationships, and girls, which I have basically no interest in and it's frustrating. Where did you find your ambitious friends?",
        "subreddit": "Entrepreneur",
        "author": "Make_That_Money",
        "score": 108,
        "num_comments": 89,
        "created_utc": 1758297044.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nl794c/where_did_you_find_ambitious_friends_who_are/",
        "fetched_at": "2025-09-20T16:12:22.034532"
      }
    ]
  }
}