{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-25T16:15:50.765195"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-25T16:15:41.956590"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-12-25T16:15:41.956585"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-25T16:15:41.577286"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-25T16:15:41.577301"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-25T16:15:41.577297"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-25T16:15:41.577299"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-25T16:15:41.956582"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-25T16:15:41.956587"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-25T16:15:41.956571"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-25T16:15:41.577302"
      }
    ],
    "reddit": [
      {
        "id": "1puxm4i",
        "title": "My biggest competitor reached out to acquire me. The conversation taught me more about my business than 3 years of running it.",
        "selftext": "Got an email a few months ago. The CEO of my biggest competitor wanted to chat. Assumed it was a trick or a scouting mission. Took the call anyway out of curiosity. They wanted to buy me. Real offer. Real number. Not life-changing money but meaningful. I didn't take it. But the process of considering it taught me a ton. They asked questions I'd never asked myself. What percentage of customers actually use the core feature? What's the real competitive moat? How replaceable am I personally to the business? What would break if I disappeared? What assets transfer versus what's just me? Had to actually find the answers. Some were uncomfortable. The moat I thought existed basically didn't. Turns out competitors could rebuild my product in 3-4 months. The thing I thought was defensible was just a head start. My personal involvement was more central than I'd admitted. Relationships I had with key customers, knowledge in my head, reputation I'd built. The business without me was worth a lot less than I assumed. But I also discovered strengths I'd undersold. Customer retention was higher than I realized. A segment I thought was small was actually growing fast. The word of mouth in a specific niche was stronger than any marketing I'd done. The acquisition didn't happen but the clarity was worth more than the offer. Highly recommend pretending someone wants to buy you and asking yourself the hard questions. You'll learn a lot. What would you discover if someone tried to acquire you?",
        "subreddit": "SaaS",
        "author": "FlatGovernment6743",
        "score": 604,
        "num_comments": 68,
        "created_utc": 1766611133.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1puxm4i/my_biggest_competitor_reached_out_to_acquire_me/",
        "fetched_at": "2025-12-25T16:15:44.375083"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 491,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-25T16:15:49.764676"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 446,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-25T16:15:49.764716"
      },
      {
        "id": "1pumohp",
        "title": "Opening a small jewelry business felt like a dream until reality hit hard",
        "selftext": "Six months ago, I quit my stable job to open a small bijouteries focusing on handmade pieces. I thought my passion would be enough. I was completely unprepared for the business side of things inventory management, pricing, marketing, dealing with suppliers.\nThe jewelry-making part is still enjoyable, but it's now only about twenty percent of my actual work. The rest is answering emails, managing social media, tracking expenses, dealing with shipping issues, and trying to convince people my pieces are worth the prices I'm charging.\nLast week, someone asked why my necklace cost sixty dollars when they saw \"\"similar ones\"\" for ten dollars elsewhere. I tried explaining handmade quality versus mass production, but they just walked away. It's discouraging to have your work undervalued constantly.\nI've been sourcing some materials from Alibaba to keep costs manageable, which helps with margins, but I worry about maintaining quality while staying competitive on price. Finding that balance is exhausting.\nI'm starting to understand why so many small businesses fail in the first year. The romantic idea of being your own boss crashes hard against the reality of uncertain income and constant problem-solving. Some days I miss my old job security. Other days, I'm proud of every sale I make.\n\n",
        "subreddit": "smallbusiness",
        "author": "Nkt_31",
        "score": 195,
        "num_comments": 63,
        "created_utc": 1766580660.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pumohp/opening_a_small_jewelry_business_felt_like_a/",
        "fetched_at": "2025-12-25T16:15:47.724502"
      },
      {
        "id": "1pv4kgk",
        "title": "A \"mentor\" was using me. Took 18 months to realize I was just deal flow for his fund.",
        "selftext": "Met this guy at a conference. Successful founder. Exited twice. Now angel investing. Offered to mentor me. I was flattered and grateful.\nFor 18 months I had monthly calls with him. Shared everything. My metrics, my struggles, my roadmap, my customer insights, my competitive analysis. He gave advice. Seemed helpful. I thought I was lucky to have access to someone with his experience.\nThen I noticed something. Every few months he'd ask if I knew other founders in my space. Said he wanted to \"help them too.\" I'd make introductions feeling good about connecting people.\nA founder I'd introduced him to reached out one day. Asked why I hadn't mentioned my mentor was an investor in their competitor. I had no idea what she was talking about.\nDid some digging. Over those 18 months he'd invested in three companies in my space. All introduced to him by me or discovered through our conversations. He had a complete map of my market, my weaknesses, where I was headed, what I was worried about. And he'd used it to inform his investments in my competitors.\nI felt sick. Every conversation replayed in my head. Every time I'd been open about a struggle, I was probably giving him information that helped him evaluate companies that would compete with me.\nWhen I confronted him he didn't even deny it. Just said \"that's how the game works\" and seemed confused why I was upset.\nMaybe I'm naive. Maybe this is normal. But I trusted someone who was extracting value while pretending to give it.\nNow I'm much more careful about mentors who are also investors. The incentives aren't always aligned.\nAnyone else been burned by a mentor?\n",
        "subreddit": "SaaS",
        "author": "Bulky-Economy-6746",
        "score": 190,
        "num_comments": 51,
        "created_utc": 1766634515.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pv4kgk/a_mentor_was_using_me_took_18_months_to_realize_i/",
        "fetched_at": "2025-12-25T16:15:44.375081"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 166,
        "num_comments": 39,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2025-12-25T16:15:49.764697"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 154,
        "num_comments": 62,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2025-12-25T16:15:49.764696"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 88,
        "num_comments": 37,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2025-12-25T16:15:49.764694"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 66,
        "num_comments": 27,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-25T16:15:49.764714"
      },
      {
        "id": "1pnl1nl",
        "title": "Everyone says this year sucked for freelancing, but I did well?",
        "selftext": "I've been freelancing full time since 2020 and every year has been better than the last. I'm a marketer, so I have a wide array of clients I can service. I feel bad, but I had a great year, even though everyone else seems to claim there is no work? Am I crazy? I'm based in Canada but service the US and UK as well. Had one client in Germany this year, too.\n\n  \nThoughts? How has it been for ya'll?",
        "subreddit": "freelance",
        "author": "tnyv1per",
        "score": 56,
        "num_comments": 84,
        "created_utc": 1765837689.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pnl1nl/everyone_says_this_year_sucked_for_freelancing/",
        "fetched_at": "2025-12-25T16:15:49.764689"
      }
    ]
  }
}