{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-18T08:14:31.983470"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-18T08:14:23.063417"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-18T08:14:23.063420"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-18T08:14:22.806184"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-18T08:14:22.806166"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-18T08:14:23.063413"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-18T08:14:23.063415"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-18T08:14:22.806186"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-18T08:14:23.063402"
      },
      {
        "videoId": "-unqpGo_I2s",
        "title": "HOW TO EDIT VIDEOS IN 30 MINS - MY FASTEST WORKFLOW",
        "description": "Like the laptop? Click the link below to see how NVIDIA RTX graphics cards give you the power to create better and faster.",
        "channelTitle": "Zach Ramelan",
        "publishedAt": "2019-10-25T13:53:20Z",
        "url": "https://www.youtube.com/watch?v=-unqpGo_I2s",
        "fetched_at": "2025-10-18T08:14:22.806191"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-18T08:14:22.806188"
      }
    ],
    "reddit": [
      {
        "id": "1o8zqpq",
        "title": "Should I fire a client that's 50% of my revenue? Losing my mind here",
        "selftext": "I run a small accounting consultancy. One client pays me $5k/month and has been with me for almost 2 years. They're literally almost half my revenue.\n\nThe problem: they're a nightmare. Disorganized records, last-minute requests every week, constant \"urgent\" messages on weekends. They treat deadlines like suggestions. Last month I stayed up until 2am 3 nights in a row because they send me a box of receipts the day before their filing deadline.\n\nEveryone tells me to stop serving them. My partner says I'm miserable every Sunday night. My friends say no client is worth this stress.\n\nBut here's the thing - $5k/month is $5k/month. That's half my income. If I fire them, I'd need to replace that with 2-3 smaller clients, and I barely have time to do sales because this client eats up all my time.\n\nSo I'm stuck in this loop of keeping them = good income, constant stress, no time to grow or Fxxk them off = happy life, almost 50% revenue cut, risk of not replacing the revenue\n\nI have about 4 months savings. Part of me thinks \"just rip the band-aid off\" but then I panic about paying rent.\n\nHas anyone been in this situation? What did you do? I need to make a decision soon because I'm burning out fast.\n\nHappy but broke, or stressed but paid?",
        "subreddit": "smallbusiness",
        "author": "Normal-Gear283",
        "score": 483,
        "num_comments": 471,
        "created_utc": 1760703516.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o8zqpq/should_i_fire_a_client_thats_50_of_my_revenue/",
        "fetched_at": "2025-10-18T08:14:29.083802"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 468,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-18T08:14:30.982110"
      },
      {
        "id": "1o8efjo",
        "title": "Worth it to sue a customer for $14,000 in unpaid invoices?",
        "selftext": "It would be my first time suing someone, so I don't know the costs. \n\nThey've been pushing me off every week and month for the past 8 months or so, so I don't have a good reason to believe that they'll ever pay",
        "subreddit": "smallbusiness",
        "author": "VirtualMacaroon64t",
        "score": 232,
        "num_comments": 101,
        "created_utc": 1760639969.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o8efjo/worth_it_to_sue_a_customer_for_14000_in_unpaid/",
        "fetched_at": "2025-10-18T08:14:29.083851"
      },
      {
        "id": "1o92ynu",
        "title": "Anyone else learning that being your own boss doesn’t mean less stress just different stress?",
        "selftext": "When I was working a regular job I used to daydream about “being my own boss” no one breathing down my neck, setting my own hours, taking breaks when I wanted. I thought quitting the 9to5 would automatically make life lighter. Spoiler: it didn’t. Now the pressure just comes from a different direction. Every decision, every mistake, every slow week it’s all on me. There’s no safety net, no one to pick up the slack when I burn out. Some days I’ll be crushing it and the next I’m staring at invoices wondering what the hell I’m doing with my life. I’ve started building in little resets to stop my brain from frying quick walks, cleaning something while waiting for emails. It sounds dumb but ten minutes of doing anything unrelated helps me come back to work with an actual functioning brain. Curious how you all handle it. How do you keep the pressure from turning into constant anxiety when you’re the one in charge of everything?",
        "subreddit": "Entrepreneur",
        "author": "VerdantDucking",
        "score": 203,
        "num_comments": 45,
        "created_utc": 1760711625.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o92ynu/anyone_else_learning_that_being_your_own_boss/",
        "fetched_at": "2025-10-18T08:14:23.783144"
      },
      {
        "id": "1o92uqt",
        "title": "How Wise destroyed my business in one day - With €50,000 frozen",
        "selftext": "Hi everyone,\n\nI’m posting here to warn all entrepreneurs, freelancers, and small businesses using Wise Business.\n\nMy account was closed today, October 17, after more than 3 weeks of absurd exchanges with their so-called “compliance” team.\n\nI currently have €50,000 frozen, with no access, no refund date, and no concrete explanation.\n\n How it all started\n\nAt the end of September, I received a standard email:\n\n“We need to verify the source of your company’s funds.”\n\nNothing unusual at first.\n\nI provided every possible document:\n\nCompany registration documents\n\nClient contract + invoices\n\nBank statements\n\nSWIFT message\n\nHandwritten loan agreement and proof of family loan for starting capital\n\nA full explanation of the company structure and income source\n\nEverything was clear, traceable, and consistent.\n\nThen the nightmare began\n\nFor 3 weeks, I received emails from six different agents (each time a new name, each time ignoring the conversation history).\n\nEach one asked for the same documents again, just worded differently:\n\n“Please send external bank statements.” (already done)\n\n“Explain the origin of the capital.” (already explained 3 times)\n\n“Provide your tax declaration.” (impossible, new company)\n\n“Send the payslips of your relatives who helped fund you.” (??)\n\nEvery time, I took the time to explain, reformat files, add more proof, and provide detailed explanations.\n\nI gave them everything, black and white.\n\nAnd still — nothing moved forward.\n\n🚨 October 17: sudden account closure\n\nThis morning, I received the following message:\n\n“Your account has been closed. You can appeal and wait 30 days.”\n\nNo reason given.\n\nNo summary of their decision.\n\nNo timeline to recover my funds.\n\nResult:\n\n\\- €50,000 frozen\n\n\\- Business operations halted\n\n\\- Dozens of detailed emails ignored, no clear response\n\n\\- My opinion after this experience\n\nWise is no longer a reliable solution for professionals.\n\nThey act like a bank — but without transparency, accountability, or logic.\n\nTheir compliance team feels robotic, demanding contradictory and absurd documents, often impossible for small businesses to provide.\n\nAnd the worst part: they can shut down your account without warning, even if your file is clean.\n\nHonestly, it’s shameful.\n\nI regret ever trusting them.\n\nIf your business relies on Wise — withdraw your funds while you still can.\n\n❓Questions for the community\n\nHas anyone else here had their Wise account closed with money stuck inside?\n\nHow long did it take before you got your funds back?",
        "subreddit": "smallbusiness",
        "author": "absolutslay",
        "score": 181,
        "num_comments": 39,
        "created_utc": 1760711378.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o92uqt/how_wise_destroyed_my_business_in_one_day_with/",
        "fetched_at": "2025-10-18T08:14:29.083804"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 175,
        "num_comments": 49,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-18T08:14:30.982154"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 169,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-18T08:14:30.982149"
      },
      {
        "id": "1o9e7a7",
        "title": "Pricing awkwardness with friends",
        "selftext": "I run a home bakery. My boss (from my day job) asked to order 12 custom cupcakes. I would usually charge $60 for a project like this but gave her a discount and told her it would be $50. I prefaced it by saying that cost conversations with friends/coworkers can be awkward, but that custom cupcakes are time consuming and then shared the price. She said “$50 for 12 cupcakes?!” My face turned bright red and I was like “um yeah… if you want I can do toppers rather than a custom design and lower the price.” And then she was like “no, I want to showcase your design so it’s fine, I’ll pay the full amount” as if she is doing me a favor… \n\nI’m guessing this is a common experience for small business owners. Just looking for some solidarity because even though I know she was wrong, I’m still feeling mortified. Also wondering if this price sounds shocking to anyone else? Thanks for reading❤️",
        "subreddit": "smallbusiness",
        "author": "ummmmm7171",
        "score": 161,
        "num_comments": 98,
        "created_utc": 1760737537.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o9e7a7/pricing_awkwardness_with_friends/",
        "fetched_at": "2025-10-18T08:14:29.083800"
      },
      {
        "id": "1o7n22l",
        "title": "open ai isn't killing any 'actual' startup \"i will not promote\"",
        "selftext": "i keep seeing founders say their startup died because openai launched something similar. it’s driving me insane. how is your product so fragile that a single openai update wipes you out? this new generation of founders feels completely disconnected from reality. did everyone just forget what actually makes a product work: user experience, economies of scale, vertical focus, distribution, and everything else? feels like something’s seriously broken in the market right now or is it just me?",
        "subreddit": "startups",
        "author": "The-GTM-engineer",
        "score": 155,
        "num_comments": 35,
        "created_utc": 1760561991.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1o7n22l/open_ai_isnt_killing_any_actual_startup_i_will/",
        "fetched_at": "2025-10-18T08:14:27.426666"
      },
      {
        "id": "1o94crw",
        "title": "The Most Powerful Pricing Trick We Learned on the way to 50M ARR",
        "selftext": "All subscription companies eventually figure out the Monthly to Annual Plan pricing trick.\n\nI ran growth at Codecademy from 10M ARR to 50M ARR and this trick probably drove 30% of that growth. \n\nThe trick is to price your 12-month plan to be slightly more than your average LTV for monthly users.   \n  \nSo, if your average user stays around for 4 months, just price your annual plan at 5 months.  \n  \nYou get to boost LTV for these users by 25%, which is a huge win for not a lot of effort.  \n  \nWe did this at Codecademy, and it was hands down one of the most effective tactics we have ever tried.   \n  \nIt shifted a material amount of users to long-term plans, which increases LTV, drops churn, etc.  \n  \n**Also:** The big implication of this is that you can look at any mature subscription business and basically guess their user retention by looking at the ratio between their 12 month and 1 month prices.  \n  \nNetflix: Only offers monthly plans, meaning their average user stays around for over 12 months.  \n  \nHeadspace: $12.99 for a month vs $69.99 for a year. Ratio of 5.39, so their monthly users likely stay around for \\~4 months.   \n  \nCalm: $14.99 for a month vs $69.99 for a year, ratio of 4.67, so their monthly users probably stay around for \\~3-4 months  \n  \nIf you want to see what company in each category is probably the best at retention, look at pricing ratios",
        "subreddit": "Entrepreneur",
        "author": "dlayf",
        "score": 149,
        "num_comments": 18,
        "created_utc": 1760714748.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o94crw/the_most_powerful_pricing_trick_we_learned_on_the/",
        "fetched_at": "2025-10-18T08:14:23.783146"
      }
    ]
  }
}