{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-04T00:50:14.333313"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-04T00:50:05.456568"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-04T00:50:05.456570"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-04T00:50:05.039101"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-04T00:50:05.039087"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-04T00:50:05.456564"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-04T00:50:05.456566"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-10-04T00:50:05.039104"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-04T00:50:05.039106"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-04T00:50:05.456553"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-04T00:50:05.039107"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 456,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-04T00:50:13.331977"
      },
      {
        "id": "1nwejy6",
        "title": "I validated my startup idea with just a landing page",
        "selftext": "A few months ago, I had an idea I couldn’t shake. The problem was familiar: every time I’ve had an idea in the past, I either got stuck in analysis paralysis or went down the rabbit hole of coding, logos, product names, and all the “fun” distractions. Weeks or months would pass before I showed it to anyone, and by then I usually lost steam or realised nobody wanted it.\n\nThis time, I forced myself to do the opposite. My goal was simple: could I get strangers to care about my idea in less than a weekend? No product, no backend, no fancy branding. Just the bare minimum to test the interest.\n\nSo I worked on creating a landing page. To get people onto the page, I did two things. First, I shared it in a couple of communities where I knew the target audience hang out. Second, I put about $250 into very small ads just to see if anyone outside my personal network would click through. Nothing fancy.\n\nThe results surprised me. In 4 days, about 220 people visited the page. 63 of them actually signed up. That’s almost 30%. And a few of those people even replied to the confirmation email I sent, asking me questions about the idea and saying they’d pay for something like this if it existed. That was the kind of signal I never got from building in a vacuum.\n\nWas it perfect? No. But it gave me more validation in two days than months of building ever had. And honestly, it took the pressure off. Instead of wondering “does anyone want this?” I could move forward knowing at least a small group of people had raised their hands.\n\nSo if you’re sitting on an idea and spinning your wheels, don’t overthink it. Write down the problem clearly, describe how you’d solve it, and put up a simple landing page with a signup form. Drive a little traffic and watch what happens. Even if you only get a handful of signups, that’s still real feedback from real people.",
        "subreddit": "Entrepreneur",
        "author": "Mani-OBM",
        "score": 349,
        "num_comments": 58,
        "created_utc": 1759435862.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nwejy6/i_validated_my_startup_idea_with_just_a_landing/",
        "fetched_at": "2025-10-04T00:50:06.156548"
      },
      {
        "id": "1nw8ntz",
        "title": "Employee quit and moved to Japan with our $3000 laptop (help?)",
        "selftext": "Remote contractor finished their 8 month project and moved to Japan for personal reasons.They still have our MacBook Pro and external monitor.\n\nTried to arrange return shipping but international electronics shipping is apparently a nightmare. FedEx wants $400 and said there's \"high probability\" it gets stuck in customs.\n\nLocal shipping companies in Japan require business licenses and import/export documentation we don't have.\n\nThe equipment is worth maybe $2000 used but recovery costs are approaching $800. Starting to think we should just write it off and buy new equipment.\n\nHow do other small businesses handle internationaI equipment recovery?This seems like a common problem but I can't find good solutions anywhere.\n\nConsidering adding equipment deposit clauses to future contracts but that seems like it would scare away good contractors.",
        "subreddit": "smallbusiness",
        "author": "NewPassage8763",
        "score": 328,
        "num_comments": 250,
        "created_utc": 1759422775.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nw8ntz/employee_quit_and_moved_to_japan_with_our_3000/",
        "fetched_at": "2025-10-04T00:50:11.489290"
      },
      {
        "id": "1nwkp7n",
        "title": "How I attracted 3 VCs in 6 hours while developing my startup, which I will not promote",
        "selftext": "I arrived in SF three days ago and wanted to test a build in public experiment. Like really in public, in a cafe. I sat at Blue Bottle from 7am to 1pm with a sign on my laptop that read “coffee on me for valuable feedback.” It worked, people smiled, and I met a lot of interesting folks, including investors and founders. I have a post from this morning with an image of how it looked, I can share if you ask for it, I cannot attach it here. This is what I learned:\n\n**Timeline:**\n\n* 7:00 to 9:00 quiet time, a few good chats\n* around 9:00 biggest rush, I could not keep up with follow-ups and quick demos\n* 10:45 to 12:15 dead time\n* 12:15 to 13:00 rush again\n* left at 13:00 when the battery died\n\n**Numbers:**\n\n* 121 people looked at the sign, only the ones I noticed and counted. Possibly it was 2 to 3 times higher.\n* 17 conversations, about 25 people total since some came in pairs\n* 14 new LinkedIn and Twitter connections\n* 3 VCs connections\n* 3 founder connections\n* 0 coffees bought by me\n\n**Conversion**\n\n17 conversations out of 121 sign views, about 14 percent. I likely missed many glances, if real views were closer to twice that, call it around 7 to 8 percent. Also, it helps if you notice and start the conversation first, then people approach you. I think 3 VCs is very good number. will see how it goes from here.\n\nWhat it felt like in practice, I was sitting on the other side of the register, facing it, so many people ordered first, then while they waited for their coffee, they noticed the sign and maybe we talked. Lots of mobile pickup, many did not stop. Sign placement was not ideal, you had to turn from the deck to see it, but it was still the best seat I could get. Net result, it was a very productive time, even though actual coding was tough during the rush. If you try this, please buy something from the cafe, and if you stay long, consider buying more than once. I asked the staff if the sign was okay, and they said it was totally fine, so big thanks to this cafe.\n\nNow I am at home to keep building my startup. Good luck to anyone building or fundraising out there!\n\n\n\nWhat else should I try next time?",
        "subreddit": "startups",
        "author": "_s0uthpaw_",
        "score": 291,
        "num_comments": 76,
        "created_utc": 1759450994.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nwkp7n/how_i_attracted_3_vcs_in_6_hours_while_developing/",
        "fetched_at": "2025-10-04T00:50:09.643745"
      },
      {
        "id": "1nx6kxx",
        "title": "My SaaS was used for p*rn and now it makes $3k/month",
        "selftext": "Hey everyone!\n\nAbout 1 year ago I launched [my app](https://usevoicy.com/) as a chrome extension on the Chrome Web Store.  \nIt quickly reached 1k free users within a month, and the usage was through the roof.\n\nI use the WhisperAPI and my costs went from 0 to $5-10 dollars per day. This wasn't sustainable for me of course, so I decided to monetize.  \nI wanted to know the ICP and the perfect use-cases, so I implemented a system that lets me know on which websites my app is being used.\n\n(I can't read any transcripts or see which user uses which website)\n\nTurns out - it was mostly used on AI girlfriend chats and weird websites where men are scammed by fake women.\n\nI originally built the app to help people who struggle with typing. Turns out if you're talking to your AI girlfriend, you only have 1 hand to type. FAIR ENOUGH HONESTLY\n\nSo I monetized it, and guess what - I only got signups from people using it for work and serious writing.\n\nAfter I introduced limits the p\\*rn usage dropped hard too.\n\nI posted this on reddit a while ago and people told me I should lean into it. But I decided not to do it.\n\nI blocked ALL scammy websites where people are being tricked, but I left the AI girlfriend pages available. I just didn't do anything about it.\n\nInstead, I focused on my paying users and their specific needs. They wanted to use my tool in Microsoft Word, ChatGPT, Google Docs, etc. So I created a landing page for each of these use-cases.  \nIf you go on my website you can see I have about 20 specific landing pages.\n\nSEO kicked in within weeks and started ramping up proper sales.  \nI also leaned in harder into the disability use case and offer 20% off for everyone who struggles with typing.  \nThis has been WAY more fulfilling than helping people c\\*m.\n\nNow I just closed my best month with $3k in revenue and a set of users who are really my perfect customer profile.\n\nNo lesson in here, but thought it would be fun to share!",
        "subreddit": "SaaS",
        "author": "Kghaffari_Waves",
        "score": 205,
        "num_comments": 69,
        "created_utc": 1759514872.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nx6kxx/my_saas_was_used_for_prn_and_now_it_makes_3kmonth/",
        "fetched_at": "2025-10-04T00:50:07.887584"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 173,
        "num_comments": 46,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-04T00:50:13.332003"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 165,
        "num_comments": 50,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-04T00:50:13.331995"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 148,
        "num_comments": 179,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-04T00:50:13.332035"
      },
      {
        "id": "1nx46eg",
        "title": "Step by step taking eCom brand from $80k/mo to $300k/mo without ads",
        "selftext": "If youve been running ads for eCommerce, SaaS, or mobile apps you probably realized Meta ad performance has been abysmal the past year.\n\nWe used to grow eCommerce brands primarily with meta ads but CPMs just kept rising and conversions kept decreasing. And this was BEFORE the latest andromeda update.\n\nAnyways here’s how we took a Canadian eCommerce brand from $80k in April to over $300k (CAD) in June. They sell sleepwear but this approach also works for B2C SaaS, record labels & mobile apps.\n\nHope this helps even one person ahead of Q4.\n\nHere are the exact steps:\n\n1. Get a bunch of US phones with TikTok then scroll the explore page and like things in your niche. Search for related hashtags, then engage with the videos so your feed is personalized.\n\n2. Prepare a TON of videos by replicating what you see on your #foryou page. Literally copy and redo the videos and follow formats that are already proven to work. This can be as simple as a 20 second video with a caption over it and a viral song. Don’t overthink it! For eCommerce also carousels work really well.\n\n3. By using up to 5 hashtags (like #foryou and #explore and niche ones) we get way more views. Also showing human faces, even if AI generated, helps a lot.\n\n4. Then just post like crazy and DON’T stop consistent uploads. We posted almost 1,000 videos between April and June. Average view per video was 16k views but that meant some were 800 views and some were 2m.\n\n5. Don’t put all your hopes on any 1 video. It’s a numbers game. We posted an average of 16 videos a day across 8 pages. For the first 15 days things looked bleak and it was barely breakeven. Then by day 41 we hit a viral winner. 4 days later another one because once you go viral once on a specific topic / brand it’s easier to get views. There’s more awareness around it now.\n\n6. Just keep it simple and rinse and repeat. This beats dumping all your money into Meta and hoping the algorithm treats you well. Also our viral videos ended up becoming some of the top ads for this brand who reused them in paid campaigns.\n\nIf anyone has questions, ask away. Good luck in Q4 everyone!",
        "subreddit": "Entrepreneur",
        "author": "cmo_simon",
        "score": 132,
        "num_comments": 31,
        "created_utc": 1759509530.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nx46eg/step_by_step_taking_ecom_brand_from_80kmo_to/",
        "fetched_at": "2025-10-04T00:50:06.156523"
      },
      {
        "id": "1nwds7y",
        "title": "YC vs SkyDeck (i will not promote)",
        "selftext": "I’m curious about the real differences between Y Combinator and Berkeley SkyDeck.\n\nYC is obviously the most famous, with the strongest global network, while SkyDeck seems to offer more equity-friendly terms and strong ties to Berkeley (access to research, students, advisors, etc.).\n\nHas anyone here gone through either program (or both)?\n\nWhat was your experience like?\n\nLooking back, would you do it again?",
        "subreddit": "startups",
        "author": "bolaretyr",
        "score": 124,
        "num_comments": 11,
        "created_utc": 1759434171.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nwds7y/yc_vs_skydeck_i_will_not_promote/",
        "fetched_at": "2025-10-04T00:50:09.643765"
      }
    ]
  }
}