{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-08-30T00:52:04.065707"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-08-30T00:51:57.272021"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-08-30T00:51:57.272028"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-08-30T00:51:56.808924"
      },
      {
        "videoId": "SSE2weHo_IE",
        "title": "10 Simple Video Production Workflow Tips and Tricks",
        "description": "10 simple video production tips and tricks to help you save time and do more with video. What I used or mentioned to produce ...",
        "channelTitle": "Kevin Kolbe",
        "publishedAt": "2023-11-16T14:30:35Z",
        "url": "https://www.youtube.com/watch?v=SSE2weHo_IE",
        "fetched_at": "2025-08-30T00:51:56.808932"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-08-30T00:51:56.808913"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-08-30T00:51:57.272024"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-08-30T00:51:57.272026"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-08-30T00:51:56.808928"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-08-30T00:51:57.272010"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-08-30T00:51:56.808930"
      }
    ],
    "reddit": [
      {
        "id": "1n2dt12",
        "title": "The dark secret of entrepreneurship that no one tells you about, and how to deal with it",
        "selftext": "Saw a post earlier today about how lonely the founder’s path really is. I dropped a long reply there, but this topic hit me so deep I felt it deserved its own thread.\n\nHere’s the truth nobody hypes on LinkedIn:\n\nStarting a company is like breaking out of prison. The 9 to 5 cage feels safe through steady paycheck, social life, weekends off. But when you escape, you enter a world that’s free but brutal. Freedom comes with wounds, sacrifices, and nights when it’s just you and your doubts.\n\nIt’s not just “loneliness”, it’s being alone in your thoughts. Your friends don’t get it, family nods politely, and even co-workers (if you have any) aren’t lying awake thinking about cash flow and churn. You carry that mental weight solo.\n\nThen come the sacrifices:\n\nFinancial → You go from spending freely to questioning every expense.\n\nRejection → Months of work, 50+ investor rejections, endless pivots.\n\nBias → Judged on your passport, accent, gender, even your postcode.\n\nSide hustles → Odd jobs, freelancing, hustling just to survive.\n\nBut you’re not actually alone. Many before you walked this road, and what waits at the end of the tunnel is worth it:\n\n1. Family that stood by you\n\n2. Financial freedom\n\n3. Physical freedom\n\n4. A transformed mindset\n\nAt that point, you realize what you really gave up was just time, a fraction of what you wasted in the cage.\n\n💡 TL;DR: Entrepreneurship is dark, lonely, and brutal, but you’re not the only one walking this road. The pain is the price of freedom.\n\nStay blessed, fellow founders. Shout out if you need someone who’s been there, plenty of us are carrying candles along the path.",
        "subreddit": "Entrepreneur",
        "author": "N-Innov8",
        "score": 448,
        "num_comments": 88,
        "created_utc": 1756391430.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n2dt12/the_dark_secret_of_entrepreneurship_that_no_one/",
        "fetched_at": "2025-08-30T00:51:57.657040"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 442,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-08-30T00:52:03.064342"
      },
      {
        "id": "1n2v0by",
        "title": "I joined Reddit a year ago and now my small business is thriving 😭",
        "selftext": "A year ago I was ready to rename or give up on our business entirely and since then it’s gone from “zero to 100…real quick” and we even won an award over the summer.\n\nThis community has been such a source of support and random resources, so just wanted to say thank you! \n\nRooting for all of you and your small businesses from afar 🙌🏽",
        "subreddit": "smallbusiness",
        "author": "weddinglandia",
        "score": 330,
        "num_comments": 67,
        "created_utc": 1756432879.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n2v0by/i_joined_reddit_a_year_ago_and_now_my_small/",
        "fetched_at": "2025-08-30T00:52:01.767130"
      },
      {
        "id": "1n31sej",
        "title": "Devastating sales decline since U.S. tariffs and shipping suspension worldwide",
        "selftext": "I live in Europe and have put everything into building my handmade brand shop. Until recently, 90% of my sales were to the US. But since the abrupt end of the $800 de minimis exception, and with almost every country in the world suspending shipping to the US, my sales have nearly stopped overnight, like someone flipped a switch.\n\nThis shop is my full-time job and how I provide for my family. I’m devastated at the thought that I may have to look for another job and return to the rat race that made me so ill in the past.\n\nWhat I don’t understand is this: if so many small businesses are facing the same problem, does it mean that EU buyers simply don’t want to spend money on quality handmade products?\n",
        "subreddit": "smallbusiness",
        "author": "Dismal_County3654",
        "score": 317,
        "num_comments": 116,
        "created_utc": 1756456006.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n31sej/devastating_sales_decline_since_us_tariffs_and/",
        "fetched_at": "2025-08-30T00:52:01.767122"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 270,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-08-30T00:52:03.064393"
      },
      {
        "id": "1n2tja9",
        "title": "I have stopped chasing money and money arrives whenever I need now",
        "selftext": "Hi entrepreneurs, wannabe entrepreneurs. \nOut of all the long working hours, hustle i had in the past, I have arrived at a conclusion: Stop Chasing Money. You will run after money and money will speed up and you have to speed up too, but you will not have money. \nChase your passion, satisfaction, you will see money will come to you. \nThat's my real life experience and I am satisfied now. \nAlso have started podcast to spread the knowledge for upcoming entrepreneurs. Thoughts are welcome. ",
        "subreddit": "Entrepreneur",
        "author": "XIFAQ",
        "score": 205,
        "num_comments": 165,
        "created_utc": 1756428725.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n2tja9/i_have_stopped_chasing_money_and_money_arrives/",
        "fetched_at": "2025-08-30T00:51:57.657023"
      },
      {
        "id": "1n3dq0s",
        "title": "the receptionist who rerouted $10k in deposits to her venmo",
        "selftext": "a medspa in downtown miami we work with had this weird pattern show up when they were closing the books each month. like every week there’d be $50 or $100 missing here and there from appointments. nothing huge at first, but it kept adding up and nobody could figure out where it was going.\n\nturns out the front desk girl was taking deposits straight to her own venmo. she wasn’t even deleting bookings or anything, just pocketing the money and letting the rest of the payment go through later. patients thought everything was fine, but the clinic was quietly losing thousands a month without realizing.\n\nthey only caught it after the accountant dug deep and noticed the same random shortfalls tied to certain bookings. the owner was stunned and felt betrayed since the woman had begged for the job to support her children\n\nif you're asking how they did not notice earlier, this clinic does 6figs a month and so it wasn't anything crazy at first but after 2 months and $10k 'magically' missing the accounting team dug deep, not all their services require a deposit but the total per service is a defined value and when that value is missing $50-$100 consistently it becomes easy to find the leak\n\nquestion if anyone in the beauty industry experiences this? or maybe in your industry",
        "subreddit": "Entrepreneur",
        "author": "maverickhealthagents",
        "score": 148,
        "num_comments": 51,
        "created_utc": 1756488604.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n3dq0s/the_receptionist_who_rerouted_10k_in_deposits_to/",
        "fetched_at": "2025-08-30T00:51:57.657011"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 143,
        "num_comments": 172,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-08-30T00:52:03.064376"
      },
      {
        "id": "1n3b13i",
        "title": "you don’t need to quit your fucking job to build something real",
        "selftext": "There’s this absolutely delusional, toxic mindset floating around indie hacker and startup circles - this idea that you need to quit your job, “go all in,” and live on instant noodles in a furnitureless apartment \"founder mode\"\n\nFuck that.\n\nYou know what’s more stressful than having limited time to work on your project?\nNot knowing how you’re going to pay rent.\nNot having insurance.\nWatching your bank account bleed out while your MVP gets 14 signups and no revenue.\n\nThis isn’t a movie. You’re not Zuckerberg.\nYou’re not proving your commitment by quitting your job - you’re just removing your safety net before you’ve even built a working product.\n\nYou want to be a serious founder?\nGet a job. Full-time, part-time, whatever. Make money. Buy groceries. Pay bills. Get your health together. And then nutt up and build something after hours, like a fucking adult.\nStability isn’t weakness. It’s a competitive advantage.\n\nYou don’t need 12 hours a day - you need 2 hours of focus, a plan, and consistency.\nStartups aren’t just about risk - they’re about execution.\nAnd you can’t execute shit if you’re hungry, anxious, and panicking about how to pay your damn bills.\n\nYou’re not “less legit” because you’re working a job.\nYou’re smarter. Safer. And long-term?\nWay more likely to succeed.\n",
        "subreddit": "SaaS",
        "author": "CourseSpare7641",
        "score": 119,
        "num_comments": 49,
        "created_utc": 1756482474.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n3b13i/you_dont_need_to_quit_your_fucking_job_to_build/",
        "fetched_at": "2025-08-30T00:51:59.059630"
      },
      {
        "id": "1n3cig2",
        "title": "What systems are you guys using to stay ahead on sourcing?",
        "selftext": "I’ve been experimenting with flipping small stuff arbitrage and honestly the hardest part isn’t finding items it’s missing out on the good deals. Most days it feels like a signal vs. noise thing. By the time I check shipping, condition, seller reliability someone else already bought it. Right now I'm using saved searches, spreadsheets, and alerts. It works but im open to know other systems? I keep seeing other buyers who seem to be killing it like they’ve figured out ways to do it or just decide quicker.",
        "subreddit": "Entrepreneur",
        "author": "Valuable_Control4855",
        "score": 118,
        "num_comments": 5,
        "created_utc": 1756485874.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n3cig2/what_systems_are_you_guys_using_to_stay_ahead_on/",
        "fetched_at": "2025-08-30T00:51:57.657013"
      }
    ]
  }
}