{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-13T16:15:21.794456"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-13T16:15:12.553022"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-13T16:15:12.205477"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-13T16:15:12.205469"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-13T16:15:12.205455"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-13T16:15:12.552997"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-13T16:15:12.553031"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-13T16:15:12.553027"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-13T16:15:12.205473"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-13T16:15:12.552984"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-13T16:15:12.205472"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 478,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-13T16:15:20.793047"
      },
      {
        "id": "1ov93ip",
        "title": "Health insurance benefits seem impossibly expensive. What am I missing?",
        "selftext": "Small business has 15-20 employees. Most are part time, and a few are full time. One part time staff has asked if we plan to provide healthcare benefits (plus vision and dental) at some point. She has a daytime / full time job where she is getting benefits currently and said she would like to come over full time if we can provide benefits. She says that her current employer \"takes care of everything\" and that she does not pay any contribution to the plan. So I said I will look into it. For her plus her spouse and child, the total monthly premium on a mid-level package is about $2,200 per month if I did 100% employer contribution. For context she is support staff making $29 / hr.\n\nFor me it's too much of a stretch to justify at $26K annual benefits package for someone whose base is roughly $60K / yr. I could change the contribution rate to say 50/50, but then I'm not competitive with her current FT employer and I think the premium split at 50% would be prohibitive for her and her family anyway.\n\nSo the question is: how do small businesses do this? I know there are a lot of options out there, but for those of you that have been down this road, what did you learn along the way? What was the best option that you settled on? I'd really like to offer competitive comp packages, but health benefits seem especially difficult.\n\nThanks!",
        "subreddit": "smallbusiness",
        "author": "anon7971",
        "score": 214,
        "num_comments": 142,
        "created_utc": 1762963340.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ov93ip/health_insurance_benefits_seem_impossibly/",
        "fetched_at": "2025-11-13T16:15:18.638788"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 187,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-13T16:15:20.793090"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 180,
        "num_comments": 33,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-13T16:15:20.793070"
      },
      {
        "id": "1ovpacl",
        "title": "Client owes $162k",
        "selftext": "Totally my fault for being loyal and letting their balance get so crazy.  The client basically ghosted me and have stopped trying to pay anything at all after I stopped service.  \n\nI don’t have a contract in place.\n\nMy attorney said that going through court will be a loss cause so I’ve accepted that I will not see this money .  I want to inflict as much (legal) pain as possible without having to go to court and I don’t mind paying some money.  \n\nAnyone have any experience with collection agencies or have any other options?  \n\nBoth business are located in California ",
        "subreddit": "smallbusiness",
        "author": "knarfn",
        "score": 143,
        "num_comments": 184,
        "created_utc": 1763000953.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ovpacl/client_owes_162k/",
        "fetched_at": "2025-11-13T16:15:18.638778"
      },
      {
        "id": "1ov8std",
        "title": "Just talked to a founder who proudly said his business has a 120% profit margin",
        "selftext": "So I’m on a call with this founder, running through their numbers, right?\n\nRevenue looks good. Expenses fine. Then I ask about profit margins, and he goes -*Yeah, we’re at 120%.*\n\nI pause. Thinking maybe I misheard. Nope. Man straight up said he’s making more profit than revenue.  \nBro has officially defeated capitalism.\n\nI didn’t even know what to say at that point. Do I correct him? Congratulate him? Ask for investment advice?\n\nAt this rate, next week someone’s gonna tell me their CAC is *negative* because customers pay them to be acquired. ",
        "subreddit": "SaaS",
        "author": "Silver_Mistt",
        "score": 134,
        "num_comments": 130,
        "created_utc": 1762962693.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ov8std/just_talked_to_a_founder_who_proudly_said_his/",
        "fetched_at": "2025-11-13T16:15:15.105331"
      },
      {
        "id": "1ovl7w9",
        "title": "I got played by a business couple connected to a huge influencer and it is embarrassing how much I believed their promises",
        "selftext": "This is based in Ontario, Canada 🇨🇦 \n\nI am not mentioning names because I do not want legal issues, but I need to get this off my chest.\n\nA while ago I started providing cleaning services for a couple who owned an Airbnb. The husband acted like a big entrepreneur and constantly talked up his plans. His wife was an influencer with millions of followers. I barely ever spoke to her and she never communicated with me, but he kept bringing her up as if her follower count meant their business was legitimate.\n\nHis business partner was a realtor and the two of them acted like they were on the verge of building a large real estate empire. They told me they were buying 13 properties in Orlando and said I would get all the cleaning contracts. I run a cleaning agency and handle hiring, interviews, scheduling and operations, but I still let their hype get to me.\n\nLooking back, it is embarrassing how much I believed them.\n\nThey pushed me to lower my prices and told me I would make more long term because of the volume they would bring. Lower rates meant cleaners made less money and did not want to work their job, which caused constant staffing issues. They did not care. They just wanted cheaper labor.\n\nThey nitpicked everything. Small towel marks, tiny smudges, anything they could point to. One time four towels were slightly dirty. Instead of washing them, he ordered more than two hundred dollars worth of towels and cloths without asking and then made me pay him back for the order. He acted like he was helping me by explaining how to claim the HST.\n\nHe often acted friendly and gave me advice as if he was mentoring me, then switched into being demanding and controlling. The most insulting thing he said was, “You should not run a cleaning business if you are not a cleaner.” I run a real agency. I am educated and I manage the business. I do not need to personally scrub toilets to operate a company. His comment showed he did not respect what I built.\n\nSomething important is that during this time I kept asking him about Orlando. I told him I was planning to open a branch there. I told him I was hiring people. He knew I was taking the opportunity seriously and believed what he said. Despite that he kept lying about the 13 houses and the future work. He watched me prepare for something that did not exist.\n\nEventually my only Hamilton cleaner quit and after more than thirty hours of interviewing and reviewing applications I realized the entire situation was a dead end. Their budget did not match their expectations and every cleaner disliked going there. The promises were never real.\n\nI finally sent a formal message ending the relationship and telling them I would no longer be providing cleaning services. They never replied. No thank you. No acknowledgment. Nothing.\n\nThat silence told me everything.\n\nHere is the interesting part. Because of their constant talk about Orlando, I actually opened a branch there. I hired people and started operating. And somehow it worked. I am now running my agency in Orlando and so far it has been more successful than what I had in Hamilton. I never would have considered Orlando if it was not for their story, even though their own plans were fake.\n\nSo in a strange way, something good did come out of this. I just had to learn the hard way that not everyone who talks big is telling the truth.\n\nHere is what I learned:\n\nPeople connected to influencers are not automatically professional or honest.\nPeople who promise future opportunities often want discounts today.\nFriendly behavior does not mean respect.\nAnyone who tries to devalue your work is not a partner and never will be.\nSometimes walking away is the best business decision you can make.\n\n\n\n\nForgot to add:\n\nThe biggest red flag I ignored was the fact that they dropped their long time cleaner for my company. No warning to her, nothing. They just kicked her out to start using me. She was really good to them from what I heard & only had a minor scheduling issue. Also, the main guy I was dealing with lied to me that “guests are refusing to pay the higher cleaning fee” when he never updated the cleaning fee on Airbnb from $120 to $200 (which is what I charged him). I know this because I checked the listing every day for new reviews. So that was also a ploy to get me to lower the cleaning fee… I’m probably forgetting some things.",
        "subreddit": "smallbusiness",
        "author": "Radiant_Alarm771",
        "score": 133,
        "num_comments": 66,
        "created_utc": 1762990215.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ovl7w9/i_got_played_by_a_business_couple_connected_to_a/",
        "fetched_at": "2025-11-13T16:15:18.638780"
      },
      {
        "id": "1ovdtj2",
        "title": "We just lost our biggest client because we didn’t have ISO 27001",
        "selftext": "CLARIFICATION > I'm just an employee within the company (not the compliance lead). We got the email this morning. They’re pausing the partnership until we can demonstrate ISO 27001 certification (which is a polite way of saying we’re out haha). We’ve been working with them for almost a year and everything was smooth and then some new compliance officer on their side joined and they started asking us questions about policies and stuff and finally the ISO certificate request\n\n\n\n  \nWe’ve got our SOC 2 Type I done (which took fucking forever) but apparently without ISO 27001 they can’t keep working with us. It’s super frustrating because we literally passed all their technical reviews last quarter. I get why enterprises need these certificates, but it just feels like these standards are super hard on smaller startups who are just trying to do things right but don't have any prior compliance knowledge (us for example)\n\n  \nHow do/did other early stage teams handle this like did you start ISO from day one or only after you land customers?",
        "subreddit": "SaaS",
        "author": "Current-Oil4743",
        "score": 122,
        "num_comments": 42,
        "created_utc": 1762973494.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ovdtj2/we_just_lost_our_biggest_client_because_we_didnt/",
        "fetched_at": "2025-11-13T16:15:15.105320"
      },
      {
        "id": "1ovlu5n",
        "title": "Please stop asking \"what business should I start?\"",
        "selftext": "It's a dumb question. You're not dumb, just maybe uninformed, which I will rectify shortly. But the question is very, very dumb.\n\nFirst off, people who ask \"what business should I start?\" are really asking \"how can I make a lot of money?\"\n\nStraight up, starting a business is a crappy way to make a lot of money. Statistically most people lose money. You're probably going to lose money. So, if you want to make a lot of money, get into management consulting or ibanking, which generally means getting an MBA. Have fun with that.\n\nSecondly, people who ask \"what business should I start?\" generally think that businesses are fungible, which means they're a commodity or easily swapped out with one another. This, btw, is why most businesses fail. Because people think that businesses are just this thing that you start and money comes out the other end.\n\nIf I said a great business is rolling up a bunch of dentist practices, would you know what to do with that? Like, do you have dentistry experience? Do you have PE experience rolling up companies? If the answer is no to both, don't fucking roll up a bunch of dentist practices. It requires skills you don't have.\n\nIf I said, \"ooh! ooh! ooh! AI, baby! AI is gonna change everything,\" are you especially good at AI? If you're not, then one school of thought would say that AI is a growing market, so you should learn AI and sell those services to other people. There's another school of thought that says every fucking person and their grandmother is learning AI right now so they can sell  services to other people and I really wonder what you are going to discover about AI that's going to make you better than my grandma.\n\nLastly, markets aren't interchangeable either.\n\nI spent nearly 30 years starting tech companies. Had a few successes and a bunch of failures. Now, I'm a world-class startup coach. I do that job exceptionally well, I have great word of mouth, make a lot of money. And when I started, I knew A LOT of people in several startup ecosystems. My access to that market helped me get off the ground and eventually scale this business.\n\nIf I decided to start a company selling shit to celebrities, I would fail. I would 100% fail. Why? I don't know any celebrities. I don't have access to that market and I'd probably run out of money and time before I figured out how to get celebrities' attention.\n\nStop asking what business you should start. They aren't lego bricks.\n\nHere's a much better question to ask yourself: what do I love to do?\n\nFind something you love to do. Get good at it. Prove that you're good at it by selling your services to other people, either as an employee or a contractor. Get promoted and get a great title. Or become a consultant, which is just a contractor who charges a shit ton of money.\n\nGet so good at what you love that you know things about your job and market that no one else knows about. Understand secrets about your industry that give you a fundamentally unfair advantage over everyone else. Even my grandmother.\n\nThen go start a business using that knowledge. That's the business you should start.\n\nEDIT: random spelling and grammatical errors. I type for shit.",
        "subreddit": "Entrepreneur",
        "author": "Character_Fail_6661",
        "score": 119,
        "num_comments": 47,
        "created_utc": 1762991775.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ovlu5n/please_stop_asking_what_business_should_i_start/",
        "fetched_at": "2025-11-13T16:15:13.280782"
      },
      {
        "id": "1ov9w12",
        "title": "I analyzed 847 successful startups and found that 90% of startup advice is backwards. The companies that won violated every rule. Here are the 10 foundation truths nobody tells you. (Part 1/5)",
        "selftext": "\n**The breaking point that started this:**\n\nMonth 6 of researching startup failures. Read my 247th “how we grew to $1M ARR” post. Same advice: “Focus on product-market fit.” “Hire slow, fire fast.” “Listen to customers.”\n\nGeneric. Useless. Zero examples of HOW.\n\nThat night, 2:47am, I did something different. Stopped reading success blogs. Started reading actual company histories. The REAL stories. The near-deaths nobody talks about. The pivots that saved them.\n\n**The math that broke my brain:**\n\nAfter 6 months studying 847 companies:\n\n- 100% pivoted multiple times (average: 3.2 pivots)\n- 73% almost died at least once before success\n- 89% violated “conventional wisdom” at critical moments\n- The advice that works ≠ the advice that’s popular\n\n**I was studying the wrong thing. Everyone was.**\n\n\n\n## THE INSANE REALIZATION\n\n**Saturday, 9:23am.** Sitting at coffee shop. Spreadsheet open. 847 rows of companies. Columns: “Pivot count,” “Near-death experiences,” “Rules violated.”\n\nPattern emerged: **The companies that won did the OPPOSITE of startup advice.**\n\nExamples:\n\n- Airbnb sold cereal boxes (every guru: “focus on product”)\n- Slack was a failed gaming company (every guru: “pivot fast”)\n- Instagram had 15 features, killed 13 (every guru: “ship features”)\n\n**The brutal truth hit me:** Startup advice is survivor bias presented as strategy. The real patterns were hidden in the near-death moments.\n\n\n\n## WHAT I DID NEXT (The 6-Month Deep Dive)\n\nBuilt a research system:\n\n1. Found 847 companies that reached $100M+ valuation\n1. Read every founder interview, early blog post, documentary\n1. Tracked: Pivots, near-deaths, contrarian decisions, timing\n1. Looked for PATTERNS, not individual stories\n\n**Result:** 50 truths that separate billion-dollar companies from dead startups.\n\nToday: Part 1. The Foundation. The 10 truths that determine if you even have a chance.\n\n**Get these wrong, the other 40 won’t save you.**\n\n\n\n## TRUTH #1: Your First Idea Will Fail. Budget For Idea #3.\n\n**The pattern I found:** 100% of successful companies pivoted. Not once. Multiple times. Average: 3.2 major pivots.\n\n**Slack:** Stewart Butterfield (2013). Started as Glitch (gaming company). Built it for 3 years. Raised $17M. Game failed completely.\n\nThe chat tool they made for their team? That became Slack. Stewart: “We were shutting down. The chat tool was just for us. Users asked to use it. We said… okay?”\n\n$27B company from failed game.\n\n**Instagram:** Kevin Systrom (2010). Built Burbn (Foursquare competitor). Check-ins, photos, plans, comments, games. Too complicated.\n\nNoticed users only shared photos. Stripped everything except photo filters. Became Instagram. 13 employees. Sold for $1B to Facebook.\n\n**YouTube:** Chad Hurley and Steve Chen (2005). Video dating site. Slogan: “Tune in, Hook up.” Nobody uploaded dating videos.\n\nSitting in office: “What if it’s ANY video?” Pivoted in ONE meeting. Changed internet history.\n\n**Twitter:** Jack Dorsey at Odeo (2006). Podcasting platform. Apple launched iTunes podcasting. Killed Odeo overnight.\n\nEmergency brainstorm meeting. “What about status updates?” Built Twitter in 2 weeks. Now worth $40B+.\n\n**The brutal truth:** Every founder thinks their first idea is “the one.” It never is. Your first idea teaches you what your third idea should be.\n\n**What to do:**\n\n- Budget runway for 2-3 complete pivots financially and psychologically\n- If you only have runway for one idea, you don’t have enough runway\n- Fall in love with the PROBLEM, not your solution\n- Your solution will change 10 times. Your problem shouldn’t.\n\n\n\n## TRUTH #2: The Market Doesn’t Care About Your Product. Only Their Problem.\n\n**The pattern I found:** Winners obsessed over customer problem. Losers obsessed over their solution.\n\n**Airbnb:** Brian Chesky (2008). Didn’t love “air mattresses.” Loved solving: “I can’t afford SF rent. Design conference sold out all hotels. I have empty apartment.”\n\nAir mattresses = Version 1. Also tried: Selling cereal boxes (“Obama O’s”) for funding. Different solutions. Same problem (affordable housing during events).\n\nProblem stayed constant. Solutions evolved. Now worth $75B.\n\n**Amazon:** Jeff Bezos (1994). Didn’t love “websites.” Loved: “I want any book, but stores only stock bestsellers.”\n\nStarted with books only. Problem was always “infinite selection + convenience.” That’s why expansion worked (same problem, more products).\n\nVision: “Earth’s most customer-centric company” (problem focus). Strategy: Books → Everything → AWS → Prime (solution evolution).\n\n**The brutal truth:** Your solution will change 10+ times in 5 years. If your core problem changes, you’re lost. You’re starting over.\n\n**What to do:**\n\n1. Write the exact problem you’re solving (one sentence)\n1. Put it above your desk where you see it daily\n1. Every product decision: “Does this solve THE problem or just MY solution?”\n1. If you can’t articulate the problem in 10 words, you don’t understand it\n\n\n## TRUTH #3: Funding Doesn’t Validate Your Idea. Revenue Does.\n\n**The pattern I found:** Money = someone believes your POTENTIAL. Paying customers = they believe your REALITY.\n\n**The catastrophic failures:**\n\n**Theranos:** Elizabeth Holmes. Raised $700M. Walgreens partnership. $10B valuation peak.\n\nZero working product. Complete fraud. Blood tests never worked. Now serving 11 years in prison.\n\nLesson: Investors believed vision. Reality didn’t exist.\n\n**Quibi:** Jeffrey Katzenberg + Meg Whitman. Raised $1.75B. Hollywood elite backing. 10M app downloads at launch.\n\nCouldn’t get users to pay $5/month after free trial. Shut down in 6 months. Lost nearly everything.\n\nLesson: Investors believed in resumes. Customers wanted long-form on TV, not short-form on mobile.\n\n**WeWork:** Adam Neumann. Raised $12.8B. Masayoshi Son believed vision (“elevating consciousness”). Valued at $47B.\n\nIPO process exposed: Losing money on every lease. No path to profitability. Dropped to $8B. Adam forced out.\n\nLesson: Vision was amazing. Unit economics were catastrophic.\n\n**The bootstrap success stories:**\n\n**Mailchimp:** Ben Chestnut (2001-2021). Zero VC funding ever. Built as side project while doing web design consulting.\n\nGrew to $700M revenue. Sold to Intuit for $12B. Bootstrapped the entire 20 years.\n\n**Spanx:** Sara Blakely (1998-present). $5K of savings. Sold fax machines door-to-door to fund it initially. Zero investors.\n\nBootstrapped to $400M revenue. Billionaire. Maintained 100% control until 2021 sale.\n\n**The brutal truth:** Money is a megaphone. If your message (product-market fit) is wrong, the megaphone just broadcasts failure faster.\n\nFunding = belief. Revenue = proof.\n\n**What to do:**\n\n- Get ONE paying customer before you raise money\n- Just one real person who gives you real money\n- If you can’t get one person to pay $10, you can’t get 100 to pay either\n- Revenue is the only validation that matters\n\n\n## TRUTH #4: Your Weakest Team Member Defines Your Culture, Not Your Strongest.\n\n**The pattern I found:** Culture doesn’t flow up from your best people. It flows down from what you tolerate in your worst.\n\n**Uber (Travis era):** Hired aggressive “winners.” Growth at all costs. “Principled confrontation” was a core value.\n\nOne toxic VP (Emil Michael, 2014) suggested investigating journalists who wrote negative articles. Not an outlier. This was the culture.\n\nSusan Fowler’s blog post (February 2017) exposed systemic harassment. Travis forced out June 2017. Stock dropped 20%. Company almost died.\n\nThe “aggressive winner” culture became “toxic harassment” culture. What you tolerate defines you.\n\n**Facebook (2010-2016):** “Move fast and break things” was exciting with 20 engineers shipping features.\n\nBecame “break privacy laws and democracy” with 20,000 employees shipping at scale.\n\nCambridge Analytica scandal (2018). $5B FTC fine (2019). Senate testimony. “Move fast” culture that worked at 20 people destroyed trust at 20,000.\n\n**The success stories:**\n\n**Stripe:** Patrick and John Collison (2010). Hired for “intellectual honesty” and “clear writing” from day 1. Not just coding ability.\n\nWhy? Wanted people who think clearly and communicate precisely. That standard set the culture.\n\nResult: Industry-leading reputation. No major scandals despite handling billions in payments daily.\n\n**Netflix:** Reed Hastings (1997-present). “Adequate performance gets generous severance.” Set from day 1.\n\nClear standard: Excellence or graceful exit with great severance. No middle ground of “acceptable mediocrity.”\n\nHigh performers stay because everyone around them performs. Culture maintains itself through standards.\n\n**The brutal truth:** You don’t build culture by hiring A+ players. You build it by immediately firing C players.\n\nThe person you keep despite poor performance becomes the new standard.\n\n**What to do:**\n\n1. First 10 hires define culture 100x more than next 90\n1. Hire slowly (multiple weeks of interviews, reference checks)\n1. Fire quickly (when you know it’s wrong, it’s wrong)\n1. The moment you compromise standards, that’s your new standard\n\n\n## TRUTH #5: Investors Don’t Care About Your Vision. They Care About Your Progress Per Dollar.\n\n**The pattern I found:** VCs fund EVIDENCE of efficient growth, not ideas or visions.\n\n**Dropbox (2007):** Drew Houston at YC Demo Day. “Cloud storage” = boring. Microsoft, Google, Apple all had cloud storage.\n\nBUT: One demo video on Hacker News. 75,000 signups in 24 hours. $0 spent on marketing.\n\nFunded immediately. Not because “cloud storage” was interesting. Because he proved demand at $0 CAC (customer acquisition cost).\n\nEvidence: One $0 video = 75K signups = proven demand.\n\n**Superhuman (2017):** Rahul Vohra. Pitched “$33/month email client” in world of free Gmail. Sounds insane.\n\nBUT: Waitlist had 200,000 people before public launch. In beta, 75% said they’d be “very disappointed” if Superhuman went away.\n\nRaised $33M Series B. Not because expensive email is smart. Because he proved people would pay premium for better email.\n\nEvidence: 200K waitlist + 75% “very disappointed” score = proven demand.\n\n**The brutal truth:** Investors don’t fund ideas. They fund evidence that you can convert capital into growth efficiently.\n\n**What to do:**\nBefore fundraising, know these numbers exactly:\n\n- CAC (cost to acquire one customer)\n- LTV (lifetime value of one customer)\n- Payback period (months to break even on CAC)\n- LTV:CAC ratio (should be 3:1 or higher)\n\nIf you don’t know these, you’re not ready to raise.\n\n\n## TRUTH #6: Your Product Roadmap Is Fiction. Your Customer Conversations Are Reality.\n\n**The pattern I found:** Winners kill their roadmaps when customers show them reality.\n\n**Instagram (2010):** Kevin Systrom launched Burbn with 15 planned features:\n\n- Check-ins (like Foursquare)\n- Future plans\n- Photo sharing with filters\n- Commenting\n- Likes\n- Points/gamification\n- Integration with other apps\n\nUsers ignored 13 features. Only used photos + filters.\n\nSystrom’s brutal decision: Kill 13 features. Keep 2 (photo sharing + filters). Team protested: “But we built all this!”\n\nSystrom: “Nobody uses it. Ship what they actually use.”\n\nResult: Instagram. Sold for $1B two years later.\n\n**WhatsApp (2009):** Jan Koum’s founding principle: “No ads. No games. No gimmicks.”\n\nEvery investor offer: “But you could add features and monetize!”\nEvery acquisition: “We’ll help you add revenue features!”\n\nKoum said no for 5 years. Why? Users explicitly said: “We just want messaging that works and respects privacy.”\n\nStayed focused. Sold to Facebook for $19B. On his terms (promised no ads).\n\n**The brutal truth:** Your roadmap = your assumptions about what users want. Customer behavior = reality. Reality wins.\n\n**What to do:**\n\n1. Do 5 customer calls per week. Every week. Forever. Non-negotiable.\n1. Ask: “What do you use? What don’t you use? Why?”\n1. Watch behavior > statements (they say X, but do Y)\n1. Kill features with low usage, even if you love them\n\n\n## TRUTH #7: The Best Time To Pivot Was Yesterday. The Second Best Time Is Today.\n\n**The pattern I found:** Winners pivot immediately when data says pivot. Losers wait until desperate.\n\n**Nintendo (1889-present):** Started as playing card company in Kyoto, Japan (1889).\n\nPivoted to toys (1960s). Pivoted to video games (1970s). Now: Video games + theme parks + movies.\n\n134 years of pivoting based on market reality. Never emotionally attached to “being a card company.”\n\n**YouTube (2005):** Chad Hurley and Steve Chen. Built video dating site for 6 months. Slogan: “Tune in, Hook up.”\n\nZero traction. Users weren’t uploading dating videos.\n\nOne meeting: “What if it’s just ANY video? Not dating?”\nPivoted immediately. Didn’t wait. Data was clear: dating videos = 0 uploads.\n\n18 months later: Sold to Google for $1.65B.\n\n**Contrast - The ones who didn’t pivot:**\n\n**Quibi (2020):** Jeffrey Katzenberg. $1.75B raised. Launched “short-form video for mobile.”\n\nData after launch showed clearly:\n\n- Users wanted long-form content\n- Users wanted to watch on TV, not just mobile\n- Premium content didn’t work at $5/month\n\nKatzenberg refused to pivot. “I know Hollywood. I know what works.”\n\nShut down 6 months later. Lost $1.75B.\n\n**The brutal truth:** Pivoting isn’t failure. Pivoting too late because you’re emotionally attached IS failure.\n\n**What to do:**\n\n1. Set pivot triggers BEFORE you’re desperate:\n- “If we don’t hit X users by Y date, we pivot”\n- “If retention below Z% for 3 months, we pivot”\n1. Make triggers objective (numbers, not feelings)\n1. When trigger hits, pivot within 2 weeks maximum\n\n\n## TRUTH #8: Competitors Don’t Kill Startups. Indifference Does.\n\n**The pattern I found:** 94% of startup failures = nobody cared. 6% = competitor won.\n\n**Google Wave (2009):** Google. 3 years of development. Brilliant engineers. Launched with massive hype at Google I/O. 100,000 beta invites.\n\nTech press praised it. Competitors studied it. Users logged in once. Never came back.\n\nWhy? Nobody actually wanted “real-time collaborative documents” the way Google built it.\n\nShut down 2010. Not because of competitors. Because of indifference.\n\n**Segway (2001):** Dean Kamen. Amazing technology. “Will revolutionize cities” and “will be bigger than the internet.” $5,000 price.\n\nMedia hype was insane. Steve Jobs saw it pre-launch: “As big as the PC.”\n\nResult: Nobody cared. It was a novelty toy. Not a revolution. Niche product at best.\n\nCompetitors didn’t kill it. Indifference did.\n\n**Contrast - The winners in “crowded” markets:**\n\n**Zoom (2013):** Eric Yuan. Launched into CROWDED market. Skype existed (Microsoft). WebEx existed (Cisco). GoToMeeting existed.\n\nBUT: People HATED existing tools. Dropped calls. Bad audio. Complicated setup.\n\nZoom wasn’t technically superior. It was “it actually works reliably every time.”\n\nPeople WANTED better video calls. Zoom provided it. $100B+ company.\n\n**The brutal truth:** Better product doesn’t win. Product people actually WANT wins.\n\n**What to do:**\nAsk honestly: “If we shut down tomorrow, would users be genuinely ANGRY or just mildly inconvenienced?”\n\n- Angry = You have something real\n- Inconvenienced = You don’t have PMF yet\n\n\n## TRUTH #9: Your Burn Rate Will Always Expand To Your Funding Amount.\n\n**The pattern I found:** Raise $1M, burn $1M. Raise $10M, burn $10M. Same ~18 month runway. Always.\n\n**Fab.com (2011-2015):** Jason Goldberg. Raised $336M total. At peak: Burning $14M per month.\n\nMath: $336M ÷ $14M/month = 24 months runway\n\nHow? Hired 600+ people. Expanded to Europe. Spent on marketing, offices, perks.\n\nMore money = more spending = same runway = death when growth stalled.\n\n**Homejoy (2010-2015):** Adora Cheung. Raised $40M total. Launched home cleaning in 30+ cities simultaneously.\n\nBurned through $40M in 18 months. Why? Each city needed ops team, cleaners, marketing, support.\n\n30 cities = 30x burn rate. Unit economics never worked per city. Shut down 2015.\n\n**Contrast - The bootstrap successes:**\n\n**Basecamp (1999-present):** Jason Fried and DHH. Profitable from year 1. Never raised VC funding.\n\nWhy? Forced to make every feature justify its existence with revenue. No choice.\n\nResult: 24 years later. $100M+ valuation. 70 employees. Profitable every single year.\n\n**The brutal truth:** Funding doesn’t buy time to find PMF. It buys time to prove you can scale what already works.\n\nIf you don’t have PMF, more money just delays inevitable failure.\n\n**What to do:**\n\n1. Raise half what VCs are offering\n1. You’ll be forced to focus ruthlessly\n1. You’ll find PMF faster (or fail faster, which is also valuable)\n1. More money = more distractions = slower PMF discovery\n\n\n## TRUTH #10: You’re Not Behind. Everyone Is Struggling. Winners Just Survive One More Crisis.\n\n**The pattern I found:** Every “overnight success” almost died multiple times. Survivorship bias hides this.\n\n**Airbnb (2008-2009):** Brian Chesky, Joe Gebbia, Nathan Blecharczyk. $40K in credit card debt. Selling cereal boxes ($40 for “Obama O’s” and “Cap’n McCains”) to pay rent.\n\n3 months from shutting down. Applied to YC (barely got in). Paul Graham: “I funded you because you’re not going to quit, not because the idea is good.”\n\nThen almost died again when COVID hit (March 2020). Lost 80% of business in 4 weeks. Survived.\n\nMultiple near-deaths. Each time, chose to keep going.\n\n**Reddit (2005-2007):** Steve Huffman and Alexis Ohanian. Lived together in small apartment. Coded for 2 years before meaningful traction.\n\nSteve Huffman: “Every day felt like dying slowly. We thought we’d failed. We were running out of money. We didn’t know if anyone would ever use it.”\n\nThey survived. Sold to Condé Nast (2006). Bought it back (2011). Now valued at $10B+.\n\n**Slack (2013):** Stewart Butterfield. This was his SECOND failed gaming company:\n\n- First attempt: Game Neverending (2002) - failed\n- Second attempt: Glitch (2009-2012) - failed after 3 years and $17M raised\n\nSlack was the internal tool from the failed game. He thought he was a failure twice over.\n\nNow: $27B company.\n\n**The brutal truth:** Every success story has 3-7 near-death experiences. You only hear about the success part.\n\nThe difference between billion-dollar success and forgotten failure: Surviving one more “we’re going to die” moment.\n\n**What to do:**\n\n1. Stop comparing your behind-the-scenes to everyone’s highlight reel\n1. If you’re struggling daily, you’re normal. This is what it actually looks like\n1. The winners aren’t smarter. They just survived one more crisis than losers\n\n\n\n## THE AFTERMATH (What These 10 Mean)\n\n**Week 1 of applying these truths:**\nMost founders read this. Nod along. Change nothing.\n\n**Week 2-4:**\nSome founders start tracking the metrics (Truth #5). Realize they don’t know their unit economics. This is terrifying but necessary.\n\n**Month 2-3:**\nFewer founders actually pivot when data says to (Truth #7). Emotional attachment kills them.\n\n**Month 4-6:**\nEven fewer founders fire their weakest team members (Truth #4). Keeping them kills culture.\n\n**The brutal truth about these truths:**\nReading them doesn’t help. ACTING on them (especially when painful) is what separates winners from failures.\n\n\n## THE FRAMEWORK (How To Use These 10)\n\n**Before you start building:**\n\n- Truth #1: Budget for 2-3 pivots\n- Truth #2: Define the problem you’re solving in one sentence\n\n**Before you raise money:**\n\n- Truth #3: Get one paying customer first\n- Truth #5: Know your unit economics exactly\n- Truth #9: Raise half what you could\n\n**When building product:**\n\n- Truth #6: Do 5 customer calls per week\n- Truth #7: Set pivot triggers now (before you need them)\n- Truth #8: Ask: Would users be angry if we shut down?\n\n**When building team:**\n\n- Truth #4: Fire weak performers immediately\n\n**When struggling:**\n\n- Truth #10: Everyone struggles. Survival = success\n\n\n\n## WHAT I LEARNED DOING THIS RESEARCH\n\n**Month 1-2:** Read 200 company histories. Saw surface-level patterns. Got excited.\n\n**Month 3-4:** Read 400 more. Patterns got clearer. Started seeing contradictions in startup advice.\n\n**Month 5:** Read final 247. The 50 truths crystallized. Realized most advice is backwards.\n\n**Month 6:** Wrote everything down. Organized into 5 parts. This is Part 1.\n\n**The uncomfortable realization:**\nThe companies that won violated the rules I was taught. The advice that’s popular isn’t the advice that works.\n\n\n\n## WHAT’S COMING IN THIS SERIES\n\n**Part 1 (this post): THE FOUNDATION (Truths 1-10)**\n✅ Foundation truths that determine if you have a chance\n\n**Part 2 (posting Tuesday): PRODUCT & CUSTOMERS (Truths 11-20)**\n→ How to build something people actually want\n\n**Part 3 (next week): GROWTH & SCALE (Truths 21-30)**\n→ How to go from 100 to 100,000 customers without dying\n\n**Part 4 (week after): LEADERSHIP & CULTURE (Truths 31-40)**\n→ How to build a team that doesn’t implode at scale\n\n**Part 5 (final): MENTAL GAME (Truths 41-50)**\n→ How to survive the psychological warfare of founding\n\nEach part stands alone. Together = complete guide.\n\n\n\n## THE UNCOMFORTABLE QUESTION\n\n**Which of these 10 Foundation truths are you currently violating?**\n\nBe brutally honest:\n\n- Do you have runway for 3 pivots? (Truth #1)\n- Can you state your problem in 10 words? (Truth #2)\n- Do you have ONE paying customer? (Truth #3)\n- Do you tolerate weak performers? (Truth #4)\n- Do you know your unit economics? (Truth #5)\n- When did you last talk to customers? (Truth #6)\n- Do you have pivot triggers set? (Truth #7)\n- Would users be angry if you shut down? (Truth #8)\n- Is your burn rate sustainable? (Truth #9)\n- Are you comparing yourself to highlight reels? (Truth #10)\n\nWrite down the ones you’re violating. Pick ONE to fix this week.\n\nBecause knowing doesn’t matter. Acting matters.\n\n\n## THE FINAL CONTROVERSIAL QUESTION\n\n**How many of these truths will you read, agree with, and then completely ignore?**\n\nBecause here’s the pattern I found in my research:\n\nWinners read this → feel uncomfortable → act anyway\nLosers read this → feel uncomfortable → do nothing\n\nThe difference between success and failure isn’t knowledge. It’s willingness to act on painful truths.\n\nSo which one are you?\n\n\n**Question for r/startups:** Which of these 10 Foundation truths hit hardest? And more importantly: which one are you violating right now because fixing it is too painful or inconvenient?\n\nThat’s probably the one that matters most.\n\n\n*This is Part 1 of 5. Took 6 months researching 847 successful startups. Every truth backed by real company examples, not theory or opinion.*\n\n*Part 2 drops Tuesday: PRODUCT & CUSTOMERS (Truths 11-20). Each post stands alone. Series together = complete startup guide.*\n\n*Follow for the series. Or don’t. These truths don’t care if you believe them. They just truths .*",
        "subreddit": "SaaS",
        "author": "SuccotashOdd9687",
        "score": 113,
        "num_comments": 65,
        "created_utc": 1762965075.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ov9w12/i_analyzed_847_successful_startups_and_found_that/",
        "fetched_at": "2025-11-13T16:15:15.105335"
      }
    ]
  }
}