{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-08-25T00:58:43.118572"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-08-25T00:58:35.616167"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-08-25T00:58:35.616175"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-08-25T00:58:35.332750"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-08-25T00:58:35.332739"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-08-25T00:58:35.332711"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-08-25T00:58:35.616170"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-08-25T00:58:35.616172"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-08-25T00:58:35.332746"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-08-25T00:58:35.332748"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-08-25T00:58:35.616156"
      }
    ],
    "reddit": [
      {
        "id": "1mywp7p",
        "title": "I've kept 200 people employed for years. A tariff might end that overnight.",
        "selftext": "Hi guys,I run a company in Vietnam that sells wood materials for furniture manufactures like plywood, MDF, laminated panels, the raw stuff that turns into desks, cabinets, shelves. For years, U.S. buyers have been one of our biggest markets, keeping designers on budget, and honestly keeping my 200+ employees in jobs as well.\n\nNow with all this talk of a 25% tariff on furniture imports, I’m just… exhausted. Others are rushing to front-load shipments now, trying to beat the tariff window. Meanwhile, my workers are asking if hours will be cut, and I don’t even know how to answer them.\n\nWhat makes it worse is, even if these tariffs happen, does anyone really believe thousands of Americans will suddenly want to clock into a cheap furniture factory in North Carolina or Ohio tomorrow morning? We all know the answer. The U.S. makes maybe 20% of its own furniture right now, the rest is imported.\n\nInstead of generating more jobs, this just feels like a tax on everyone: higher prices for U.S. families, canceled orders for exporters like my company, and a ton of uncertainty hanging over small businesses who are already stretched thin.\n\nThis could be the first time trade policy is threatening my entire business. Has anyone else here had orders disrupted or fears of it because of tariffs? How are you preparing? Any suggestions for me? \n\n",
        "subreddit": "smallbusiness",
        "author": "AdHead5088",
        "score": 456,
        "num_comments": 168,
        "created_utc": 1756044889.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1mywp7p/ive_kept_200_people_employed_for_years_a_tariff/",
        "fetched_at": "2025-08-25T00:58:40.784413"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 441,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-08-25T00:58:42.117085"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 277,
        "num_comments": 113,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-08-25T00:58:42.117135"
      },
      {
        "id": "1mq3pt1",
        "title": "I'm Rob, failed at 5 SaaS attempts in 2 years, then built my 6th in stealth for 6 months. Added $1k MRR in 24 hours on launch day. Currently at $3.5k MRR (AMA)",
        "selftext": "Hello fellow SaaS builders. My name’s Rob & I just added $1k MRR in 24 hours after 5 failed attempts.\n\nA couple weeks ago was launch day for my 6th SaaS attempt. After building in stealth for 6 months, I went from $1,600 to $2,500+ MRR in a single day.\n\nI started my SaaS journey 2 years ago. Failed 5 times. Lost money, time, and almost my sanity. But with attempt #6 I did a few things differently.\n\nFirst off, I faced the pain-point myself. Every SaaS \"guru\" preaches build in public, launch fast, get feedback. But launching broken products never worked for me. Too much noise, too many opinions, too much damage to first impressions. So I tried something different.\n\n**My secrets to a successful launch day:**\n\n**Building in “Stealth”:** I still posted publicly, but kept the product private until it was ready.\n\n* Posted screenshots asking \"who wants to try this?\" - no product links\n* DMed interested people to join private beta\n* Got 30 paying users before anyone knew what I was building\n* Their brutal feedback made the product 10x better\n* Built hype so launch day went that much better\n\n**Launch Day Momentum:** When you finally launch, ride the wave HARD.\n\n* Posted a curry selfie celebrating 26 trials → 50,000 views\n* Screenshot PostHog analytics → 20,000 views\n* Screenshot Lemon Squeezy dashboard → 10,000 views\n* Every win becomes content that drives more wins\n\n**Why Photos Matter:** Text gets lost in the AI slop on X. But by showing you are a real human being with a real story, you stop and grab peoples’ attention.\n\n* People root for underdogs (probably you)\n* Authenticity beats polished marketing (especially in AI era)\n\n**The Numbers Game:**\n\n* 70 free trials in 24 hours\n* 50% trial conversion rate (industry average is 15-20%)\n* 200,000+ views on X in 24hrs\n* 95% of traffic from organic X posts\n\nOver 6 months of private beta, I built to $1,600 MRR. Then added $1,000 more in 24 hours. A couple weeks on, I’m at $4,500+ MRR with another 150 trials pending.\n\nAsk me anything about:\n\n* Failing 5 times and what I learned\n* Building in \"stealth\" while still posting publicly\n* Getting 30 people to pay for a private beta\n* Launch day execution\n* Why posting a picture of me eating a curry converted more users than anything else\n\nGoal is $10k MRR well before the end of the year. After 5 failures, it finally feels possible.\n\nHappy to share specific tactics, screenshots, or just commiserate about the SaaS grind :)\n\nLet's gooo!\n\n(I'll be sticking around most of the day to answer questions. And I'll try my best to answer any asked even after today, so don't hesitate to leave your question!)\n\nEDIT: This was a lot of fun, thanks so much for asking all of your questions - there were some really great ones! I'll have to bookmark this myself so I can come back and re-read my answers, since I dropped most of my brain in here today haha. Catch you all next time or on X (hopefully past $10k MRR)! :D",
        "subreddit": "SaaS",
        "author": "robj3d3",
        "score": 185,
        "num_comments": 126,
        "created_utc": 1755184997.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1mq3pt1/im_rob_failed_at_5_saas_attempts_in_2_years_then/",
        "fetched_at": "2025-08-25T00:58:37.504151"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 146,
        "num_comments": 173,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-08-25T00:58:42.117117"
      },
      {
        "id": "1myv0mx",
        "title": "\"Listen to your users\" is terrible advice, and it's killing your product.",
        "selftext": "I’ve built enough SaaS products for clients to know that this is probably the most misunderstood piece of advice in the entire industry. It sounds right. It feels right. And it leads more teams down the wrong path than almost anything else.\n\nI know, it sounds like heresy. But let me explain.\n\nEvery client I work with has a backlog full of feature requests straight from their users. \"We need a dark mode.\" \"Can you add a CSV export button?\" \"We want more dashboard widgets.\" The impulse is always the same: \"Our users are asking for this, so we have to build it.\"\n\nAnd so they do. They build the dark mode, the export button, the extra widgets. And nothing changes. Engagement doesn't go up. Churn doesn't go down. The product just gets more bloated and harder to maintain.\n\nHere's the problem nobody talks about: Users are experts at their problems, but they are terrible at designing solutions.\n\nWhen a user asks for a feature, what they're really doing is describing a symptom and guessing at the cure. Your job isn't to be a short-order cook and build whatever they ask for. Your job is to be a doctor and diagnose the underlying disease.\n\nI had a client whose users were constantly asking for a \"better way to export data.\" They were convinced they needed more formats, more options, more filters. We spent weeks going back and forth on the design.\n\nFinally, I got on the phone with five of those users and asked a simple question: \"What do you do with the data right after you export it?\"\n\nFour of them said they manually clean it up and import it into QuickBooks.\n\nThe problem wasn't the export feature. The problem was they couldn't get their financial data into their accounting software. The real solution wasn't a better export button; it was a native QuickBooks integration. We built that instead, and it became their single biggest driver of upgrades.\n\nHere's the framework I use now that saves my clients from themselves:\n\n*   Treat every feature request as a starting point, not an endpoint. The request is the beginning of your investigation, not the conclusion.\n*   Always ask \"why\" five times. \"Why do you need a CSV export?\" \"So I can get my data out.\" \"Why do you need to get your data out?\" \"So I can put it in another system.\" \"Why do you need it in that system?\" You get the idea.\n*   Watch what they do, not just what they say. Session recordings are gold. You'll often see users struggling with a workflow they can't even articulate properly.\n*   Solve the problem, not the request. A user asking for a faster horse doesn't actually want a faster horse. They want to get from point A to point B more quickly. The solution might be a car.\n\nI'm not saying you should ignore your users. You absolutely should listen to their problems, their frustrations, and their goals. But the moment you start letting them design your product roadmap, you've already lost.\n\nYou're the product expert. They're the user expert. Your job is to translate their pain into an elegant solution. Stop taking orders and start diagnosing. Your product will be a thousand times better for it.\n\nEnd of rant.\n\nEdit: Damn, this post blew up!\n\nIf you're struggling with feature bloat or need help building an MVP that actually solves real problems, I'm taking on new clients. Hit me up if you want to cut through the noise and build something people actually need.",
        "subreddit": "SaaS",
        "author": "Warm-Reaction-456",
        "score": 115,
        "num_comments": 34,
        "created_utc": 1756040590.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1myv0mx/listen_to_your_users_is_terrible_advice_and_its/",
        "fetched_at": "2025-08-25T00:58:37.504169"
      },
      {
        "id": "1knjjez",
        "title": "Hitting Pause (Temporarily) on New Posts",
        "selftext": "Hi, it's your friendly subreddit moderator here. Unfortunately, recent weeks have seen a significant increase of post submissions that break the [subreddit rules](https://www.reddit.com/r/freelance/about/rules) in clear and obvious ways. We're at the point where more than 90% of the post submissions violate the rules.\n\nWhile some of this is the standard \"I didn't read the subreddit rules and don't understand that this isn't /r/forhire, so please hire me/work on my project\" stuff I am used to dealing with, I suspect a lot of the increase is due to AI. I have removed dozens of posts that are some iteration of \"go to Gumroad and buy this ebook/PDF/guide that will help you freelance\" (one even stated that its purpose was to help you create ebooks with AI to sell to freelancers). I have also removed dozens of posts of market research/promotional spam related to \"vibe coding\" tools.\n\nI've been moderating this subreddit for more than a decade (!), so I'm used to periodic surges of inappropriate posts because some YouTuber made a video telling people to submit things to Reddit, or because some virtual assistant course mandated that its students make marketing comments here, or because Reddit itself decides that increased posts and traffic are more important than subreddit rules and moderators' time. Unfortunately, I am currently at the point where I need the firehose of incoming spam to stop. I need at least a couple of days, but reserve the right to continue this until the end of the month.\n\nComments are on. Please be respectful.",
        "subreddit": "freelance",
        "author": "martey",
        "score": 114,
        "num_comments": 25,
        "created_utc": 1747343489.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1knjjez/hitting_pause_temporarily_on_new_posts/",
        "fetched_at": "2025-08-25T00:58:42.117150"
      },
      {
        "id": "1mz0zok",
        "title": "A friend of mine closed a $72K deal… from a LinkedIn like 😳",
        "selftext": "A good friend of mine who's been in B2B sales for over 20 years recently shared something with me that completely shifted how I see prospecting and outreach.\n\nHe didn’t get a reply. He didn’t have a meeting booked. There was no introduction or referral. Just a single like from a prospect on one of his LinkedIn posts. That was it.\n\nFrom that tiny moment of engagement, one that most salespeople would ignore, he ended up closing a $72,000 deal.\n\nWhat struck me wasn’t just the outcome, but the way he explained the process.\n\nHe’s no longer chasing people with cold DMs or relying on generic filters to build lists.\n\nInstead, he’s paying attention to what he calls dynamic social signals. Little behaviors that indicate interest, curiosity, or intent, even if they’re subtle.\n\nHe looks for signs like someone viewing his LinkedIn profile. Liking a competitor’s post. Following someone in his space. Commenting on a post related to the problem his product solves. Attending an event. Engaging in a niche discussion.\n\nTo most people, those don’t feel like leads. But to him, they’re the start of a conversation.\n\nWhen someone interacts with something even loosely related to his offer, he uses that as context to send a thoughtful message. Not a pitch. Not an automated sequence. Just a relevant piece of content, a short insight, or a question tailored to what the prospect showed interest in.\n\nHe told me about a VP who viewed his profile after reading a post about ROI in telecom. Instead of pitching right away, he connected with that person and then 3 days later dropped a short message with a case study on how his product increased ROI for a similar client. The VP replied the same day.\n\nIn another case, a director liked a post by an influencer talking about a problem his product solves. He followed up with a simple value-first message offering help, no strings attached. That turned into a call the same week.\n\nThis method gives him four times more replies, four times more acceptance, and over 90 percent of people who respond are actually qualified.\n\nIt’s a simple formula.\n\nHigh intent plus perfect timing equals real conversations that convert.\n\nThis kind of sales isn’t loud.\n\nIt’s not spammy, based on listening, not chasing.\n\nAnd it works !\n\nGood luck.\n\nRomàn (building [gojiberry.ai](http://gojiberry.ai) )",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 102,
        "num_comments": 59,
        "created_utc": 1756054778.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1mz0zok/a_friend_of_mine_closed_a_72k_deal_from_a/",
        "fetched_at": "2025-08-25T00:58:37.504165"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 101,
        "num_comments": 52,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-08-25T00:58:42.117121"
      },
      {
        "id": "1myiwd5",
        "title": "My Dad is pressuring me to buy his auto business",
        "selftext": "Thanks for reading.  I'll try to keep it short.  My family has a small tire shop / auto repair business.  It used to have multiple locations all over our city.  It now only has two locations.  My uncle (68yo) is pressuring my Dad (71yo) to retire and sell his location.  My Dad is now pressuring me to find partners and buy his Tire Store / Repair Shop.  He hasn't given me a number but I am guessing about 1.1 Million.\n\nHe seems to think that me and my friends/partners should easily be able to come up with a loan to purchase it.   He hasn't been managing it too closely the last couple years and it takes in about 5k-9k  or more  in revenue a day ( this is based off anecdotal evidence when I was doing the deposit at the end of the day last year).  I am currently employed as a teacher (probably one of the few with a State Inspection and Emission license) and finally reached the top of my pay scale (about 110k a year).  The only debt I have is about 50k left on my home and about 40k left on my wife's student loans.\n\nI (43yo) have worked here continuously since I was 15.  Even being a teacher for the last 20 years I came in after school and have run the counter, changed tires, done inspections and light maintenance.  I am mostly terrified of having to pay for auto maintenance that I can't do in my drive way.\n\nDoes anyone think that if I got at least one if not two partners we could secure a small business loan?  Might there be another way to finance this?  Thanks, I am clueless.\n\nAddendum: My Dad and uncle are on the outs.  He has been told he can retire and collect a paycheck but he is not welcome in his store.  So my dad is kind of hoping I can buy his location so he can have both the money and the location to have his car and tires serviced.",
        "subreddit": "smallbusiness",
        "author": "NoRecommendation4148",
        "score": 94,
        "num_comments": 164,
        "created_utc": 1755999048.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1myiwd5/my_dad_is_pressuring_me_to_buy_his_auto_business/",
        "fetched_at": "2025-08-25T00:58:40.784438"
      }
    ]
  }
}