{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-08-27T08:15:42.664346"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-08-27T08:15:35.804060"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-08-27T08:15:35.804066"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-08-27T08:15:35.447064"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-08-27T08:15:35.447048"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-08-27T08:15:35.447031"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-08-27T08:15:35.804062"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-08-27T08:15:35.804064"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-08-27T08:15:35.447057"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-08-27T08:15:35.804050"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-08-27T08:15:35.447061"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 443,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-08-27T08:15:41.662970"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 274,
        "num_comments": 113,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-08-27T08:15:41.663021"
      },
      {
        "id": "1n0olci",
        "title": "Anyone else noticing more “cash crunch” talk lately?",
        "selftext": "I am involved in a community of small business owners, mostly people who own boring companies like plumbing, roofing, commercial cleaning, manufacturing, etc.\n\nOver the last couple months there’s been a bit of a shift in the conversations we usually have\n\nIt used to be a lot of talk about general experience sharing, planning/growth, team building, and other generally positive things. \n\nLately I’m hearing more stuff like, “We REALLY need to get sales in the door or we’re in trouble” or “this cash crunch is the worst it’s ever been. Feels like the end is always near but never hits”\n\nNot everyone is saying this, but the last couple months I’ve heard it a lot more.\n\nTalked to another owner yesterday in totally different groups and he said something very similar.\n\nI feel like there’s been a lot of talk for the last 2-3 years about a looming recession but this is the first time I’ve actually seen people really feel like they’re in a tight spot.\n\nCurious if others here are seeing this too, or if it’s just the circles I’m in.",
        "subreddit": "smallbusiness",
        "author": "yogojoho",
        "score": 259,
        "num_comments": 166,
        "created_utc": 1756221301.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n0olci/anyone_else_noticing_more_cash_crunch_talk_lately/",
        "fetched_at": "2025-08-27T08:15:40.421385"
      },
      {
        "id": "1n0pc2j",
        "title": "B2B pays. B2C is sexy.",
        "selftext": "When I look at startups, I see two very different paths:\n\nB2C: glamorous, lots of buzz, tons of users. But brutal churn, high marketing spend, and usually thinner margins.\n\nB2B: less glamorous, but the checks are bigger, customers stick longer, and the cashflow is steadier.\n\nBuild something solid that funds itself through contracts and recurring invoices",
        "subreddit": "Entrepreneur",
        "author": "1017_frank",
        "score": 188,
        "num_comments": 45,
        "created_utc": 1756222959.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n0pc2j/b2b_pays_b2c_is_sexy/",
        "fetched_at": "2025-08-27T08:15:36.326722"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 144,
        "num_comments": 173,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-08-27T08:15:41.662998"
      },
      {
        "id": "1n0gskv",
        "title": "I quit my job, spent $2,500 on office + team, made $0. Then got 200K views in 20 days by doing this instead.",
        "selftext": "Six months ago, I went all-in on my SaaS dream. I quit my comfortable job, rented an office, built a small team, and spent $2,500 setting up what I thought was a real business.\n\nWe built and polished our product, held energetic team meetings, and set roadmap after roadmap. The result? **$0 revenue, and not a single real customer.**  \nLooking back: I had completely underestimated the challenge of *distribution*. We could build—but without an audience, nobody cared.\n\nInstead of trying to add yet another feature, I decided to switch gears and document my journey publicly, sharing raw, honest updates and lessons on Instagram and YouTube.\n\n**The results in just 20 days:**\n\n* **200,000 views** across platforms\n* **1,000+ followers** interested in our space\n* Actual leads reaching out for conversations\n* Unexpected support and feedback from the community\n\n**Hard-earned lessons:**\n\n* Building in silence = building for yourself\n* Audience-first wins: Start with distribution, not just product\n* Content compounds; even imperfect stories beat polished demos\n* Feedback from just a few real users teaches more than months at the whiteboard\n\nNow, I’m focused almost entirely on building *with* my audience, sharing what works and what doesn’t in real time.\n\n**Would love to hear from other founders:**\n\n* Have you struggled with getting attention for your product despite building something good?\n* What’s worked in terms of getting your first loyal users?\n* Any tips on growing beyond the first few hundred engaged followers?\n\nNot promoting here—just want to share what worked (and didn’t) for me. I genuinely hope this helps anyone feeling stuck at zero. If you’re building something similar, let’s swap notes in the comments!",
        "subreddit": "SaaS",
        "author": "More_Spirit1421",
        "score": 124,
        "num_comments": 98,
        "created_utc": 1756199015.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n0gskv/i_quit_my_job_spent_2500_on_office_team_made_0/",
        "fetched_at": "2025-08-27T08:15:37.722080"
      },
      {
        "id": "1knjjez",
        "title": "Hitting Pause (Temporarily) on New Posts",
        "selftext": "Hi, it's your friendly subreddit moderator here. Unfortunately, recent weeks have seen a significant increase of post submissions that break the [subreddit rules](https://www.reddit.com/r/freelance/about/rules) in clear and obvious ways. We're at the point where more than 90% of the post submissions violate the rules.\n\nWhile some of this is the standard \"I didn't read the subreddit rules and don't understand that this isn't /r/forhire, so please hire me/work on my project\" stuff I am used to dealing with, I suspect a lot of the increase is due to AI. I have removed dozens of posts that are some iteration of \"go to Gumroad and buy this ebook/PDF/guide that will help you freelance\" (one even stated that its purpose was to help you create ebooks with AI to sell to freelancers). I have also removed dozens of posts of market research/promotional spam related to \"vibe coding\" tools.\n\nI've been moderating this subreddit for more than a decade (!), so I'm used to periodic surges of inappropriate posts because some YouTuber made a video telling people to submit things to Reddit, or because some virtual assistant course mandated that its students make marketing comments here, or because Reddit itself decides that increased posts and traffic are more important than subreddit rules and moderators' time. Unfortunately, I am currently at the point where I need the firehose of incoming spam to stop. I need at least a couple of days, but reserve the right to continue this until the end of the month.\n\nComments are on. Please be respectful.",
        "subreddit": "freelance",
        "author": "martey",
        "score": 116,
        "num_comments": 25,
        "created_utc": 1747343489.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1knjjez/hitting_pause_temporarily_on_new_posts/",
        "fetched_at": "2025-08-27T08:15:41.663035"
      },
      {
        "id": "1n0c2cg",
        "title": "I analyzed 50 founder postmortems -- here are the top 5 reasons startups fail",
        "selftext": "I’ve been obsessed with reading founder postmortems lately. The raw honesty in those stories is way more valuable than the “10x growth hacks” floating around the internet.\n\nSo I dug into **50 different startup failure stories** and looked for patterns. Here’s what came up again and again:\n\n1. **No real problem solved**: Founders built things they thought were cool, not things people actually needed.\n2. **No distribution strategy:** “If you build it, they will come” doesn’t work. Amazing products died because nobody knew they existed.\n3. **Co-founder drama:** Misaligned goals, burnout, or trust issues killed startups faster than bad code ever could.\n4. **Pricing mistakes:** Either undercharging (unsustainable) or overcharging (no adoption). Pricing experiments came too late.\n5. **Burning out:** Many founders just ran out of energy (or money) before they found traction. Persistence mattered more than brilliance.\n\n**Takeaway for me as a bootstrapper:**  \nIt’s not just about *what* you build. It’s about *why*, *for who*, and whether you can actually reach them without running yourself into the ground.\n\nCurious: If you’ve failed at a project before, which of these was the killer? Or did you run into something completely different?",
        "subreddit": "Entrepreneur",
        "author": "thalavaisankar7",
        "score": 102,
        "num_comments": 48,
        "created_utc": 1756181248.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n0c2cg/i_analyzed_50_founder_postmortems_here_are_the/",
        "fetched_at": "2025-08-27T08:15:36.326766"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 102,
        "num_comments": 53,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-08-27T08:15:41.663004"
      },
      {
        "id": "1n0e36q",
        "title": "Entrepreneurs out here, what tools in 2025 make running a business 10x easier?",
        "selftext": "Feels like every year there’s a new stack everyone’s raving about, but half of it ends up collecting dust. Curious what you’re actually using that makes life easier- whether it’s for marketing, finance, automation, team management, or just keeping your sanity.\n\nWhat are the real 10x tools for you in 2025?",
        "subreddit": "Entrepreneur",
        "author": "impetuouschestnut",
        "score": 97,
        "num_comments": 69,
        "created_utc": 1756188354.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n0e36q/entrepreneurs_out_here_what_tools_in_2025_make/",
        "fetched_at": "2025-08-27T08:15:36.326758"
      }
    ]
  }
}