{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-29T16:14:08.308285"
  },
  "data": {
    "youtube": [
      {
        "videoId": "Q1tCEvqakUo",
        "title": "Fastest Editing Workflow in DaVinci Resolve! - Perfect for Tutorials and How To Vids!",
        "description": "Get the FREE practice media here: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2025-10-14T14:00:41Z",
        "url": "https://www.youtube.com/watch?v=Q1tCEvqakUo",
        "fetched_at": "2025-11-29T16:13:59.065026"
      },
      {
        "videoId": "_XySZQrHPCE",
        "title": "Steal This Easy Vlog Editing Workflow, It&#39;ll Simplify Everything",
        "description": "Get 2 extra months free on an annual plan from Motion Array https://geni.us/tEEoIY 🎞️ New to video editing? Learn the ...",
        "channelTitle": "Tamara Gabriel",
        "publishedAt": "2025-07-18T11:18:22Z",
        "url": "https://www.youtube.com/watch?v=_XySZQrHPCE",
        "fetched_at": "2025-11-29T16:13:59.065048"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-29T16:13:59.409357"
      },
      {
        "videoId": "mjiT0g3mYgw",
        "title": "9 Editing Tips To Save HOURS in DaVinci Resolve!",
        "description": "9 Editing Tips in DaVinci Resolve you probably didn't know! In this DaVinci Resolve tutorial, I'm going to show you 9 powerful ...",
        "channelTitle": "Sightseeing Stan",
        "publishedAt": "2025-05-26T14:01:15Z",
        "url": "https://www.youtube.com/watch?v=mjiT0g3mYgw",
        "fetched_at": "2025-11-29T16:13:59.065051"
      },
      {
        "videoId": "8MQfZTjbvPw",
        "title": "🔥 This FREE plugin will change your video editing workflow FOREVER!",
        "description": "Say hello to Premiere Composer, packed with transitions, sound effects, and motion graphics #videoeditingtips #premierepro ...",
        "channelTitle": "Sebastien Jefferies",
        "publishedAt": "2025-04-15T17:21:05Z",
        "url": "https://www.youtube.com/watch?v=8MQfZTjbvPw",
        "fetched_at": "2025-11-29T16:13:59.065040"
      },
      {
        "videoId": "954L0eVIdaE",
        "title": "How I Would Learn Video Editing (If I Had to Start Over in 2025)",
        "description": "If I could go back in time and learn video editing, I would do a lot of things differently. In this video, I walk you through an entire ...",
        "channelTitle": "Gavin Herman",
        "publishedAt": "2025-01-22T22:00:10Z",
        "url": "https://www.youtube.com/watch?v=954L0eVIdaE",
        "fetched_at": "2025-11-29T16:13:59.065045"
      },
      {
        "videoId": "PuoI9paASys",
        "title": "How to Color Grade between Premiere Pro and Davinci",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2025-01-07T10:55:29Z",
        "url": "https://www.youtube.com/watch?v=PuoI9paASys",
        "fetched_at": "2025-11-29T16:13:59.065035"
      },
      {
        "videoId": "YoxVhLdfEdE",
        "title": "Easy Animate Noob VS Pro Editing",
        "description": "Check out our Website: https://pixflow.net/video-templates/ LIKE this video, SUBSCRIBE to us, and hit the NOTIFICATION BELL to ...",
        "channelTitle": "Pixflow",
        "publishedAt": "2024-12-26T14:30:24Z",
        "url": "https://www.youtube.com/watch?v=YoxVhLdfEdE",
        "fetched_at": "2025-11-29T16:13:59.065032"
      },
      {
        "videoId": "DYOPXAmwHgA",
        "title": "Final Cut Pro 11: Boost Your Workflow with AI Magic! |@TECHSENSEI24",
        "description": "Final Cut Pro 11: Boost Your Workflow with AI Magic! Join Marques Brownlee, Andrew Manganelli, and David Imel in this ...",
        "channelTitle": "TECH SENSEI",
        "publishedAt": "2024-11-17T14:30:09Z",
        "url": "https://www.youtube.com/watch?v=DYOPXAmwHgA",
        "fetched_at": "2025-11-29T16:13:59.065037"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-29T16:13:59.064998"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 489,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-29T16:14:07.306948"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 400,
        "num_comments": 110,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-11-29T16:14:07.306958"
      },
      {
        "id": "1p96hez",
        "title": "Mass-produced AI apps for 14 months. Made $2,847 total. My friend sells pool cleaning services and cleared $94K.",
        "selftext": "\r\nI mass-produced AI wrapper apps for 14 months thinking I'd found the cheat code to SaaS.\r\nBuilt 11 apps total. AI resume reviewer. AI meal planner. AI study buddy. AI journal prompts. You get the\r\nidea.\r\nCombined revenue across all 11: $2,847. Combined time invested: probably 1,400 hours.\r\nThat's about $2/hour.\r\nMeanwhile my friend started a pool cleaning route in Phoenix 8 months ago. No app. No AI. No product\r\nhunt launch. Just a truck, some chemicals, and door knocking.\r\nHe cleared $94K in his first year. Works 6 hours a day, 5 days a week. Has a waitlist of customers.\r\nI mass-produced apps nobody needed for markets I didn't understand. He found people with dirty pools\r\nwho hate cleaning them and showed up weekly.\r\nThe uncomfortable math:\r\nMy 11 AI apps serve maybe 40 active users combined. His pool route serves 127 homes. Each home\r\npays $150/month. That's $19K MRR from people who will literally never churn because pools don't stop\r\ngetting dirty.\r\nI mass-produced solutions looking for problems. He found one obvious problem and solved it boringly.\r\nCurrently researching what \"boring\" business I could start in my area. Pressure washing. Gutter cleaning.\r\nJunk removal. Something where the demand exists before I do.\r\nAnyone else made this pivot from SaaS to service business?",
        "subreddit": "SaaS",
        "author": "Old-Guess-3243",
        "score": 301,
        "num_comments": 91,
        "created_utc": 1764364861.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p96hez/massproduced_ai_apps_for_14_months_made_2847/",
        "fetched_at": "2025-11-29T16:14:02.036556"
      },
      {
        "id": "1p93yhm",
        "title": "Customer cancelled after 18 months. Reason: \"We built it ourselves.\"",
        "selftext": "They were paying $300/month. One of my best customers.\n\nLast week: \"Thanks for everything, we're moving to an internal solution.\"\n\nThey hired a developer, spent 3 months building a worse version of my product, and are now maintaining it themselves.\n\nTheir developer probably costs $8K/month. My tool was $300/month.\n\nBut sure, makes total financial sense.\n\nI think it's a control thing. Some companies would rather own a crappy internal tool than rely on external software.\n\nCan't compete with that. Just have to accept it and move on.\n\n",
        "subreddit": "SaaS",
        "author": "Aggravating-Form2319",
        "score": 215,
        "num_comments": 157,
        "created_utc": 1764358593.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p93yhm/customer_cancelled_after_18_months_reason_we/",
        "fetched_at": "2025-11-29T16:14:02.036558"
      },
      {
        "id": "1p92c7a",
        "title": "PSA: New rule: Market research posts not to be allowed in main sub",
        "selftext": "For a while now we have been removing \"pain points\" market research posts under certain circumstances. We are going to be expanding this rule because of the continuous onslaught of people trying to use our subscribers as an unpaid market research group. That isn't the point of the sub and the ease of creating AI wrappers or vibe coding apps has made it so bad the noise from these posts are blocking out real questions about small business. \n\nThis is particularly annoying given anyone can look at our past posts and create a map of what is important or challenging for small businesses with far greater accuracy than a single spammy \"question\" post.\n\n- Research on small businesses (i.e. asking what their challenges are, if XYZ app will help, how good your small business offering is, etc.) will be removed unless posted by legitimate academic sources. Additional rules will apply for academic research.\n\n- Posts of this type will be allowed as comments in one of our stickied posts. If these comments engage widely we may set up a new sticky for them.\n\n- We still only allow questions to be posted. Mods may post or enable non-questions for specific purposes. These are generally PSAs but can be about critical events.\n\n- As before, posts directly or indirectly for promotion will be removed, including those authored by AI. Using AI to translate might be OK but AI slop is not.\n\nAs always we welcome feedback on the rule change. \n\nAs a separate note, you might like to know we've been operating several posts as anti-spammer honeypots. These are posts are popular but highly attractive to spammers. The posts are under continuous monitoring and when a spammer makes their comment the company name or offer is banned universally across the sub. Banning the company name means even different accounts can't spam us with it. Feel free to tell folks we operate honeypots. If the bad guys know there is a risk to posting here perhaps they'll send the spam somewhere else.\n\nThanks for your posts and I look forward to hearing your comments - even the critical ones - as we always have room to improve.\n",
        "subreddit": "smallbusiness",
        "author": "BigSlowTarget",
        "score": 175,
        "num_comments": 41,
        "created_utc": 1764354752.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p92c7a/psa_new_rule_market_research_posts_not_to_be/",
        "fetched_at": "2025-11-29T16:14:05.368860"
      },
      {
        "id": "1p8w52m",
        "title": "We turned down a $1.5M VC offer for our SAAS",
        "selftext": "\"Thank you for the offer, but we’re going to stay bootstrapped.\"\n\nAbout a month and a half ago, a VC reached out saying they were looking for a SaaS like ours to invest in at seed stage.\n\nWe built [this SaaS](https://taap.it/m0jt3oT) in just 6 months, bootstrapped from day one, with over 350+ customers, and 40000+ monthly visitors.\n\nObviously, we were a bit suspicious at first. We did our homework, contacted founders they had already invested in, and everything turned out to be legit. They have some great startups in their portfolio.\n\nThey wanted to move fast with a seed round after due diligence, and we had a few weeks to think about it. Yesterday, we decided to turn it down, and here’s why.\n\nWe’re in a space that’s getting a lot of visibility, and our client results are strong.\n\nWe launched this SaaS just a few months ago, we have double-digit monthly growth, and we really feel the acceleration.\n\nThe VC needed a company in their portfolio specializing in intent signal data, because it’s a hot topic right now. One of our clients, who had raised funds with them, told them our tool was great, which is how they found us.\n\nRight now, we’re three cofounders and an assistant. We don’t even have employees yet !  \nSo when someone contacts you and says they want to wire you 1.5 million dollars, it definitely makes you think.\n\nHere’s how we approached the decision:\n\nWould it have accelerated our growth? Probably. We could hire faster, build faster, and enter new markets more quickly.\n\nBut there was also the other side, the one that made us really hesitate.\n\nIt means being accountable. A VC doesn’t give you money for free, they expect growth.\n\nThat means reporting, pressure, and not being able to do whatever you want anymore. There’s also preferential liquidity, which they mentioned.\n\nIf you sell the company, the VC gets their investment back before you see anything. If the company crashes and sells for 1.5 million, and they have a 1.5 million preference, we get zero.\n\nGiven our growth and what we believe we can achieve, that’s why we decided to refuse.\n\nAmong the founders, we said we would only raise if it’s with YCombinator. We’ve already been rejected once. This is now the second time we’re applying.\n\nAnother reason that pushed us to say no to the 1.5 million is that beyond the money, there didn’t seem to be strong marketing support from this VC. Some VCs bring you clients directly through their portfolio, which means immediate growth on top of the cash. That wasn’t the case here. Many of their portfolio companies weren’t aligned with our product at all.\n\nWhereas if YC joins your company and you target SMBs, it’s the holy grail. You’re almost guaranteed explosive growth in the months that follow.\n\nFor all these reasons, the pressure, the reporting, the meetings, the expectation to raise more money later, and the preferential liquidity clause, we decided to say no.\n\nWe’re lucky that the startup already pays the three cofounders, and we also have revenue streams from other businesses that run without us. So for now, we can afford to turn down outside money.\n\nI hope you enjoyed the story, and see you very soon!\n\nPs : My little gift to you, this is a free blueprint on [how you can reach 20kmrr ](https://www.notion.so/How-to-reach-10k-MRR-for-your-SAAS-286b9abcbe3f805fb469d503e584e172?source=copy_link)with your SAAS in a few months only.",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 148,
        "num_comments": 45,
        "created_utc": 1764339995.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p8w52m/we_turned_down_a_15m_vc_offer_for_our_saas/",
        "fetched_at": "2025-11-29T16:14:02.036577"
      },
      {
        "id": "1p916ej",
        "title": "My cofounder wants to raise. I want to stay bootstrapped. This might end us.",
        "selftext": "Two years in. $8.2K MRR. Growing 12% month over month. Could probably hit $20K in a year if we keep going.\n\nMy cofounder wants to raise a seed round. Hire faster. Go bigger. \"Think about what we could do with $1.5M.\"\n\nI want to stay bootstrapped. Keep it lean. Own 100% of what we're building. \"Think about what we keep if this works.\"\n\nWe've had this conversation 6 times in the last 2 months. Each time it gets more tense.\n\nHis argument: We're leaving opportunity on the table. Competitors are raising. Speed matters. We could capture market share now and optimize later.\n\nMy argument: We don't have product-market fit yet. Raising money won't fix that. It'll just give us more rope to hang ourselves with. We should hit $30K MRR bootstrapped before even considering it.\n\nNeither of us is wrong. We just have different risk tolerances and different visions.\n\nI don't know how this ends. Maybe we find a compromise. Maybe one of us buys the other out. Maybe we split.\n\nThe thing nobody tells you about cofounders: early alignment on money, risk, and exit expectations matters more than complementary skills. You can hire for skills. You can't hire for aligned ambition.\n\nAnyone been through this? How did you resolve it?\n\n",
        "subreddit": "SaaS",
        "author": "No-Market-6902",
        "score": 85,
        "num_comments": 90,
        "created_utc": 1764352069.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p916ej/my_cofounder_wants_to_raise_i_want_to_stay/",
        "fetched_at": "2025-11-29T16:14:02.036574"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 72,
        "num_comments": 51,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-29T16:14:07.306979"
      },
      {
        "id": "1p981r0",
        "title": "How Do You Transition a Client Off a Discount Once You’ve Proven Results?",
        "selftext": "On paper, this should be simple: show the client the results, they see the value, and they agree to move off the discount. That’s how it usually goes. But I’m dealing with a client who originally came to me skeptical about GBP-focused SEO for his massage therapy business. To ease him in, I offered a discounted rate with the clear agreement that once we showed movement, we’d switch to standard pricing. The results ended up being better than either of us expected; his visibility shot up, leads increased, and everything was trending in the right direction.\n\nBut when I brought the pricing conversation back up, he basically said, “Why pay more if what we’re doing now works?” Which is frustrating, because we clearly agreed the discount was temporary. I’m torn between dropping him, keeping him at the lower rate, or trying again to get him to honor the original plan. I’ve explained that competing with the top players requires more resources, but I’m not sure if it’s getting through. I’m curious what others would do: should I cut the client, stick with the current rate, or push harder for the rate adjustment?",
        "subreddit": "smallbusiness",
        "author": "RankingGBPs",
        "score": 62,
        "num_comments": 26,
        "created_utc": 1764368801.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p981r0/how_do_you_transition_a_client_off_a_discount/",
        "fetched_at": "2025-11-29T16:14:05.368870"
      },
      {
        "id": "1p92g8m",
        "title": "Title: Sold my SaaS for $47K. Felt like a failure. Now I think I was an idiot for feeling that way.",
        "selftext": "\nBuilt a niche tool for 18 months. Never got past $3.2K MRR. Burned out. Listed it on Acquire. Got an offer\r\nfor $47K. Took it.\r\nFor months I felt embarrassed. $47K for 18 months of work? That's like $2.6K/month. I could've made\r\nmore at a regular job.\r\nBut here's what I didn't account for:\r\nThe buyer sent me a message 6 months later. They'd grown it to $11K MRR. They understood the market\r\nbetter than I did. They had existing distribution I didn't have. Same product, different result.\r\nI wasn't bad at building. I was bad at selling to that specific market.\r\nMeanwhile that $47K:\r\nPaid off $31K in credit card debt I'd accumulated\r\nGave me 6 months runway to start something new\r\nTaught me more about due diligence, deal structure, and asset sales than any course\r\nThe new thing I'm building is at $4.8K MRR after 7 months. I'm on track to pass what I sold within a year.\r\nBut I couldn't have started it without that $47K clearing my debt and my headspace.\r\nSmall exits aren't failures. They're transitions.\r\nIf you're stuck at low MRR and burning out, selling might be the best move you can make. Someone else\r\nmight see opportunity where you see a ceiling.\r\nAnyone else done a small exit and felt weird about it?",
        "subreddit": "SaaS",
        "author": "No-Drag3361",
        "score": 57,
        "num_comments": 17,
        "created_utc": 1764355021.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p92g8m/title_sold_my_saas_for_47k_felt_like_a_failure/",
        "fetched_at": "2025-11-29T16:14:02.036581"
      }
    ]
  }
}