{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-30T16:16:20.804427"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-30T16:16:11.736386"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-30T16:16:11.736387"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-10-30T16:16:11.414327"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-30T16:16:11.414319"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-30T16:16:11.414304"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-30T16:16:11.736382"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-30T16:16:11.736384"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-30T16:16:11.414322"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-30T16:16:11.736371"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-30T16:16:11.414324"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 474,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-30T16:16:19.802990"
      },
      {
        "id": "1ojqqgb",
        "title": "UPDATE: Raised rates 50% on nightmare client, went silence. Then this counter offer",
        "selftext": "Quick update to my previous posts about the nightmare client situation.\n\nContext: one client makes up $5k per month which is almost half of my revenue. They've been complete chaos, disorganized records, 2am receipt dumps, constant weekend emergencies. I posted asking if I should fire them and Reddit overwhelmingly said raise rates and set boundaries instead.\n\nI sent an email last week raising their rate from $5k to $7.5k per month and included an actual service framework with 10-day submission deadlines, rush fees for last-minute requests, communication hours Monday through Friday 9am-6pm only, and no more weekend work.\n\nThey went silence for a week. I was legitimately convinced they were ghosting me and started mentally preparing for losing half my income. Yesterday they called me and we had this tense 20 mins talk with lots of questions and pushback, but I honestly couldn't tell where it was heading.\n\nThis morning, I got their email response and I'm honestly conflicted about what to do. Screenshot attached.\n\nThey want to move forward but counter offer $7k per month instead of $7.5k. They're also pushing back on the timeline, saying they want to start with 7 business days deadlines instead of 10 and work up to it over the next quarter. And here's the one that's really bothering me, they accept the Monday-Friday 9-6 communication hours but want to discuss exceptions for quarterly filing periods where some weekend work might be necessary. They did acknowledge that they kinda expected this coming given how they've been operating, and they need 90 days to review how it's working. But I'm genuinely torn here.\n\nPart of me says take the deal because I won the principle, $7k is still a 40% increase, and some of their pushback seems reasonable for a transition period. Part of me says hold firm because I set $7.5k for a reason, that quarterly exception language feels like the exact slippery slope back to weekend chaos, and they're already negotiating boundaries before even accepting them. I'm leaning more towards the take the deal part.\n\nWhat do you guys think?\n\nhttps://preview.redd.it/57jxtujji6yf1.png?width=1600&format=png&auto=webp&s=deb53723b067c6ddadac9b593edf1b46a22dc38f\n\n",
        "subreddit": "Entrepreneur",
        "author": "Normal-Gear283",
        "score": 435,
        "num_comments": 155,
        "created_utc": 1761799572.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ojqqgb/update_raised_rates_50_on_nightmare_client_went/",
        "fetched_at": "2025-10-30T16:16:12.549154"
      },
      {
        "id": "1oj285e",
        "title": "Why is yelp allowed to exist?",
        "selftext": "If I don't want a google business profile, I can delete mine (or simply never create one) and that's it.    \n  \nBut if some butt-head that has a personal beef with my wife wants to, he can \"create\" my business on yelp and leave me a totally fake 1 star review without any proof whatsoever and I can't do anything about it.  This is legal? This is allowed? This sounds insane to me but lawyer's aren't cheap!\n\nHas anyone ever created a website dedicated to slandering yelp?  What can they do?  As long as everyone checks the box asserting everything is true, of course.",
        "subreddit": "smallbusiness",
        "author": "roy_lobster",
        "score": 393,
        "num_comments": 168,
        "created_utc": 1761738125.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oj285e/why_is_yelp_allowed_to_exist/",
        "fetched_at": "2025-10-30T16:16:17.855858"
      },
      {
        "id": "1oj8z5y",
        "title": "Most startups don't need an ERP (I will not promote)",
        "selftext": "We're a series A company with about 45 people and doing around $4M ARR. Last year our CFO (who came from a big corp background) convinced everyone to implement ERP  \nI was sus from day one but got overruled because of reasons like we need to scale properly and  that we can't keep using spreadsheets and random tools forever which is fair but also we weren't exactly falling apart. Fast forward 8 months and we've spent probably 80k on implementation consultants, our finance team has been basically useless this entire time because they're drowning in configuration meetings, we STILL don't have it fully set up and half our team refuses to use it correctly because it's so goddamn complicated for basic tasks   \nIMO I think ERP only makes sense when you are a manufacturing company with complex supply chains and inventory and whatever but for a saas startup it's kinda useless. We're paying sales people buying software subscriptions and occasionally ordering laptops. Why do we need enterprise resource planning for that? The worst part is everyone's too proud to admit it was a mistake at this point and we're stuck with it. Our old setup of quickbooks was working fine idk why some people want to get stuff like this I think it's related to delusion and thinking you're a huge corp when you're actually not",
        "subreddit": "startups",
        "author": "WobblySynopsis",
        "score": 252,
        "num_comments": 63,
        "created_utc": 1761754829.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oj8z5y/most_startups_dont_need_an_erp_i_will_not_promote/",
        "fetched_at": "2025-10-30T16:16:16.178837"
      },
      {
        "id": "1oj4rnl",
        "title": "left my 95k agency job to recruit independently, here's month 18",
        "selftext": "I was a technical recruiter at a mid-size agency for 4 years. Good at my job, consistently hit quota, but watching the company take 85% of my placements was killing me. I was generating maybe 400k in fees annually and taking home 60k plus a 35k bonus.\n\nDecided to go independent in late 2023. Scary as hell because i didn't have established clients and wasn't trying to start a whole agency with overhead and employees.\n\nFound a marketplace model where i could access companies that were already looking for recruiters. Started taking roles in my specialty (devops and platform engineering), and focused on actually placing people instead of doing business development.\n\nMonth 1-3 was slow. Made maybe 4k total because i was still learning how to work independently and building reputation on the platform.\n\nMonth 4-8 started clicking. Placed 2-3 people per month, income jumped to 15-20k monthly.\n\nMonth 9-18 has been consistent. Averaging 18k per month, placed 31 people total. Some months are 25k, some are 12k, but it averages out.\n\nWhat's different: i work 30 hours a week instead of 50. I only take roles i actually want to work on. No more weekly team meetings or having to hit arbitrary quotas. I pick my own schedule.\n\nDownsides: no benefits, have to figure out my own health insurance and retirement. Income can swing month to month. Some months i don't place anyone.\n\nWould i go back? Absolutely not. Even with the uncertainty, making 3x what i made before and controlling my time is worth it.",
        "subreddit": "Entrepreneur",
        "author": "Adventurous_Hat_5238",
        "score": 244,
        "num_comments": 64,
        "created_utc": 1761745080.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oj4rnl/left_my_95k_agency_job_to_recruit_independently/",
        "fetched_at": "2025-10-30T16:16:12.549170"
      },
      {
        "id": "1oj8prn",
        "title": "facebook is literally charging me to host scam comments on my ads and I'm done",
        "selftext": "I just realized something that made me physically sick. I'm paying facebook $3,000/month in ad spend. and for that privilege, they're letting scammers use MY ad space to run THEIR scams\n\nEvery single post now gets:  \n• \"I won an iPhone!\" comments from fake profiles  \n• Crypto bots posting referral links  \n• Competitors saying \"this brand scammed me\"  \n• Actual customers asking \"is this legit?\" because of the chaos\n\nhere's the kicker: Facebook's \"moderation tools\" are designed to MAKE ENGAGEMENT LOOK HIGH. They don't care if it's scam engagement. They're literally profiting from my ad spend while scammers get free real estate\n\nI calculated last month's damage:\n\n* 47 legitimate customer questions buried under spam\n* 12 people who commented \"how do I buy?\" that we missed for 8+ hours\n* Estimated $2,100 in lost sales from unanswered questions\n\nthe most insulting part? When I report obvious scam comments, FB says \"this doesn't violate community standards.\" Of course not - scam comments INCREASE their engagement metrics!\n\nQuestion for other business mates: At what point do we start treating fb ads as hosting costs for scammer content rather than customer acquisition? how much are u losing to this digital graffiti on ur paid ads?\n\n",
        "subreddit": "smallbusiness",
        "author": "Ducky005",
        "score": 231,
        "num_comments": 47,
        "created_utc": 1761754245.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oj8prn/facebook_is_literally_charging_me_to_host_scam/",
        "fetched_at": "2025-10-30T16:16:17.855856"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 185,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-30T16:16:19.803014"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 179,
        "num_comments": 50,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-30T16:16:19.803049"
      },
      {
        "id": "1oiothj",
        "title": "Sergey Brin said he wouldn’t start Google in a garage today because of compute costs. Is tech entrepreneurship dead for regular people?- i will not promote",
        "selftext": "I just watched an interview where Sergey Brin was asked if he’d go back to starting Google in a garage today. His answer was straight up “no” - said the amount of compute and science required to start a competitive AI company would make it impossible to bootstrap from a garage anymore. And this is coming from someone with a CS PhD from Stanford, so he knows what he’s talking about. If even the Google co-founder is saying you can’t start the next big thing without massive capital anymore, what does that mean for tech entrepreneurship? Is it still the best path to create wealth, or has it been replaced by something else? I always thought tech was special because you could start with nothing and build something huge, but maybe those days are over? Would love to hear what people think, are we entering an era where only the already-rich can build the next generation of tech companies?​​​​​​​​​​​​​​​​\n\n",
        "subreddit": "startups",
        "author": "Hot-Conversation-437",
        "score": 175,
        "num_comments": 129,
        "created_utc": 1761693629.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oiothj/sergey_brin_said_he_wouldnt_start_google_in_a/",
        "fetched_at": "2025-10-30T16:16:16.178867"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 169,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-30T16:16:19.803043"
      }
    ]
  }
}