{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-06T00:56:35.822513"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-06T00:56:27.340432"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-06T00:56:26.922657"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-06T00:56:26.922670"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-06T00:56:26.922660"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-06T00:56:26.922651"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-06T00:56:27.340430"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-06T00:56:27.340435"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-06T00:56:27.340434"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-06T00:56:27.340424"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-06T00:56:26.922669"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 485,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-06T00:56:34.821254"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 437,
        "num_comments": 125,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-06T00:56:34.821277"
      },
      {
        "id": "1pexdkv",
        "title": "Advice needed - managers expected to chip in for extravagant gift for company owner",
        "selftext": "Tldr - 17 managers are expected to chip in $100 toward a $1700 gift for the company owner.\n\nContext - \n\nI've been working at this company for less than a year, and overall am very happy here. Though it would be considered a small business (80 employees and one owner) the company is very successful, debt free, and grosses roughly 50m revenue/ year. This morning I received the following email from the president (owners nephew training to take over after owner retires)\n\n\nTeam,\n\nAs we do each year we have secured a holiday present for Owner.  Owner eats quite a bit of fish so we got him a monthly subscription for a year from Wild Alaskan Company. https://wildalaskancompany.com/. \n\nEach person’s contribution is $100.  Please venmo me when you have a chance. \n\n\nThere were 17 people on the email chain, so they are anticipating collecting $1700 for this gift. This was not discussed, and based on the email, did not seem to be posed as optional. \n\nMy first instinct was to report the email as phishing because I thought there's no way this guy is asking us all to Venmo him $100, but when I looked at the recipients, it seemed legit. Head of HR and IT were both on the To line.\n\nAm I crazy for feeling like this is a bit much? Can't we just get the guy a tie? Isn't our gift to him the labor we put in to make him his several million dollar salary? \n\nShould I report the email? Send the Venmo? What will happen if I just don't do anything, are they going to follow up? I don't want to come off as cheap or unappreciative. I get paid well and I think the owner is great, but this all seems so odd to me. ",
        "subreddit": "smallbusiness",
        "author": "BMFResearchClub",
        "score": 91,
        "num_comments": 73,
        "created_utc": 1764947087.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pexdkv/advice_needed_managers_expected_to_chip_in_for/",
        "fetched_at": "2025-12-06T00:56:33.059089"
      },
      {
        "id": "1pf45lu",
        "title": "A facial search-inspired analysis of features of Ai FaceSeek  versus simplicity in SaaS design",
        "selftext": "I was inspired to consider SaaS products after seeing a breakdown of how a face seek workflow maintains simplicity by only revealing what matters. Even though it is very tempting to keep adding features, there are moments when simplicity seems far more valuable.\nHow can founders or project managers distinguish between features that add noise and those that actually improve the product? I'm interested in how teams stay focused while developing at a reasonable rate.",
        "subreddit": "SaaS",
        "author": "Geokobby",
        "score": 82,
        "num_comments": 2,
        "created_utc": 1764962701.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pf45lu/a_facial_searchinspired_analysis_of_features_of/",
        "fetched_at": "2025-12-06T00:56:29.865581"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 74,
        "num_comments": 53,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-06T00:56:34.821299"
      },
      {
        "id": "1pegww5",
        "title": "Built a 3 million per year construction company from nothing and was misled during asmall business loan process. Now blocked from real lending and need guidance.",
        "selftext": "I usually keep things private but I am at a point where I need insight from people who have dealt with real entrepreneurial stress and not the polished version that gets shared online.\n\nI built a construction company from scratch. No loans. No investors. No safety net. Just work ethic and showing up every day. In about thirty months we grew to more than 3 million dollars per year in revenue. \n\nWhen we reached that level I wanted to hire more people and stabilize cash flow so the company could continue growing in a healthy way. I went for an SBA loan to support hiring and operations.\n\nA national brokerage I worked with told me that in order to qualify for the SBA loan I needed to take certain short term financing products first. They presented this as a routine step that helps underwriting and repeatedly reassured me that the SBA approval was essentially done. They also told me not to apply anywhere else so it would not interfere with the process.\n\nI trusted them. And yes I know how stupid that looks now. I am not pretending I made a smart choice. I made a mistake. I believed someone who sounded confident and authoritative and it put me in a bad position.\n\nThe SBA loan never came. The promises were not real. And I ended up with aggressive short term debt that I never needed and never would have taken if I had not been told it was required.\n\nThe worst part is that having these short-term loans now blocks me from real lending. It does not matter that the business brings in over 3 million dollars per year or that the pipeline is strong. Every legitimate lender sees these obligations and says no. I cannot get the SBA loan anymore. I cannot get a term loan. I cannot refinance. It is an automatic rejection every time.\n\nThe business itself is not failing. The demand is there. The revenue is there. The work is there. What is failing is the financing situation that was pushed onto me under false guidance. And I am not losing the company but I am losing my mind trying to fix this while keeping everything running.\n\nI am working with attorneys because of how this was handled but that takes time and I need a practical path forward now.\n\nI am looking for guidance from anyone who has dealt with something similar.\n\nHas anyone been misled during the SBA process?\n\nHas anyone successfully negotiated or restructured short term financing?\n\nHas anyone brought in a private capital partner or done a revenue share to rebalance cash flow?\n\nWhere do entrepreneurs in this situation actually find lenders who understand real revenue instead of just looking at these short term loans as a red flag?\n\nI am keeping my identity private for obvious reasons but I am open to talking privately with anyone who has real experience with this or who invests in strong operators navigating temporary financial pressure.\n\nI built this company from nothing and it is not going under but my growth is now greatly hindered by these and I am asking for some direction in order to get out.",
        "subreddit": "Entrepreneur",
        "author": "krush4014",
        "score": 62,
        "num_comments": 91,
        "created_utc": 1764895036.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pegww5/built_a_3_million_per_year_construction_company/",
        "fetched_at": "2025-12-06T00:56:28.148333"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 58,
        "num_comments": 20,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-06T00:56:34.821274"
      },
      {
        "id": "1pesqbq",
        "title": "I got 80,000 visitors in one day and then everything went quiet. That emotional whiplash taught me something I wish I knew earlier",
        "selftext": "A while back I had this project that I’d been tinkering with after work. Nothing flashy, just something I genuinely cared about and tried to build the “right” way. One random day it caught a wild wave and 80,000 people landed on it in 24 hours.\n\nFor about half a day, I honestly thought, okay maybe I finally built something that resonates. Not because of luck, but because I believed in the thing itself. It was clean, useful, simple. I built it the way I wished more things online were built. And for a few hours it felt like the internet finally noticed. Then the numbers just kept going down every day. Retention was almost nonexistent. Repeat visits were basically statistical noise.\n\n\nThe silence after a spike hits differently when you genuinely believe in what you’re making. It’s not “maybe this sucks.” It’s more like, “nobody stayed long enough to even know if it was good.”\nNobody really talks about that part.\n\n\nYou can pour years into something solid and the world will shrug like it’s another tab to close. Quality doesn’t magically earn attention; they're two separate battles.\n\n\nThe crash did shake my belief for sometime. But it was a reminder that real traction isn’t a moment. It’s built quietly, brick by brick, when nobody’s watching\n\nThe thing I wish I knew earlier is this:\n\nThe graph isn’t the work\n\nThe work starts after the graph collapses\n\nJust wondering how many people here have had that same “false dawn” moment, the surge that feels like a breakthrough, followed by the silence that punches you in the ego.\n\nWhat did yours end up teaching you?",
        "subreddit": "Entrepreneur",
        "author": "AltruisticGru",
        "score": 57,
        "num_comments": 40,
        "created_utc": 1764934230.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pesqbq/i_got_80000_visitors_in_one_day_and_then/",
        "fetched_at": "2025-12-06T00:56:28.148294"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 55,
        "num_comments": 53,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-12-06T00:56:34.821303"
      },
      {
        "id": "1pf0nyg",
        "title": "\"went from 2/10 to 8/12 demo close rate by doing the opposite of what every sales course teaches\"",
        "selftext": "running a small B2B SaaS. was closing 2 demos out of every 10. spent money on a sales course that taught me to \"control the narrative\" and \"demonstrate value\" and all that.\n\nmade it worse somehow.\n\nthen had a demo in august where my screenshare broke 5 minutes in. couldnt show anything. ended up just talking to the guy about his current process and his problems for 20 minutes. he signed up the next day.\n\nthat completely changed how i do demos now.\n\nstopped doing the 30 minute product tour thing. now i just ask them questions for the first 10 minutes. like actually understanding what they currently do and what sucks about it.\n\nthen i only show them the 2 or 3 features that would fix their specific problem. nothing else. dont even mention the other features unless they ask.\n\nend by asking \"would this actually solve what you just told me about?\" and then shut up.\n\nmy demo deck used to have like 25 slides showing everything. now its 6 slides. keep it in gamma so i can edit it quick before calls if i need to customize anything.\n\nclose rate went from 2 out of 10 to 8 out of 12 in the last 4 months. revenue went from $3k to $11k MRR.\n\nalso started sending followup emails within an hour instead of the next day. just a quick \"here's what you told me you need, heres which features would help, heres the next step\"\n\nthe whole shift was realizing people dont buy products. they buy solutions to their specific annoying problem. once i actually understood their problem first, everything got easier.\n\nstill feels weird that my demos are 20 minutes now instead of 45 but the numbers dont lie.\n",
        "subreddit": "SaaS",
        "author": "cherryy_04",
        "score": 53,
        "num_comments": 25,
        "created_utc": 1764954669.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pf0nyg/went_from_210_to_812_demo_close_rate_by_doing_the/",
        "fetched_at": "2025-12-06T00:56:29.865577"
      }
    ]
  }
}