{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-20T00:51:42.843689"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-20T00:51:35.451170"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-09-20T00:51:35.451176"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-20T00:51:35.123683"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-20T00:51:35.123675"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-20T00:51:35.123657"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-20T00:51:35.451167"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-20T00:51:35.451173"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-20T00:51:35.123679"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-20T00:51:35.451155"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-20T00:51:35.123681"
      }
    ],
    "reddit": [
      {
        "id": "1nkal8g",
        "title": "Stopped sharing my projects with my wife after years of failed ideas",
        "selftext": "I’ve been working 12+ hours a day for the past 5 years, trying more than 10 different ideas.\nNone of them became “successful” yet, but I keep pushing because I really believe one day something will click.\n\nUntil recently, I used to share every project idea with my wife and ask for her thoughts.\nBut her reaction lately has been:\n\n“Let us breathe with your projects. We know none of them work.”\n\nIt honestly hurt, and I’ve stopped telling her what I’m working on.\nI still love her and I know she’s just tired of seeing me struggle, but I feel pretty lonely in this journey now.\n\nHas anyone else been through this?\nHow do you deal with a partner who’s lost faith in your projects",
        "subreddit": "Entrepreneur",
        "author": "Silver_Tip260",
        "score": 666,
        "num_comments": 358,
        "created_utc": 1758207528.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nkal8g/stopped_sharing_my_projects_with_my_wife_after/",
        "fetched_at": "2025-09-20T00:51:36.046667"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 456,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-20T00:51:41.842294"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 161,
        "num_comments": 42,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-09-20T00:51:41.842312"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 145,
        "num_comments": 177,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-20T00:51:41.842347"
      },
      {
        "id": "1nl39t6",
        "title": "First client just asked for a refund after 3 months - how do you handle this?",
        "selftext": "Just got my first refund request from a client I've been working with for 3 months. They say the web app I built isn't what they expected even though we had weekly check ins and they approved everything along the way.\n\nI know refunds are part of business but this one stings because I put so much work into it. They're asking for the full amount back but still want to keep using the software.\n\nFor those who've been through this, how do you handle it? I'm thinking of offering 50% back since they used it for 3 months and got value from it but not sure if that's reasonable.",
        "subreddit": "Entrepreneur",
        "author": "notdl",
        "score": 141,
        "num_comments": 205,
        "created_utc": 1758287703.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nl39t6/first_client_just_asked_for_a_refund_after_3/",
        "fetched_at": "2025-09-20T00:51:36.046650"
      },
      {
        "id": "1njrbe4",
        "title": "Wearing MAGA apparel to investor meetings? I will not promote",
        "selftext": "I recently went to a startup demo day and a separate startup conference.  Both were in a red state.\n\nBoth aimed to connect startups with investors.  At both, a small number of people wore MAGA apparel, had a “thin blue line” flag and announced how Donald Trump Jr. had invested in their startups.\n\nIs this the norm for startup events outside the Bay Area and Northeast: vocal MAGA support, when meeting investors, is acceptable?",
        "subreddit": "startups",
        "author": "Big_Celery2725",
        "score": 137,
        "num_comments": 120,
        "created_utc": 1758148128.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1njrbe4/wearing_maga_apparel_to_investor_meetings_i_will/",
        "fetched_at": "2025-09-20T00:51:39.087598"
      },
      {
        "id": "1nl2pz3",
        "title": "SaaS is already dead but no one wants to admit it",
        "selftext": "Everyday this sub is flooded with screenshots of new SaaS products that are just the same AI wrapper over an API. Let’s be real most of it is slop. Nothing original nothing sticky no defensibility. The only reason any of them make money is because clients are slow to catch on and still pay for tools they don’t actually need.\n\nSaaS isn’t innovative anymore it’s a margin game. Everyone clones each other and slaps on some UI. Switching costs are low and the market is saturated. The only “wins” you see now are people who sell to clueless corporate teams that take months to change vendors. That’s not a strong business model that’s just inertia.\n\nThe crazy part is founders still think this is the golden path. It’s not. SaaS had its decade but the landscape has changed. Distribution matters more than the product. If you don’t own an audience or a channel you’re just building a disposable tool.\n\nPeople hate hearing it but SaaS is already a graveyard. The dumb clients paying invoices every month are the only thing propping it up. Once they wake up the collapse is obvious.\n",
        "subreddit": "SaaS",
        "author": "Professional-Let1245",
        "score": 123,
        "num_comments": 142,
        "created_utc": 1758286300.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nl2pz3/saas_is_already_dead_but_no_one_wants_to_admit_it/",
        "fetched_at": "2025-09-20T00:51:37.561902"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 115,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-20T00:51:41.842351"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 98,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-20T00:51:41.842332"
      },
      {
        "id": "1nkh6wc",
        "title": "Should I sell my business for $1.5M and launch a new one? (I will not promote)",
        "selftext": "I run an online business that is on track to make \\~$500K in profit this year. It's a crypto casino (like Stake/Rollbit) but much smaller and more niche. Today I got an idea, and it got me thinking... \n\nIs there anything stopping me from just selling my site for like $1.5M and building a new one from scratch?\n\nI'm pretty confident I could start from zero again and run it back up to $40K/mo profit within a few months of grinding. BUT... I've never sold an online business before, so I don't know if there's something contractually that would stop me from doing that like a non-compete. \n\nHas anyone done something like this before that can chime in?",
        "subreddit": "startups",
        "author": "InvestorProdigy",
        "score": 94,
        "num_comments": 81,
        "created_utc": 1758222254.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nkh6wc/should_i_sell_my_business_for_15m_and_launch_a/",
        "fetched_at": "2025-09-20T00:51:39.087569"
      }
    ]
  }
}