{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-03T16:14:56.990884"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-03T16:14:46.146682"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-11-03T16:14:45.841217"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-03T16:14:45.841211"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2025-11-03T16:14:46.146684"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-03T16:14:45.841195"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-03T16:14:46.146677"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-03T16:14:46.146680"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-03T16:14:45.841213"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-03T16:14:46.146666"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-03T16:14:45.841209"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 470,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-03T16:14:55.989462"
      },
      {
        "id": "1omjxa5",
        "title": "My small snack business went viral overnight; 850k YT views. Here’s what happened/how I'm managing.",
        "selftext": "Background: I run a small international snack brand called Pop Snax, which I started 2 years ago. Initial operations were out of my apartment where snacks took up every inch of space, lol. I've grown steadily over the last year, and I'm now working out of a co-warehouse space.\n\nAnyway, last Sunday, something wild happened. A huge influencer (Joe Bartolozzi) who randomly ordered one of my mystery snack boxes in August, unboxed it on stream. Had no idea who he was so I had no idea he was even placing an order. Within hours, my website traffic exploded. Shopify was dinging nonstop.. I got over 300 orders in two days. I was super confused at first and asked a customer how they found me, and that's when I found out about the influencer unboxing. \n\nI cried almost constantly for the first 2 days bc this was one of those surreal “this is actually happening” moments, and I had no idea what I'd done to deserve this. Since last Sunday, orders have been heavy and consistent and the video featuring my box has hit 850k views!  \n  \nWhile running the business, I also work a full-time job, so, I've been running on fumes trying to keep up with customer emails, packing, and fulfilling, often late into the night. It's been exciting, but also kind of chaotic.\n\nAnyway, this viral moment has given me my first real taste of HEAVY demand at scale, but its also exposed how under-resourced I am as a solopreneur. I don’t have a team yet, or fulfillment support, and I’m still figuring out how to maintain that momentum after the viral wave calms down.\n\nEven with the boost, I know growth won't be linear. There’s still the day-to-day grind I'm trying to figure out, i.e. running ads, improving packaging, managing costs, dealing with platform issues (looking at you, Amazon 😅), and trying to make every customer happy. I'm trying to get deep into AI, so I can offload some of that pressure/manual oversight. \n\nFeel free to ask me anything! And if anyone else here has gone viral with a product or business, how did you handle the surge? Did you manage to sustain it afterward?",
        "subreddit": "Entrepreneur",
        "author": "bestbab99",
        "score": 436,
        "num_comments": 75,
        "created_utc": 1762096674.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1omjxa5/my_small_snack_business_went_viral_overnight_850k/",
        "fetched_at": "2025-11-03T16:14:46.826885"
      },
      {
        "id": "1ommuiw",
        "title": "Stop coding. You're building something nobody wants.",
        "selftext": "I mean it. Too many founders are so high on their own idea they spend months and thousands of dollars building a product that solves a problem nobody actually has. Your idea is a worthless assumption until someone who isn't your mom is willing to pay for it.\n\nThe \"gurus\" sell you on hustle and vision. I'm telling you that's how you go broke. Before you hire a dev or write a single line of code, you need to find the truth, not just confirmation.\n\nHere’s how you do it without a dev team.\n\n**1. Nail your one sentence hypothesis.**\n\nForget 50 page business plans. Write this down and stick it on your wall:\n\nMy target customer, [BE SPECIFIC], struggles with [A PAINFUL, SPECIFIC PROBLEM] and would pay to have it solved.\n\nA founder wanted to build a fitness app. Vague. He went to r/Fitness and realized what people actually hated was logging their workouts in confusing apps. His new hypothesis: “Gym goers who are serious about lifting struggle with clunky workout trackers and would pay for a faster, simpler way to log their sets and reps.” See the difference?\n\n**2. Run cheap experiments to prove yourself wrong.**\n\nYour goal here isn't to get a \"yes.\" It's to see if your idea can survive contact with reality.\n\n*   **The Landing Page Test:** Use Carrd or Notion to build a one page site. Don’t talk about features. Talk about the painful problem and the beautiful outcome your solution provides. Add a \"Get Early Access\" button that collects emails. If you can’t get 100 people to give you an email address, you sure as hell won't get them to give you a credit card.\n\n*   **The Manual 'Concierge' Service:** Sell the solution and deliver it yourself by hand. I know a founder who validated a complex B2B automation tool by running the entire service on Google Sheets and a bunch of Zaps for his first ten paying clients. They never knew. They just knew their problem was solved. He didn't build the real software until he had revenue.\n\n*   **The Social Media Smoke Test:** Post about the problem you’re solving on LinkedIn, Twitter, or a relevant subreddit. Don't pitch your product. Just talk about the pain. \"Anyone else hate how long it takes to [do X]?\" The responses will tell you everything. If people don’t even care enough to complain about the problem, they will never pay for a solution.\n\n**3. Read the results like a cold blooded realist.**\n\nLook at the data. A high email signup rate is a good signal. A bunch of people willing to pay you to solve the problem manually is an amazing signal.\n\nSilence is also data. Silence is a \"no.\"\n\nA lack of interest isn't a failure. It’s a cheap lesson. It’s a gift. Pivoting now costs you a weekend. A failed launch after six months of coding will cost you your savings and your sanity.\n\nStop treating your idea like a precious baby. Treat it like a lab rat. Put it through the maze. If it dies, you get another one. That's how you find the one that gets the cheese.\n\nWhat's the most expensive assumption you've ever made building a product?",
        "subreddit": "SaaS",
        "author": "justdoitbro_",
        "score": 267,
        "num_comments": 136,
        "created_utc": 1762103417.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ommuiw/stop_coding_youre_building_something_nobody_wants/",
        "fetched_at": "2025-11-03T16:14:48.613614"
      },
      {
        "id": "1omyj0v",
        "title": "Made a dumb mistake",
        "selftext": "I run ghost tours and someone called me to arrange a private tour for a large group. I said I usually only take up to 12 people but could make an exception. She had 12 people confirmed and asked if she could just pay me the time of the tour if more friends decided to join. It turned out to be 18, but then several dropped out after a few minutes. It was chaotic because they were chatty and I had to herd them and look out for stragglers. I wasn't used to such a large group. I had 16 complete the tour. The whole day had been stressful so I was distracted and forgot to make sure the first person paid me for the extra 4 people before ending the tour last night. Today I'm texting her for the extra tickets and so far she's not answering. Hoping she will eventually, but what can I do if she doesn't? That's $140. May not seem like much, but I'm just one person and that can pay some bills. ",
        "subreddit": "smallbusiness",
        "author": "atyl1144",
        "score": 241,
        "num_comments": 39,
        "created_utc": 1762132223.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1omyj0v/made_a_dumb_mistake/",
        "fetched_at": "2025-11-03T16:14:52.157079"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 186,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-03T16:14:55.989494"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 166,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-11-03T16:14:55.989528"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 164,
        "num_comments": 26,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-03T16:14:55.989477"
      },
      {
        "id": "1olcckq",
        "title": "Our patent was granted!!! (I will not promote)",
        "selftext": "I am a co-founder at an early stage startup, and our patent for our technology just was granted today!! This is huge for us. The founder filed the patent 7 years ago and has been through the rejection and appeal process multiple times with an absolutely amazing patent attorney, and today, all that work paid off!! This is major, foundational tech, that has the potential to be very industry disrupting.\n\nMy best advice is to find a patent attorney that really knows their stuff if you're confident you have something novel that you want to protect.\n\nAnyway, just celebrating this huge win! Still gotta pinch myself, then go back through all our copy and change \"patent-pending\" to \"patented\" 😁🥳\n\nI will not promote ",
        "subreddit": "startups",
        "author": "loveyousomuch_ok",
        "score": 115,
        "num_comments": 55,
        "created_utc": 1761962181.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1olcckq/our_patent_was_granted_i_will_not_promote/",
        "fetched_at": "2025-11-03T16:14:50.440134"
      },
      {
        "id": "1on7pef",
        "title": "the toughest business in the world might just be… restaurants",
        "selftext": "saw this founder talking about how 70% of restaurants shut down within two years, and it kinda stuck. \n\ncloud kitchens? apparently closer to 90%. and yet, somehow every few months, someone new decides they’re gonna “open a cute café” or “launch a cloud kitchen.”\n\ni’ve got friends at masters union running small kitchens, no fancy funding, just word-of-mouth orders, and they’re still building from last 6 months. i honestly don’t get how. margins are thin, delivery apps take their cut, and rent keeps climbing. feels like half grit, half chamatkar.\n\nso yeah, maybe the podcast was right or this is just a scale business? wdyt on this?",
        "subreddit": "smallbusiness",
        "author": "YogurtIll4336",
        "score": 102,
        "num_comments": 55,
        "created_utc": 1762163642.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1on7pef/the_toughest_business_in_the_world_might_just_be/",
        "fetched_at": "2025-11-03T16:14:52.157077"
      },
      {
        "id": "1o40fm7",
        "title": "As someone who works from home, how do you socialise? or meet new people/make friends?",
        "selftext": "I am working from home, a 27F. Honestly it gets boring and i dont have any friends in here in my hometown. I have lived in hostel since 15 and hence havent made any friends here.\n\nMy hometown is also not a lively place with meetups or activities happening, so it just becomes difficult for me.\n\nAny other way to socialise? maybe any online ways? Please suggest.\n\nUpvote1Downvote1Go to comments  \n",
        "subreddit": "freelance",
        "author": "This-Brief6214",
        "score": 58,
        "num_comments": 62,
        "created_utc": 1760201179.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o40fm7/as_someone_who_works_from_home_how_do_you/",
        "fetched_at": "2025-11-03T16:14:55.989516"
      }
    ]
  }
}