{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-03T08:15:18.938696"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-03T08:15:12.058227"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-03T08:15:11.689523"
      },
      {
        "videoId": "SSE2weHo_IE",
        "title": "10 Simple Video Production Workflow Tips and Tricks",
        "description": "10 simple video production tips and tricks to help you save time and do more with video. What I used or mentioned to produce ...",
        "channelTitle": "Kevin Kolbe",
        "publishedAt": "2023-11-16T14:30:35Z",
        "url": "https://www.youtube.com/watch?v=SSE2weHo_IE",
        "fetched_at": "2025-09-03T08:15:11.689531"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-03T08:15:11.689512"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-03T08:15:12.058225"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-03T08:15:12.058231"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-03T08:15:12.058229"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-03T08:15:11.689528"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-03T08:15:12.058215"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-03T08:15:11.689529"
      }
    ],
    "reddit": [
      {
        "id": "1n6b3ez",
        "title": "Leased a gas station for 5 years",
        "selftext": "I’m paying 14k a month and after all over head I’m coming away with 5-  7.k .  a month. Give or take initially. But I’ve managed to clean the place up and increase revenue .\nI put down 100k good willl plus 90 inventory.  \nI think I’m getting rammed.  Going to ask for rent to go to 10k and arrange some sort of purchase instead of lease.  It’s my father in law. So I have some leeway. ",
        "subreddit": "Entrepreneur",
        "author": "CookiesInTheGym",
        "score": 447,
        "num_comments": 118,
        "created_utc": 1756790558.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n6b3ez/leased_a_gas_station_for_5_years/",
        "fetched_at": "2025-09-03T08:15:12.567648"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 446,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-03T08:15:17.937285"
      },
      {
        "id": "1n6mlx6",
        "title": "0 to $1M in 3 years: What it really takes",
        "selftext": "I started my company in 2023, and this year we're projected to hit somewhere between $1M and $1.5M in revenue. My goal of hitting $3-$5M in the next 3 years is very achievable at our current rate of growth. I'm going to give you the reality of starting and growing a business to $1M in 3 years, without sugar-coating it. If I burst some bubbles and dash some hopes with this post, then I've done my job. I won't divulge what my industry is because I'm discussing general business principles that apply to any industry. Different industries have different barriers to entry, and some businesses can scale faster than others. In Silicon Valley, hitting $1M in 3 years is pathetic. High growth tech startups can hit $10M three years after launch, but the barriers to entry in the industry are high. I'm speaking to the average person who wants to open a restaurant, launch a product or start a service business. What does it really take to build a successful company and scale it to $1M?\n\n1. Money. This is the hard truth nobody wants to hear. It takes money to start and scale a business, any business. I made an initial investment of $20k to get my business going. $20k is not a lot of money in the startup world. Most businesses require much more to get off the ground, but many wantrepreneurs are unable or unwilling to risk even minimal capital to get a real operation going. Can you start a business without investing a lot of money? Sure, but you're not going to scale your business to $1M quickly without starting capital. You're competing with other businesses that already have money to burn on marketing, operations, staffing and product/service development. If you don't have money or outside capital to launch a business, then you need to do it the old-fashioned way: work hard, live cheap and save. That might take years, but if immigrants who came to America with $3 in their pocket can start a dry cleaner or c-store this way, you can save money to start your business too.\n\n2. Marketing. I don't care how amazing your product/service is, if you can't get paying customers in the door, to your website, or on the phone, your business will go nowhere. This is probably the hardest part of getting a business off the ground. Marketing is mostly pay-to-play, so if you're just hoping to scale by building an organic social media following or going door-to-door, you will have a hard time growing to $1M. Developing a marketing plan that works requires a lot of trial and error. Whatever strategy you initially thought would win customers probably won't work as expected. You need to try a variety of marketing channels, track your ROIs, drop the ones that don't work, and invest more into the ones that do. Once you find a marketing strategy that works, it's like having a free money machine. The more you put into marketing, the more you make; The more you make, the more you can put into marketing, ad infinitum. However, the process of fine-tuning your marketing strategy will be difficult and costly. You need to be prepared to burn a lot of money on things that don't work, and always be ready to adapt and change your strategy. \n\n3. People. You can get a business going by yourself, but as you scale to $1M, you're going to need employees. In most industries, you probably can't handle a $1M operation by yourself. Too many business owners get stuck in the cycle of trying to do everything themselves, and their business stagnates as a result. Think of a new employee as an investment. They will cost you money in the beginning, but in time, a good employee will help grow your business and provide a return on your investment. Once you've built a good team, you need to learn how to delegate.  When you harness the power of delegation, an effectively managed employee is like making a copy of yourself. If you got your business to $250k by yourself, a two-person team can get you to $500k, three people to $750k, etc. (it's really not that simple, but you get the idea). You can't be in the trenches with your employees forever. As your business grows, you have to step out of the trenches so you can survey the battlefield, strategize and lead your troops. This is how you scale to $1M and beyond. I couldn't have done it without my team, and they couldn't have done it without effective leadership.\n\nStarting a business and growing it to $1M is insanely difficult. I know from hard experience that most of you will not succeed. Most wantrepreneurs won't get anything substantial off the ground at all, and of those that do, many will fail after a few years. This is simply the reality of entrepreneurship. However, if you are able to succeed, the satisfaction of building something scratch, being captain of your own ship, and reaping the reward of your hard work is the best feeling in the world.",
        "subreddit": "Entrepreneur",
        "author": "Evening_Result7283",
        "score": 426,
        "num_comments": 67,
        "created_utc": 1756826925.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n6mlx6/0_to_1m_in_3_years_what_it_really_takes/",
        "fetched_at": "2025-09-03T08:15:12.567635"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 274,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-09-03T08:15:17.937340"
      },
      {
        "id": "1n6z4bu",
        "title": "DO NOT be scammed into joining the BBB.",
        "selftext": "This is a lessons learned I wish I didn't have to share.\n\nA few months ago, I started a simple creative solo local business as a side gig, and as soon as I had joined my local Chamber of Commerce, I got spammed with calls from the BBB that made me think I was missing out. Their salesman was very good in making me feel like there was an urgency to address this.\n\nAfter a lot of back and forth, I hate to admit that I got ~~coerced~~  convinced into getting a membership with them. They charged me for a full years amount even though I asked for a monthly (to test it out). After a very angry phone call, I convinced them to refund me the full amount and put me on a monthly plan, again to test it out. However, my instincts made me INSIST on having a written confirmation by the salesman that I have 120 days to cancel and have a full refund emailed to me. I'm so glad I did.\n\nI put a calendar reminder in about 3 months to cancel the membership (because the plan was always to get out of this mess). The time has come, and after replying to that same email confirmation of a refund, I gave them a call to start the process. The same guy tried to pull on the sleazy salesman tactic, which I was having none of, and he was trying very hard to get me off the phone call. First by saying I actually OWED them hundreds of dollars for the remainder of the year, then switched to saying they'll leave me active for another month and then maybe cancel, neither of which he had any ground to stand on.\n\nFinally, when he said they'll just cancel the membership with no refund it's been over 90 days, I asked him to help me understand what part of (copy/pasta from the email) \"*If you decide to cancel your membership, we will refund the dues that you have paid, up to 120 days. Any cancellation beyond 4 months, no refund will be given on any dues paid to that point*\" does this apply to? He flat out asked me if I have that in writing, to which I pointed back to the very email he wrote to me and I replied to.\n\nThis sleazy salesman said they'll cut me a check, he's very busy and has to get back to work, then ended the call immediately before I said another word.\n\nI'm now keeping my eye on my credit cards, waiting to confirm my cancellation, and then will block every BBB number that calls me.\n\nTHE BETTER BUSINESS BUREAU IS A SCAM ORGANIZATION. DO NOT EVER BECOME A BUSINESS MEMBER.",
        "subreddit": "smallbusiness",
        "author": "Unsilent_SoCalipede",
        "score": 154,
        "num_comments": 49,
        "created_utc": 1756855783.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n6z4bu/do_not_be_scammed_into_joining_the_bbb/",
        "fetched_at": "2025-09-03T08:15:16.691767"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 143,
        "num_comments": 173,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-03T08:15:17.937320"
      },
      {
        "id": "1n6ear8",
        "title": "What is an automation that 10x ed your productivity as an entrepreneur?",
        "selftext": "Not talking about tiny shortcuts, but the kind of automation that actually saved you hours every week or completely changed your workflow. Could be in business, personal life, or just random hacks you set up.\n\nWhat’s the one automation you set up that made you think “wow, I should’ve done this years ago”?",
        "subreddit": "Entrepreneur",
        "author": "impetuouschestnut",
        "score": 136,
        "num_comments": 97,
        "created_utc": 1756802981.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n6ear8/what_is_an_automation_that_10x_ed_your/",
        "fetched_at": "2025-09-03T08:15:12.567658"
      },
      {
        "id": "1n6qn7m",
        "title": "Most businesses fails because no one knows they exist",
        "selftext": "One of my favorite quotes: “Attention is the new internet currency.”\n\nIf people don’t know you exist, nothing else matters. NOT your product, not your service, not your pricing.\n\nThe businesses that win are the ones that own attention. They post relatable, relevant content daily. They show up where their audience spends time. They build communities.\n\nPeople’s attention is spread thin in today’s world, AND if you don’t capture their attention, someone else will.\n\nThoughts?",
        "subreddit": "smallbusiness",
        "author": "ChillEntrepreneur",
        "score": 122,
        "num_comments": 55,
        "created_utc": 1756835970.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n6qn7m/most_businesses_fails_because_no_one_knows_they/",
        "fetched_at": "2025-09-03T08:15:16.691771"
      },
      {
        "id": "1n6wysf",
        "title": "My buisness is working. That's it.",
        "selftext": "At 21 I was homeless. I started 10 different things. All failed even after most MVPs made some change.\nAt 32 im at 1000 daily profit and it's mostly auto-pilot now. \n\nTheres no course or cheat code I have to offer although I worked really hard at finding ways to not work.\n\nLearn something people dont or cant do but still need. Do it for them.\n\nEdit : lots of haters in this thread lol",
        "subreddit": "Entrepreneur",
        "author": "PerformanceCute9865",
        "score": 118,
        "num_comments": 56,
        "created_utc": 1756850404.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n6wysf/my_buisness_is_working_thats_it/",
        "fetched_at": "2025-09-03T08:15:12.567637"
      },
      {
        "id": "1n6klsg",
        "title": "We found product market fit - and then my co-founders child was diagnosed with cancer.",
        "selftext": "I hope you don’t mind - this is going to be a long one!\n\nIt’s taken me 12 months to process this event and write this post, but I want to share my experiences because the lessons I learned might help another founder going through their own version of chaos in their lives.\n\nIn July 2024, after 18 long months of prospect interviews, pivots, and constant self-doubt, our SaaS startup finally hit product-market fit.\n\nAs the CTO, this was a huge relief.\n\nWe’re three founders (CTO, CMO, CSO) and we had all given up successful agencies to start our current software company. We originally thought our combined experience would mean a quick path to PMF. How wrong / naive we were.\n\nThose 18 months were brutal:\n\n\\- 14 hour days\n\n\\- Endless feedback loops\n\n\\- Constantly changing the product\n\n…and the constant questioning of my life choices and whether it would ever work!\n\nBut finally - we found customers and a market that needed us! Literally overnight, we now had a clear sense of direction and best of all, clarity for future strategic decision making. Now we had hit PMF, the plan was SUPER simple: scale like f\\*ck.\n\nMy co-founders started working on outbound and referral strategies (their strengths from previous agencies), while I stepped back and I was super excited to learn new skills from them. All they required from me were some python automations for their outbound systems and product maintenance. For the first time in nearly two years, I felt like myself again!\n\nNo more 14-hour days. No more second guessing my career decisions.\n\nWe were ready to launch and we planned our big sales push for the third week of July 2024.Then came the WhatsApp message.\n\nOur CSO’s 11-year-old son had been diagnosed with an incredibly rare form of cancer.\n\nWe’ve been friends since high school. When I read that message, it felt like my heart had been ripped out.For me, I immediately felt useless to him.\n\nOn a personal level, I was literally powerless - I couldn’t make this better and I was so sorry for him.On a professional level however, I could help as SOMEONE had to step into his role.\n\nThe 14-hour days returned. But this time, it felt different.\n\nWith the perspective of what my co-founder was going through, every “big problem” at work that used to consume me felt LAUGHABLY small.\n\nProblems no longer consumed me - it was surreal! They began to roll off.\n\nI also had to jump headfirst into sales, marketing, and investor conversations. Things I once found terrifying and thought that I’d be terrible at - quickly became second nature.\n\nAnd through all of this, our CSO even closed investors during this time! So the company didn’t just survive, it grew!\n\nHere are the three biggest lessons I walked away with:\n\n1. **You’re capable of WAY more than you think!** I NEVER imagined that I’d EVER thrive in sales and fundraising. I am by nature a dork that likes to sit in dark rooms and build stuff  but necessity forced me to grow and now I have skills for life.\n2. **No problem is big in the grand scheme of things.** Bugs, investors or angry customers can sometimes present problems that feel so big, it feels like the world is going to end. That’s until you’re reminded of what a “big” problem really is and your whole perspective shifts.When I face the scent of a shit sandwich now, I now think about how lucky I am that these are my ONLY problems.\n3. **Know where you are in the product lifecycle.** Startup, scale, maturity - understanding your CURRENT stage helps you focus when the world shifts under your feet. There are times to be simultaneous with product strategy and times to be systematic! You need to know which… \n\nSo here’s some good news!\n\nA couple of months ago, our CSO's son was given the all clear! Even better, he was featured in Season 4 of the Disney+ series “Welcome to Wrexham\\*” -\\* which was awesome!\n\nThis whole experience made me appreciate how much support matters and after going through it - we would have loved to have had a community to ask questions to.\n\nSo I have set up a free community for SaaS founders that can share their struggles, wins and support each other with in depth discussion on SaaS topics!\n\n[If you would like to join, just click here!](https://www.skool.com/saas-life-5260/about?ref=1055b1ef676f4069a9ad1cbe488b965e)\n\nWe’ve got founders at every stage: some just starting, others who’ve exited for millions, all supporting and learning from each other.\n\nJust incase this isn't obvious, this IS NOT my SaaS. It is a free community for founders that I started as a result of the above events.",
        "subreddit": "SaaS",
        "author": "BuildWConnor",
        "score": 112,
        "num_comments": 15,
        "created_utc": 1756822377.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n6klsg/we_found_product_market_fit_and_then_my/",
        "fetched_at": "2025-09-03T08:15:13.968705"
      }
    ]
  }
}