{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-10T16:14:14.326856"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-10T16:14:07.095241"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-10T16:14:06.621213"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-10T16:14:06.621205"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-10T16:14:06.621197"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-10T16:14:07.095238"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-10T16:14:07.095244"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-10T16:14:07.095246"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-10T16:14:06.621210"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-10T16:14:07.095226"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-10T16:14:06.621212"
      }
    ],
    "reddit": [
      {
        "id": "1nd8tep",
        "title": "How these guys made $1.2B by shamelessly copying startups (and what we can learn from it)",
        "selftext": "Back in 1998, three German brothers: Marc, Oliver, and Alexander noticed something interesting: eBay was exploding in the US, but hadn’t yet touched Germany.\n\nThey pitched eBay directly: *“Bring your platform here, and let us run it.”*  \neBay said no.\n\nSo the Samwers went home, cloned eBay almost pixel for pixel, called it **Alando**, and launched it in Germany. Within **100 days**, eBay realized it was losing the market, and ended up acquiring Alando for **$43M**.\n\nThat deal lit a fire. The brothers went on to found **Rocket Internet**, a venture studio dedicated to a simple playbook: find a proven US startup, rebuild it for Europe or emerging markets, scale it fast, then sell it back (or compete directly). They cloned Facebook (StudiVZ), Airbnb (Wimdu), Groupon (Citydeal), and even Amazon (Zalando started as a Zappos copy).\n\nWhether you see it as genius or shady, it worked today each brother is worth around **$1.2B**.\n\n**My takeaway:**\n\n* You don’t always need to invent something new. You can *localize* what already works elsewhere.\n* Speed and execution often beat originality. Rocket wasn’t first; they were just the fastest in their market.\n* Distribution can matter more than innovation. Even the best product loses if it doesn’t show up where users are.\n\nDo you think cloning US SaaS products for Europe still works, or are most tools global enough now that just translating the interface is all you need?",
        "subreddit": "Entrepreneur",
        "author": "Ben_LF9",
        "score": 721,
        "num_comments": 61,
        "created_utc": 1757493744.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nd8tep/how_these_guys_made_12b_by_shamelessly_copying/",
        "fetched_at": "2025-09-10T16:14:07.542204"
      },
      {
        "id": "1ncf0ts",
        "title": "My app makes $14k/mo and I haven’t told my family",
        "selftext": "Hi guys, 1 year ago I launched [this app](https://buildpad.io) focused on product development that I had been working really hard on.\n\nIt started out with me just being annoyed by trying to build stuff with ChatGPT so I created a solution I thought was better.\n\nIt got some traction but nothing huge, around 3 months in it was doing $1k/mo. I talked to my family about it and they were supportive of course but as you can imagine not super impressed. You know how it is.\n\nAnyway, I’ve been grinding for another 8 months now and have made some good product decisions, gotten feedback from customers, and shaped up my marketing. I don’t know what happened this summer but I got busy as heck and now I just closed August at $14k/mo. It’s kinda hitting me now that I’m actually making really good money and I haven’t told my family or anyone.\n\nI was waiting for this moment for months and now that it’s finally here I don’t know if it’s even time yet…\n\nShould I tell them? How much do you share with your friends and family?",
        "subreddit": "SaaS",
        "author": "felixheikka",
        "score": 503,
        "num_comments": 285,
        "created_utc": 1757413016.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ncf0ts/my_app_makes_14kmo_and_i_havent_told_my_family/",
        "fetched_at": "2025-09-10T16:14:09.186213"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 448,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-10T16:14:13.325532"
      },
      {
        "id": "1ncpncq",
        "title": "6 Years to Build, 6 Months to Collapse - My Rant",
        "selftext": "  \nWe opened our brick-and-mortar shop in Florida about six years ago with a simple idea: create a small slice of Europe here in the U.S. We hand-select unique goods from countries like Portugal, Spain, France and Italy, and we’ve worked hard to build a store that feels different, an experience, not just a shop.\n\nWith the exception of our first year, we’ve grown 10–13% year over year. We’ve spent countless hours curating products, learning international logistics, and figuring out how to import legally and efficiently. When we brought in containers, we paid all duties and taxes. For smaller shipments, the *de minimis* exception helped balance the books, letting us absorb the steep HTS rates on bigger imports. It wasn’t easy, but it's been working.\n\nOur plan was long-term,  keep building until 2028, then decide to either sell the business or lease it. Instead, in the past six months everything has started unraveling. With the new tariffs in place, invoices from DHL and UPS are suddenly showing 30–75% duties on the entire purchase cost.\n\nThat kind of increase isn’t just a line item, it’s a death sentence for businesses like ours. We don’t sell “needs,” we sell “wants.” Our shop is essentially an upscale gift store. Raise prices enough and customers simply stop buying. And with the economy already tightening and consumer spend way down the timing couldn’t be worse. We’ve just had the lowest sales months since opening.\n\nHere’s the bigger problem,  this isn’t just my shop. Thousands of small businesses like ours rely on imports to bring cultural, artisan, and specialty products to U.S. customers. These aren’t luxury yachts or mass-manufactured electronics. We’re talking about olive oil, ceramics, linens, crafts, wines, the things that connect communities here to cultures abroad. If these products become too expensive to import, entire categories of small retailers will vanish.\n\nMeanwhile, large corporations with global supply chains will find workarounds. They can eat losses, spread costs, and negotiate deals. But independents like us can’t. We built something that took six years to establish, and it feels like it could collapse in six months, not because of bad business decisions, but because of sweeping policy changes that don’t distinguish between Walmart and a family shop.\n\nI don’t even know how to sell a business whose entire model is now in jeopardy. If importing becomes impossible, the value of everything we’ve built goes to zero.\n\nFor all the talk of supporting small businesses, this is the reality. Policies like this don’t just hit countries on the other side of the tariff, they hit the small American businesses on Main Street even harder.",
        "subreddit": "smallbusiness",
        "author": "Capital_Bathroom_865",
        "score": 306,
        "num_comments": 141,
        "created_utc": 1757439853.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ncpncq/6_years_to_build_6_months_to_collapse_my_rant/",
        "fetched_at": "2025-09-10T16:14:11.978081"
      },
      {
        "id": "1ncurwp",
        "title": "Do you SEO folks actually think by blasting my inbox you are going to get my business?",
        "selftext": "Title says it all. Are you guys that stupid? When I clean out my Spam folder every morning I see over 50 BS SEO pitches. Do you really think I'm going to hire someone who relies on this BS to promote my business. You all have got to be morons. Rant over. ",
        "subreddit": "smallbusiness",
        "author": "JobobTexan",
        "score": 296,
        "num_comments": 115,
        "created_utc": 1757451096.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ncurwp/do_you_seo_folks_actually_think_by_blasting_my/",
        "fetched_at": "2025-09-10T16:14:11.978074"
      },
      {
        "id": "1nclgb9",
        "title": "What I learned chasing a flashy startup vs a boring business",
        "selftext": "When I was 27, I spent months on a “sexy” lifestyle brand. Looked good, made almost no money.\n\nAt 28, I pivoted to something boring (filters for a niche machine). By Year 2 it was doing \\~$400k revenue with 20% margins.\n\nWhat I learned:\n\nTrends fade, boring sticks.\n\nPainkillers > vitamins (solve problems people need fixed).\n\nDistribution compounds (email > social hype).\n\nIf others here had the same experience: Have you seen a “boring” business quietly outperform the flashy ones?",
        "subreddit": "Entrepreneur",
        "author": "emojidomain",
        "score": 288,
        "num_comments": 61,
        "created_utc": 1757430421.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nclgb9/what_i_learned_chasing_a_flashy_startup_vs_a/",
        "fetched_at": "2025-09-10T16:14:07.542221"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 274,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-09-10T16:14:13.325595"
      },
      {
        "id": "1ncntaw",
        "title": "I quit my job, cloned apps, and now run 3 SaaS making $35K/month",
        "selftext": "Hey everyone,  \n8 years ago I was working as an optician with zero coding background. I taught myself to code from a 15-hour YouTube course and started building random tools.\n\nThe big breakthrough came when I realized:  \n👉 I don’t need to reinvent the wheel  \n👉 I can just find apps that are already working, make them a bit better, and launch fast\n\nSince then, I’ve built 3 SaaS products that together make \\~$35K/month (solo), the most recents:\n\n* [**StoryShort.ai**](http://StoryShort.ai) – AI faceless video generator for TikTok/YouTube (\\~$20K MRR)\n* [**Capacity.so**](http://Capacity.so) – a “vibe coding” AI dev tool (\\~$1K MRR and growing)\n\nHow I approach it:\n\n1. Spot apps that are already getting traction (especially via ads or SEO)\n2. Build my own version, sometimes with AI coding tools\n3. Launch immediately with ads to test demand\n4. If it sticks, I add SEO + affiliates for long-term growth\n\nI recently did a full interview with **Starter Story** where I break it all down, including my mistakes (like launching too big, or fighting Apollo with an email tool 😅).\n\nCurious what you guys think:  \nWould you focus on cloning proven tools, or go for riskier “original” ideas?\n\nHappy to answer questions in the thread.",
        "subreddit": "SaaS",
        "author": "samuel-rdt",
        "score": 176,
        "num_comments": 143,
        "created_utc": 1757435770.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ncntaw/i_quit_my_job_cloned_apps_and_now_run_3_saas/",
        "fetched_at": "2025-09-10T16:14:09.186207"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 148,
        "num_comments": 174,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-10T16:14:13.325574"
      },
      {
        "id": "1ncul5v",
        "title": "My skillset was replaced by AI. I'm physically disabled but mentally eager to work. I really need help coming up with plausible business ideas.",
        "selftext": "I hate admitting I need help, but I am desperate. I am a 32 y/o female who is physically disabled due to multiple botched kyphoscoliosis surgeries. I deal with pain unless I sit in a reclined/lying down position due to the curves in my spine. I could probably swing about 2.5-3 hours of \"on my feet\" time to build a business each day. I'm mentally well and crave mental stimulation, a job, my own money, and my own autonomy. I have applied to hundreds of remote jobs, but I lack a work history due to my medical history. Before AI became popular, I was doing okay as a freelance copyeditor and content writer; I had just graduated from a Master of Liberal Arts program with a 4.0, was halfway through a respected copyediting certificate program, had six regular clients, and was feeling confident in myself. Those clients disappeared over the course of a couple of months. I tried for months to land more clients, but the market became intensely competitive; plenty of folks with much more experience than me also needed to work and were lowering their rates. I have spun my wheels since. I want to build my own business, but I'm stuck on figuring out what to do that will allow me to work largely from my laptop and what that business would be. My skills like research, writing, and editing have been replaced by AI. I am absolutely willing to learn, but I don't even know where to begin. I'm asking you guys to help me brainstorm some genuinely *plausible* ideas. There is so much noise online about making money that I don't know what ideas would work well going into 2026. Like I said, I'm willing to learn, and I don't expect easy, fast money. But if you were in my shoes, what ideas would you be exploring? Thank you Reddit. ",
        "subreddit": "Entrepreneur",
        "author": "fluffyscrambledmeggs",
        "score": 128,
        "num_comments": 100,
        "created_utc": 1757450679.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ncul5v/my_skillset_was_replaced_by_ai_im_physically/",
        "fetched_at": "2025-09-10T16:14:07.542217"
      }
    ]
  }
}