{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-10T00:53:08.980176"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-10T00:53:01.964322"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-10T00:53:01.481559"
      },
      {
        "videoId": "1A0C2Ux7ESw",
        "title": "Video Editing like a Pro: Organizing Your Timeline",
        "description": "videoeditingtips #filmmaking #editing #editingworkflow #timelineorganisation #videoeditingtricks #creative #youtube.",
        "channelTitle": "The Editing Podcast",
        "publishedAt": "2023-04-01T13:00:01Z",
        "url": "https://www.youtube.com/watch?v=1A0C2Ux7ESw",
        "fetched_at": "2025-09-10T00:53:01.481568"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-10T00:53:01.481546"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-10T00:53:01.964319"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-10T00:53:01.964323"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-10T00:53:01.964325"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-10T00:53:01.481564"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-10T00:53:01.964308"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-10T00:53:01.481566"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 450,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-10T00:53:07.978837"
      },
      {
        "id": "1ncf0ts",
        "title": "My app makes $14k/mo and I haven’t told my family",
        "selftext": "Hi guys, 1 year ago I launched [this app](https://buildpad.io) focused on product development that I had been working really hard on.\n\nIt started out with me just being annoyed by trying to build stuff with ChatGPT so I created a solution I thought was better.\n\nIt got some traction but nothing huge, around 3 months in it was doing $1k/mo. I talked to my family about it and they were supportive of course but as you can imagine not super impressed. You know how it is.\n\nAnyway, I’ve been grinding for another 8 months now and have made some good product decisions, gotten feedback from customers, and shaped up my marketing. I don’t know what happened this summer but I got busy as heck and now I just closed August at $14k/mo. It’s kinda hitting me now that I’m actually making really good money and I haven’t told my family or anyone.\n\nI was waiting for this moment for months and now that it’s finally here I don’t know if it’s even time yet…\n\nShould I tell them? How much do you share with your friends and family?",
        "subreddit": "SaaS",
        "author": "felixheikka",
        "score": 379,
        "num_comments": 224,
        "created_utc": 1757413016.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ncf0ts/my_app_makes_14kmo_and_i_havent_told_my_family/",
        "fetched_at": "2025-09-10T00:53:03.860646"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 276,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-09-10T00:53:07.978901"
      },
      {
        "id": "1nc0fv8",
        "title": "META: How many people here have a *real* small biz? (think, traditional small biz. Not SaaS/AI/Crypto/etc)",
        "selftext": "Trying to figure out what percentage of the userbase here knows how what it's like to open the door to the shop and turn on the light each morning, fire up the coffee maker, and start doing \"business business\".   I'm not talking using AI to post slop to Reddit, or shilling a \"new business opportunity\" or whatever SaaS flavor of the week people are on to.  Just real, OG, Main Street businesses.",
        "subreddit": "smallbusiness",
        "author": "PDXSCARGuy",
        "score": 253,
        "num_comments": 435,
        "created_utc": 1757366889.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nc0fv8/meta_how_many_people_here_have_a_real_small_biz/",
        "fetched_at": "2025-09-10T00:53:06.743638"
      },
      {
        "id": "1nclgb9",
        "title": "What I learned chasing a flashy startup vs a boring business",
        "selftext": "When I was 27, I spent months on a “sexy” lifestyle brand. Looked good, made almost no money.\n\nAt 28, I pivoted to something boring (filters for a niche machine). By Year 2 it was doing \\~$400k revenue with 20% margins.\n\nWhat I learned:\n\nTrends fade, boring sticks.\n\nPainkillers > vitamins (solve problems people need fixed).\n\nDistribution compounds (email > social hype).\n\nIf others here had the same experience: Have you seen a “boring” business quietly outperform the flashy ones?",
        "subreddit": "Entrepreneur",
        "author": "emojidomain",
        "score": 156,
        "num_comments": 42,
        "created_utc": 1757430421.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nclgb9/what_i_learned_chasing_a_flashy_startup_vs_a/",
        "fetched_at": "2025-09-10T00:53:02.355569"
      },
      {
        "id": "1ncpncq",
        "title": "6 Years to Build, 6 Months to Collapse - My Rant",
        "selftext": "  \nWe opened our brick-and-mortar shop in Florida about six years ago with a simple idea: create a small slice of Europe here in the U.S. We hand-select unique goods from countries like Portugal, Spain, France and Italy, and we’ve worked hard to build a store that feels different, an experience, not just a shop.\n\nWith the exception of our first year, we’ve grown 10–13% year over year. We’ve spent countless hours curating products, learning international logistics, and figuring out how to import legally and efficiently. When we brought in containers, we paid all duties and taxes. For smaller shipments, the *de minimis* exception helped balance the books, letting us absorb the steep HTS rates on bigger imports. It wasn’t easy, but it's been working.\n\nOur plan was long-term,  keep building until 2028, then decide to either sell the business or lease it. Instead, in the past six months everything has started unraveling. With the new tariffs in place, invoices from DHL and UPS are suddenly showing 30–75% duties on the entire purchase cost.\n\nThat kind of increase isn’t just a line item, it’s a death sentence for businesses like ours. We don’t sell “needs,” we sell “wants.” Our shop is essentially an upscale gift store. Raise prices enough and customers simply stop buying. And with the economy already tightening and consumer spend way down the timing couldn’t be worse. We’ve just had the lowest sales months since opening.\n\nHere’s the bigger problem,  this isn’t just my shop. Thousands of small businesses like ours rely on imports to bring cultural, artisan, and specialty products to U.S. customers. These aren’t luxury yachts or mass-manufactured electronics. We’re talking about olive oil, ceramics, linens, crafts, wines, the things that connect communities here to cultures abroad. If these products become too expensive to import, entire categories of small retailers will vanish.\n\nMeanwhile, large corporations with global supply chains will find workarounds. They can eat losses, spread costs, and negotiate deals. But independents like us can’t. We built something that took six years to establish, and it feels like it could collapse in six months, not because of bad business decisions, but because of sweeping policy changes that don’t distinguish between Walmart and a family shop.\n\nI don’t even know how to sell a business whose entire model is now in jeopardy. If importing becomes impossible, the value of everything we’ve built goes to zero.\n\nFor all the talk of supporting small businesses, this is the reality. Policies like this don’t just hit countries on the other side of the tariff, they hit the small American businesses on Main Street even harder.",
        "subreddit": "smallbusiness",
        "author": "Capital_Bathroom_865",
        "score": 147,
        "num_comments": 85,
        "created_utc": 1757439853.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ncpncq/6_years_to_build_6_months_to_collapse_my_rant/",
        "fetched_at": "2025-09-10T00:53:06.743621"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 145,
        "num_comments": 174,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-10T00:53:07.978881"
      },
      {
        "id": "1ncurwp",
        "title": "Do you SEO folks actually think by blasting my inbox you are going to get my business?",
        "selftext": "Title says it all. Are you guys that stupid? When I clean out my Spam folder every morning I see over 50 BS SEO pitches. Do you really think I'm going to hire someone who relies on this BS to promote my business. You all have got to be morons. Rant over. ",
        "subreddit": "smallbusiness",
        "author": "JobobTexan",
        "score": 117,
        "num_comments": 71,
        "created_utc": 1757451096.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ncurwp/do_you_seo_folks_actually_think_by_blasting_my/",
        "fetched_at": "2025-09-10T00:53:06.743619"
      },
      {
        "id": "1nc8zvh",
        "title": "finally reached 10k mrr with my app, here's what worked and what didn't",
        "selftext": "i finally hit 10k mrr with one of my apps\n\nit only took 4 failed launches, dozens of dead end marketing experiments, and more late nights than i'd like to admit\n\nhere's what actually worked:\n\n* communities brought my first 200 users i joined niche facebook groups, answered questions, and dropped the app naturally into conversations direct promo posts got blocked by admins but comments worked well\n* lifetime deals gave me rankings offered early users a one time cheap plan spiked downloads, boosted aso, app now sits top 5 in its category that ranking alone pulls \\~200 new users per week without ads\n* tiktok slideshows brought scale i tested short form videos, memes, talking head clips, nothing really clicked then i switched to slideshow content across 9 themed accounts 3 iphones running full time (3 tiktok accounts per phone) → average 40k views a day per account → consistent signups initially i made the content manually, but that got unscalable fast so i looked into tools and ended up using reelmoney to automate most of the workflow, much cheaper than others i tried (faceless ninja, reel farm etc) and it just worked better for me, you must try all yourself to get your best\n* niche podcasts drove backlinks did 4 podcasts, each one brought a small bump in traffic but more importantly helped seo compounding over time\n\nwhat didn't work:\n\n* ugc content burned $7.5k, only one video passed 100k views, conversions were poor\n* facebook ads burned $5k, best roas was 1.2, not worth scaling\n* affiliate outreach to \\~50 youtubers, <10% replied, conversions close to zero\n\nthe lesson -> keep stacking experiments and scale your social media accounts\n\nmost won't work, but the few that do can carry everything\n\nthe more you post the more chances of one of your posts getting viral and even if no viral content you consistently keep getting views",
        "subreddit": "SaaS",
        "author": "Substantial_Hour_953",
        "score": 112,
        "num_comments": 74,
        "created_utc": 1757390329.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nc8zvh/finally_reached_10k_mrr_with_my_app_heres_what/",
        "fetched_at": "2025-09-10T00:53:03.860659"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 107,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-10T00:53:07.978885"
      }
    ]
  }
}