{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-08T00:59:49.430234"
  },
  "data": {
    "youtube": [
      {
        "videoId": "24TFLVCceiQ",
        "title": "The Only BOOKKEEPING Tutorial You Need 2025 | For Beginners",
        "description": "Bookkeeping for beginners (2025) explained in under a minute, then a complete step-by-step tutorial. This is a 2 hour free course ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2025-10-02T18:18:19Z",
        "url": "https://www.youtube.com/watch?v=24TFLVCceiQ",
        "fetched_at": "2025-12-08T00:59:40.959288"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-08T00:59:40.959253"
      },
      {
        "videoId": "q_UPVaJL5WA",
        "title": "The Truth About STARTING a Bookkeeping Business in 2025",
        "description": "Ready to pick one niche, get unstuck and get clients to ogrow your business faster? Grab the Profit Booster 1000 Niches PDF + ...",
        "channelTitle": "The Bookkeeping Shop",
        "publishedAt": "2025-05-14T17:30:24Z",
        "url": "https://www.youtube.com/watch?v=q_UPVaJL5WA",
        "fetched_at": "2025-12-08T00:59:40.959291"
      },
      {
        "videoId": "JEAkQLMxqtw",
        "title": "How to Set Up Your Books as a New Business Owner",
        "description": "Bookkeeping doesn't have to be scary—and getting it right from day one can save you major headaches down the road. In this ...",
        "channelTitle": "Mark J Kohler",
        "publishedAt": "2025-04-29T21:54:58Z",
        "url": "https://www.youtube.com/watch?v=JEAkQLMxqtw",
        "fetched_at": "2025-12-08T00:59:40.959281"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-12-08T00:59:40.959278"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-12-08T00:59:40.959271"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-08T00:59:40.534433"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-08T00:59:40.534462"
      },
      {
        "videoId": "LgOiQeYkuAA",
        "title": "How to Choose the Best Accountant for Your Small Business",
        "description": "Deciding to hire an accountant is a significant step forward for any business owner. But with so many options out there, how do ...",
        "channelTitle": "CSI Accounting",
        "publishedAt": "2024-03-21T17:50:03Z",
        "url": "https://www.youtube.com/watch?v=LgOiQeYkuAA",
        "fetched_at": "2025-12-08T00:59:40.959326"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-08T00:59:40.534446"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 487,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-08T00:59:48.429198"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 438,
        "num_comments": 125,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-08T00:59:48.429230"
      },
      {
        "id": "1pgd2jj",
        "title": "Began a human claw machine rental company at events - first-year performance and is this niche really profitable.",
        "selftext": "I purchased a human claw machine (large inflatable claw machine whereby an individual uses the claw and manipulates it to get prizes). It is one year on and now here is the business reality.\n\nFirst investment: equipment purchase: $3,500 on Alibaba (found manufacturer) compared to $6,000 or more on the US market (event suppliers), LLC/insurance formation: $500, and marketing resources: $300. Total: $4,300.\n\nFirst year income: 32 rentals at 300-500 dollars (according to the duration of the event and travel distance). Total revenue: $12,400.\n\nExpenses: \nInsurance cost: 800 a year, equipment maintenance cost: 200, fuel/travel cost: 600, storage cost: 0 (garage used) and marketing cost: 400. Total expenses: $2,000.\n\nNet profit year one: $10,400 less start up of 4300 = actual profit of 6100.\n\nMarket reality: It is a seasonal market (spring/summer heavy), the corporate events are better paying than birthday parties, repeat clients are hard to come by, marketing is an ongoing undertaking.\n\nLessons learned: Niche event equipment has reduced competition but reduced market. You are not making money but it is a good side business. Quality of equipment is an issue - malfunctions cost bookings.\n\nScaling potential: Has an opportunity to add additional unique equipment to provide package deals. A single-item rental business is not one that can grow without an expansion.\n\nIs it worth it? As a side business, yes. Although it is the prime income, most likely, not until you scale.",
        "subreddit": "smallbusiness",
        "author": "Ivexxe",
        "score": 199,
        "num_comments": 47,
        "created_utc": 1765094891.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pgd2jj/began_a_human_claw_machine_rental_company_at/",
        "fetched_at": "2025-12-08T00:59:46.637457"
      },
      {
        "id": "1pggfvy",
        "title": "Removed credit card requirement from trial signup. Signup up 340%. Conversion down 60%.",
        "selftext": "Had credit card required upfront for free trial. Conventional wisdom said this filters to serious buyers.\nSignups were low. 40-50 per month. Conversion to paid was 38%.\nRemoved the credit card requirement.\nMonth 1 results:\nSignups: 186 (up 340%)\nConversions to paid: 28 (15% conversion rate)\nNet new customers: 28 vs previous ~17\nMore customers in absolute terms. But the math gets complicated.\nWhat I noticed:\nSupport load exploded. Tire-kickers asking questions about things they'd never pay for.\nTrial abuse appeared. People creating multiple accounts to extend free usage forever.\nSales calls became less qualified. More \"just looking around\" conversations.\nThe 15% who converted were often lower-intent. Higher churn in first 90 days.\nWhat I tried next:\nCredit card required, but no charge for 14 days. Clear messaging \"you won't be charged until day 15.\"\nResults:\nSignups: 89 per month (down from 186, up from 40)\nConversion rate: 31%\nNet new customers: ~28\nSame absolute customers, but better quality. Lower support load. Less abuse.\nThe right answer depends on your product:\nHigh-touch, complex product? Credit card upfront. Filters to serious buyers.\nSimple, self-serve product? No credit card. Volume matters more.\nMiddle ground? Credit card required with very clear \"no charge until X\" messaging.\nThere's no universal best practice. Test both and measure net new paying customers, not just signup rates.\nWhat's your trial signup flow?",
        "subreddit": "SaaS",
        "author": "LogisticsLingo",
        "score": 186,
        "num_comments": 21,
        "created_utc": 1765107846.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pggfvy/removed_credit_card_requirement_from_trial_signup/",
        "fetched_at": "2025-12-08T00:59:43.344845"
      },
      {
        "id": "1pgd39e",
        "title": "Competitor dropped prices by 50%. I raised mine 20%. Won more deals.",
        "selftext": "Biggest competitor announced a massive price cut. 50% off across all plans.\nPanic mode. How could I compete?\nFirst reaction: match them. Race to the bottom.\nThen I thought about it:\nWhy would they cut prices? Probably struggling. Probably desperate for growth at any cost.\nWho does a price cut attract? Price-sensitive customers. High-churn segment.\nWhat does it signal? Lower value perception. If it's cheap, maybe it's not good.\nI did the opposite:\nRaised prices 20% for new customers.\nAdded more value at each tier (features from higher tiers pushed down).\nPositioned explicitly as the premium alternative.\nMessaging: \"Yes, we cost more. Here's why that's worth it.\"\nResults after 6 months:\nWin rate against that competitor: up from 31% to 44%\nAverage deal size: up 15%\nCustomer quality: higher NPS among new customers\nCompetitor's situation: layoffs announced 4 months later. Price cut was desperation.\nWhat I learned:\nCompeting on price is a race to the bottom.\nPrice signals quality. Cheaper doesn't mean better value.\nPrice-sensitive customers are usually not your best customers.\nWhen competitors go low, going high can work if you can justify it.\nThis doesn't always work:\nIf you can't articulate why you're worth more, don't raise prices.\nIf your product isn't actually better, price increases won't save you.\nIf the competitor is genuinely offering more value for less, you have a product problem.\nHow do you respond to competitor pricing changes?\n",
        "subreddit": "SaaS",
        "author": "Bulky-Economy-6746",
        "score": 109,
        "num_comments": 31,
        "created_utc": 1765094973.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pgd39e/competitor_dropped_prices_by_50_i_raised_mine_20/",
        "fetched_at": "2025-12-08T00:59:43.344850"
      },
      {
        "id": "1pg6kvd",
        "title": "Practice what you preach",
        "selftext": "I see SO many small business owners complain and whine online that more people need to support small yet I watch them order shirts from a mega corp online versus going to their local printer. \n\nI was told by a fellow small business owner that I was assisting in something to potentially work together and they said “I’m not loyal to anyone” and then I hear them complaining how hard it is at our local small business meetup. Needless to say I did not take the project. \n\nAnother in my area started a business (their 5th or 6th one) and they are using products we carry (we’re one of the only ones within 20 miles of them that carry this product) and did they get their product local? Nope. From a big box online. \n\nIt’s just so funny watching all the small business owners crying they should be shown more support but don’t even do so themselves. ",
        "subreddit": "smallbusiness",
        "author": "Excellent-Ad-6965",
        "score": 101,
        "num_comments": 38,
        "created_utc": 1765073332.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pg6kvd/practice_what_you_preach/",
        "fetched_at": "2025-12-08T00:59:46.637472"
      },
      {
        "id": "1pfamg6",
        "title": "Feeling behind in life after putting my R&D startup first from ages 25-36. I will not promote.",
        "selftext": "\nHi team,\n\nI’ve been working on my startup as a side hustle alongside my university educated day job for 10 years now. The R&D has certainly come a long way bootstrapping the whole time. I’ve been scared to take any investment because I knew that I could bootstrap that little bit longer and as a result give away less equity the further along I got it. But it’s come at a cost I didn’t think about 10 years ago, I’ve swapped gained equity for life time. \n\nI feel so behind compared to my friends and family members of similar age who are all marked with children. I had a relationship for 8 years of the startup’s life and 2 years ago it all got too much and we separated. She wanted to move forward and I just couldn’t commit to having kids before the R&D was earning revenue. When I first started the startup at 24 I thought ‘I’ll be a millionaire in a few years’. It’s not about the money specifically, it’s about the financial security of being able to do something I love rather than the day job that I don’t love. But here we are now I’m 36 and single and I feel ashamed going on dates and admitting that I don’t have a house or a nice car (which would normally be associated with my day job). I’ve attached the idea of success in the startup to my def worth as a person. Deep down I think I’ve had the belief that I need the startup to succeed in order to be loveable - even to those that admit they love me because I was/am under the illusion I need to be successful before anyone could see me and was/am too ashamed at my position relative to where I thought I would be. \n\nI should add: the startup is in the biology and material science field. It takes a long time to grow things but the IP developed along the way compounds, it’s a little different to a software startup. \n\nTL;DR: The R&D is certainly close to investment level and I can’t stop, I just feel behind, embarrassed and ashamed at where I am compared to where I thought I would be at this point in life. I’m sure so many of you can relate - I’d love to hear your experiences to just help me realise I’m not a loser or alone and that it’s all going to be ok. For anyone else who needs to hear this: you’re not alone, I’m right hear with you and I hope it’ll all work out for us. \n\nMy takeaway/what I've learnt: James Dyson has been a major role model for me. I've always wanted to operate like him and be successful without external funding but we're not all James Dyson and have a product as revolutionary as that. I am learning to accept that 100% of 0 is still 0. It's better to own part of a million/billion dollar company than to own all of a worthless company. Time to ask for help.",
        "subreddit": "startups",
        "author": "Neutron_glue",
        "score": 78,
        "num_comments": 38,
        "created_utc": 1764978682.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1pfamg6/feeling_behind_in_life_after_putting_my_rd/",
        "fetched_at": "2025-12-08T00:59:45.036187"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 75,
        "num_comments": 53,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-08T00:59:48.429252"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 61,
        "num_comments": 20,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-08T00:59:48.429225"
      },
      {
        "id": "1pglzua",
        "title": "VCs will HATE me for saying this.",
        "selftext": "VCs won’t love this, but it’s true: **most startups don’t need VC money.**\n\nLast month I met a founder doing **$2.5M ARR**, growing **18% month over month**, and already profitable.  \nInvestors offered him money. He said no.\n\nHis reason was simple:  \n**“Why give up 22% of my company for capital we’re not even using?”**\n\nAnd he’s right.\n\nHere’s the problem with VC math:\n\n* VCs need huge exits to make their fund returns work\n* That pushes every startup toward “unicorn or nothing”\n* Even if a $60M exit would change the founder’s life\n\nI’ve worked with many startups that raised money.  \nThe uncomfortable truth? **Most would’ve been better off without it.**\n\nHere’s a common story:\n\nA company raises $7M at a $28M valuation.  \nThey grow to $15M revenue and get a $55M acquisition offer.  \nThe founders want to sell.  \nThe board says no — the exit isn’t big enough for the fund.\n\nSo they push for more growth.  \nThe market shifts.  \nThe company burns out.  \nThe founders walk away with nothing.\n\nIf they had bootstrapped and kept 75%?  \nThat same $55M exit would’ve put **$41M** in their pocket.\n\nSmart founders in 2025 are thinking like this:\n\n* Bootstrap to $6M ARR → Sell for $60M → Keep \\~$48M vs.\n* Raise VC → Own 35% → Need a $140M exit to make the same amount\n\nAnd that’s assuming you even get the exit — **80% don’t.**\n\nVC only makes sense for a few types of companies:\n\n* Capital-heavy businesses (hardware, deeptech, biotech)\n* Winner-take-all markets\n* Founders aiming for a $10B+ outcome\n\nFor everyone else? Bootstrapping is often a better path.\n\nThe bootstrapped founders I’ve helped:\n\n* Answer to customers, not a board\n* Grow at a healthy pace\n* Take profit whenever they want\n* Actually sleep at night\n\nMost businesses need money — but not necessarily **venture** money.\n\nI’ve seen too many founders chase an exit that never comes, giving away more and more ownership along the way. Meanwhile, others quietly run $8M/year companies with full control and real freedom.\n\nBefore you start building a pitch deck, ask yourself:\n\n**“What am I trying to build — and is VC really the right path?”**\n\nPS: GPT Assisted but with own thoughts",
        "subreddit": "SaaS",
        "author": "Cool_Thought3153",
        "score": 58,
        "num_comments": 33,
        "created_utc": 1765123564.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pglzua/vcs_will_hate_me_for_saying_this/",
        "fetched_at": "2025-12-08T00:59:43.344848"
      }
    ]
  }
}