{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-02T08:16:48.569429"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-02T08:16:41.480797"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-02T08:16:41.213875"
      },
      {
        "videoId": "SSE2weHo_IE",
        "title": "10 Simple Video Production Workflow Tips and Tricks",
        "description": "10 simple video production tips and tricks to help you save time and do more with video. What I used or mentioned to produce ...",
        "channelTitle": "Kevin Kolbe",
        "publishedAt": "2023-11-16T14:30:35Z",
        "url": "https://www.youtube.com/watch?v=SSE2weHo_IE",
        "fetched_at": "2025-09-02T08:16:41.213883"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-02T08:16:41.213864"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-02T08:16:41.480793"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-02T08:16:41.480795"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-02T08:16:41.480799"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-02T08:16:41.213879"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-02T08:16:41.480782"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-02T08:16:41.213881"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 442,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-02T08:16:47.568095"
      },
      {
        "id": "1n5x0mk",
        "title": "This is your reminder not to quit.",
        "selftext": "",
        "subreddit": "SaaS",
        "author": "LevantMind",
        "score": 284,
        "num_comments": 22,
        "created_utc": 1756752162.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n5x0mk/this_is_your_reminder_not_to_quit/",
        "fetched_at": "2025-09-02T08:16:43.451446"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 274,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-09-02T08:16:47.568149"
      },
      {
        "id": "1n5jv8o",
        "title": "Why I left a high-paying AI engineer job to become a broke founder",
        "selftext": "I had a stable job, a great salary, good perks, and health insurance. Even the office coffee was great. I got to talk to some big clients, understand their problems, and build solutions.\n\nI could eat at fancy restaurants every week, buy whatever tech I wanted, and travel with my friends. It was all great.\n\nBut something was missing.\n\nEvery time I opened my laptop, took a call, or even went for a snack, I felt like I didn't belong there. Why? I'm not sure, but this wasn't work I could see myself doing for the next 40 years.\n\nI always wanted to build value, something that would be associated with me. Something that would make me feel competent and good about myself.\n\nSo I took the hard call and pulled the plug. I resigned and started working on my startup full-time.\n\nFrom being an MLE who didn't know jack sh\\*t about prod-dev, to deploying 3 full-stack AI products - I've learned a lot.\n\nI'm still not successful by any means. All 3 products failed. I still have a ton of stress. Anxiety is still my friend. And I've made absolutely **ZERO DOLLARS** along the way.\n\nBut hey, I happily work 7 days a week and don't hate turning on my laptop every morning.",
        "subreddit": "Entrepreneur",
        "author": "loopingrascal",
        "score": 215,
        "num_comments": 154,
        "created_utc": 1756717801.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n5jv8o/why_i_left_a_highpaying_ai_engineer_job_to_become/",
        "fetched_at": "2025-09-02T08:16:41.992953"
      },
      {
        "id": "1n5wa9p",
        "title": "Does anyone else feel guilty taking a day off?",
        "selftext": "I keep telling myself breaks are important but every time i actually take one i just feel guilty like if i’m not working then i’m slipping behind while everyone else is pushing forward. Sometimes i know i need a day off just to take care of myself play a little football, read, go for a walk even just sit around but even then i feel restless like i’m wasting time instead of recharging the problem is if i don’t take breaks i burn out quick but when i do take them i feel lazy. kinda feels like i can’t win either way. Does anyone else deal with this or how do you actually rest without feeling like you’re losing ground?",
        "subreddit": "Entrepreneur",
        "author": "spinusrose",
        "score": 148,
        "num_comments": 55,
        "created_utc": 1756750560.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n5wa9p/does_anyone_else_feel_guilty_taking_a_day_off/",
        "fetched_at": "2025-09-02T08:16:41.992944"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 147,
        "num_comments": 173,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-02T08:16:47.568130"
      },
      {
        "id": "1n5ly6o",
        "title": "Time for self-promotion. What are you building?",
        "selftext": "Use this format:\n\n1. SaaS Name - What it does\n2. ICP (Ideal Customer Profile) - Who are they\n\nI'll go first:\n\n1. [**Shipper.now**](https://app.shipper.now/?utm_source=reddit&utm_medium=post&utm_campaign=sept1_selfpromo) \\- AI that builds fullstack apps from 1 prompt\n2. ICP - SaaS Beginners, Entrepreneurs, No-Coders, Devs\n\nGo...go...go...\n\nPS: Upvote this post so other makers or buyers can see it.   \n*Who knows someone reading this might check out your SaaS :)*",
        "subreddit": "SaaS",
        "author": "chdavidd",
        "score": 114,
        "num_comments": 297,
        "created_utc": 1756725316.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n5ly6o/time_for_selfpromotion_what_are_you_building/",
        "fetched_at": "2025-09-02T08:16:43.451478"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 108,
        "num_comments": 54,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-02T08:16:47.568134"
      },
      {
        "id": "1n5xz4t",
        "title": "Washer and Dryer Rental Business",
        "selftext": "Started a washer and dryer rental business 3 weeks ago and have already locked in 12 clients. I saw this business on youtube which a young 24yo kid started it a year and a half ago and he's making 10k a month doing it and he mentioned he only works 5 hours a week on service calls and repairs. The business to me was genius because there are many people out there who either cant afford the full amount for a washer and dryer or they are only leasing a place for a year and don't want to commit to buy their appliances. It's also a good sell to people who have the space for washers and dryers and are tired of going to the laundromat. All service and repairs included in the rental so stress free for the client. Just wanted to share and lets see how fast i can grow this. Will continue to share updates every month. ",
        "subreddit": "smallbusiness",
        "author": "Competitive-Excuse43",
        "score": 91,
        "num_comments": 76,
        "created_utc": 1756754286.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n5xz4t/washer_and_dryer_rental_business/",
        "fetched_at": "2025-09-02T08:16:46.288114"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 91,
        "num_comments": 57,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-02T08:16:47.568113"
      }
    ]
  }
}