{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-26T16:13:04.910725"
  },
  "data": {
    "youtube": [
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-26T16:12:55.911342"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-10-26T16:12:55.530803"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-26T16:12:55.530793"
      },
      {
        "videoId": "itpCtsopKTI",
        "title": "Bookkeeping Basics for Small Business Owners (free template!)",
        "description": "Start using Melio for FREE at https://go.melio.com/gillian You can download the Google Sheets template I'm using in this video ...",
        "channelTitle": "Gillian Perkins",
        "publishedAt": "2023-08-01T15:00:40Z",
        "url": "https://www.youtube.com/watch?v=itpCtsopKTI",
        "fetched_at": "2025-10-26T16:12:55.911340"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-26T16:12:55.530775"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-26T16:12:55.911337"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-10-26T16:12:55.911339"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-26T16:12:55.530797"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-26T16:12:55.911326"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-26T16:12:55.530800"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 467,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-26T16:13:03.909299"
      },
      {
        "id": "1oex6aw",
        "title": "[True Story] Non-technical founder tried to sell a 100% AI-generated MVP to a bank - I will not promote",
        "selftext": "Got a call yesterday from someone in my network. Fintech founder, zero technical background. Says she got hacked. As she tells me the story, I can't believe the chain of events.\n\nStarted like many do now: lovable, v0, cursor. Generating screens, connecting APIs. Great for validation at first. Problem is, she kept going. MONTHS wrestling with prompts until she had a monster with:\n\n* Credit scoring\n* AI agents\n* Dashboards\n* Reports\n* And many more\n\nAll prompt-generated. Zero understanding of the code. Shows it to a BANK. They like it. Tell her to move forward (she had a great business network btw). No idea what to do. Hires a team to \"refactor\". Quote: 300+ hours. Basically the cost of building a proper MVP from scratch.\n\nBut wait, it gets better.\n\nThe team she hired ALSO does vibe coding. They set up the server by asking ChatGPT. Result:\n\n* SSH open to the world\n* Root password: admin123 (or something similar)\n* No firewall\n* Nothing\n\nAutomated ransomware encrypted everything. Had to shut down, rotate all API keys (costing $$$), migrate everything.\n\nThe founder lost money on the hack, so much time, credibility with the client and trust in the process.\n\nHere's the thing: Would you send a contract to a client without reading it, just because AI wrote it? Would you send an investor pitch without knowing what it says? Of course not. So why would you run your entire technical infrastructure on code you can't read?\n\nAI amplifies what you already know. If you understand business, AI makes you better at business. If you know code, AI makes you code 10x faster. But if you know nothing about code and try to build a tech product with just prompts, you're not in control of your own company.\n\nThe new reality post-AI: You don't need 10 developers anymore. You need 1-3 people who REALLY know their domain, amplified by AI. That's more powerful than 20 people without AI.\n\nThat's what vibe coding in production is: unsupervised juniors all the way down.",
        "subreddit": "startups",
        "author": "micupa",
        "score": 281,
        "num_comments": 130,
        "created_utc": 1761311004.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oex6aw/true_story_nontechnical_founder_tried_to_sell_a/",
        "fetched_at": "2025-10-26T16:13:00.433115"
      },
      {
        "id": "1ogaagi",
        "title": "Ex girlfriend writing fake review on my google business page",
        "selftext": "just as the title states, my ex girlfriend is writing fake reviews on my google page because we broke up and I found another woman. in her google review she states that I gave her an STD and that I cheated on her with a prostitute... none of this is true or has anything to do with my business. How can I get this removed or should I sue for defamation of character?  ",
        "subreddit": "smallbusiness",
        "author": "SpirtualMar",
        "score": 181,
        "num_comments": 67,
        "created_utc": 1761448673.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ogaagi/ex_girlfriend_writing_fake_review_on_my_google/",
        "fetched_at": "2025-10-26T16:13:02.050331"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 179,
        "num_comments": 50,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-26T16:13:03.909366"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 178,
        "num_comments": 129,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-26T16:13:03.909317"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 171,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-26T16:13:03.909360"
      },
      {
        "id": "1ofxs6n",
        "title": "You will never make money as a \"founder\" in 2025",
        "selftext": "I've been watching the founder ecosystem explode over the past year, and there's something fascinating happening.\n\nWe now have more \"founders\" than ever. LinkedIn is drowning in them. Twitter is full of \"building in public\" threads. But here's what's strange: actual product launches haven't increased proportionally. Neither have real SaaS companies reaching profitability.\n\nWhat we *have* seen is an explosion of:\n\n* Productivity tools for founders\n* Communities for founders\n* Courses teaching founders\n* Newsletters about founding\n* Tools to help founders build tools\n\nThe picks-and-shovels game has never been better. Why? Because the identity of \"founder\" has become more appealing than the reality of building a product. It's easier to buy a course about validating ideas than to actually talk to 50 potential customers. It's more comfortable to join a community than to write cold emails.\n\nThis isn't criticism, it's market observation. If you're actually building something real, you're now competing in a space where most \"competitors\" are just role-playing. And if you're selling tools to founders, you've found a market that's growing faster than the actual problems they're meant to solve.\n\nThe question is: which side of this do you want to be on?",
        "subreddit": "Entrepreneur",
        "author": "AdChemical5412",
        "score": 161,
        "num_comments": 85,
        "created_utc": 1761414310.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ofxs6n/you_will_never_make_money_as_a_founder_in_2025/",
        "fetched_at": "2025-10-26T16:12:56.620708"
      },
      {
        "id": "1of7sf0",
        "title": "VCs won't tell you this but half of founders are burnt out right now. ( I will not promote )",
        "selftext": "Your investors don't care about this. They want your growth metrics. They don't want to know you stopped caring about the thing you built.\n\nHalf of all founders go through burnout. Half. But VCs never mention it. They talk about hustle and scaling fast. They don't talk about what happens when your brain actually breaks down\n\nHere's what they won't tell you. You'll lose passion for your startup even though you love the idea. You'll make stupid decisions because you're exhausted. You'll get angry at your team for no reason. You'll think everyone would be better without you running this.\n\nSleep won't help. Eight hours feels like nothing. Your body is just broken from the stress.\n\nYou'll isolate because it feels easier than pretending everything's fine. Simple decisions become impossible. You'll second guess yourself constantly even though you're supposed to be the confident founder.\n\nAnd the worst part is you keep pushing harder because stopping feels like admitting defeat. That's the trap VCs want you in. Keep grinding. Keep sacrificing. Keep ignoring the warning signs.\n\nNobody calculates the cost of burned out founders making bad decisions. They just care about the next funding round.\n\nThat's what VCs won't tell you.\n\nThis is just a serious post, people may agree or not. but this can be true with more than 60% Co-founders.",
        "subreddit": "startups",
        "author": "ksundaram",
        "score": 129,
        "num_comments": 61,
        "created_utc": 1761335938.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1of7sf0/vcs_wont_tell_you_this_but_half_of_founders_are/",
        "fetched_at": "2025-10-26T16:13:00.433111"
      },
      {
        "id": "1og475w",
        "title": "Dear founders,",
        "selftext": "A lot of you are struggling to create SaaS products on your own and with how to market them. Frankly, you're increasing my workload and forcing me to kick people out of my successful SaaS product more than ever thanks to AI empowering you to ship more and faster than ever before. So let's talk for a minute, shall we?\n\nThis post was not written by, approved by, or altered by AI. In fact, it was written over an extended period of time in which I was playing with my kids, taking a shower, and some of it even while I was on the toilet. But you're still going to listen to me because I have a SaaS product performing at sustained $1M ARR and you want to know my secret. You're not going to like it, but you are going to learn from it.\n\nOver and over again I see you guys waxing poetic about how to market your product, how to get your first paying customer, etc. You all have these lofty ideas about how you're going to achieve a 0.4% conversion rate from scraping LinkedIn profiles and sending spam, sorry... \"Cold email,\" to all of my customers. Stop it.\n\nYou are doing everything wrong. From start to finish. I'm not saying that these tactics have never worked, but the more of you there are doing it the less it works for all of you. So maybe, just maybe, you need to be different. I'm going to tell you how to do that.\n\nHere's what you need to know:\n\nIf you have to ask how to market your product, you've already failed. Again, I'm not saying that you can't succeed, but you are at a disadvantage already. This is what you should do or should have done:\n\n1: Identify a problem that you or someone you know is having.\n\n2: Create for yourself, with the person you know if need be, an environment where you can experience the problem first hand. Live their frustrations.\n\n3: Find other people who are talking about that problem. A message board. A subreddit. A newsgroup for all I care. Hell, a town hall if that's your thing.\n\n4: Test the ways that other people are dealing with the problem. Test ALL of them first hand. Reach the point where you no longer need to ask people what the pain points are.\n\n5: Join the conversation as a peer, NOT a marketer, NOT as someone performing market research. A genuine PEER to these people. If you cannot find a conversation to join, the product doesn't need to be made. Quit and start over.\n\n6: Begin product work HERE. If you didn't do 1-5, you are not qualified to build a product for these people.\n\n7: If you didn't before, thoroughly read the rules of the community you've joined. Fully comply with them at all times, because this is where it gets fun. \n\n8: By whatever means is appropriate by the rules of the community and after reading the room, recruit a few people experiencing the problem to test your product. Their feedback now means more to you than anyone who comes after launch. These people are going to be your customers for a very long time.\n\n9: Create a community. A forum, a Discord server, whatever. Invite these people and encourage them to invite others. Make sure everyone who joins this community later knows that those first few are your people. Make them moderators, give them special tags, whatever you need to do. This should be genuine because you actually appreciate them, this is not another checklist item. This is personal. \n\n10: Launch. You already know who to talk to and where to market your product. If you have to ask how to find people who need your product, you failed 1-9.\n\nThe rest is up to you. This is your baby. Own it. But stop signing up for MXroute to send your \"cold emails.\" I'd prefer if you stopped sending them altogether. Because I am watching, and I am blocking all of you who do it on behalf of my customers.",
        "subreddit": "SaaS",
        "author": "mxroute",
        "score": 98,
        "num_comments": 14,
        "created_utc": 1761430383.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1og475w/dear_founders/",
        "fetched_at": "2025-10-26T16:12:58.756072"
      },
      {
        "id": "1ogejl1",
        "title": "Your per-user pricing is killing your product.",
        "selftext": "I’ve been building MVPs for founders for many years now. I come in, build the core product, get it into the hands of the first users, and then I usually stick around to see what happens.\n\nAnd I see the same mistake, over and over, that quietly strangles promising products right after they start getting traction.\n\nIt’s the pricing. Specifically, the default, lazy decision to charge per user.\n\nHere's the pattern I see play out. I'll build a slick collaboration tool for a founder. They sell it to a company. A team of five starts using it, and they absolutely love it. The tool works so well that they become hyper-efficient and don't need to hire more people.\n\nFrom a product development standpoint, that's a massive win. I just built something that made a team better at their jobs. But for the founder? They just got punished for having a great product. The potential to grow that account is now capped.\n\nIt gets worse. The team's manager, the champion of my work, goes to another department and tells them they have to start using this tool. But the first question from the other department head is, \"What's the cost per seat?\" Adding another 15 users creates a budget discussion, and the idea dies right there.\n\nThe product I built is now stuck in a silo, all because the pricing model makes it hard to share. I've literally watched my work get quarantined inside a business because of a pricing decision made in the first month.\n\nLast year, I built a project management tool for a client. We launched it, and it was beautiful. So effective that teams using it were getting more done with fewer people. Six months later, the founder calls me, frustrated that revenue has completely flatlined.\n\nWe dug into the usage data together. The real value wasn't the number of people logging in. It was the number of active projects being managed.\n\nI spent a weekend rewriting the billing logic to be based on project volume, with unlimited users. It wasn't a huge technical challenge. But the business impact was immediate. Revenue jumped 40% in six months because the cost was now tied to the value they were getting. And since adding users was free, the tool spread like wildfire inside their customer accounts.\n\nI'm a developer. My job is to build things people want to use. It just feels fundamentally wrong to then implement a business model that punishes them for using it too much.\n\nMaybe I'm missing something, but why is per-user pricing still the default? Is it just the easiest thing to code? I’m curious what other devs and founders have seen work better.\n\n",
        "subreddit": "SaaS",
        "author": "Warm-Reaction-456",
        "score": 86,
        "num_comments": 27,
        "created_utc": 1761464088.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ogejl1/your_peruser_pricing_is_killing_your_product/",
        "fetched_at": "2025-10-26T16:12:58.756068"
      }
    ]
  }
}