{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-14T08:13:26.332882"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-14T08:13:19.458017"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-14T08:13:19.161074"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-14T08:13:19.161066"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-14T08:13:19.161056"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-14T08:13:19.458014"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-14T08:13:19.458019"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-14T08:13:19.458021"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-14T08:13:19.161070"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-14T08:13:19.458002"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-14T08:13:19.161072"
      }
    ],
    "reddit": [
      {
        "id": "1nf2lmr",
        "title": "senior quit a high paying job to sell pizza. not kidding.",
        "selftext": "one of my seniors at masters union got a fat offer during mba placements. everyone thought he was set for life.\n\nbut he kept saying, “if i take this, i’ll regret never trying.” so he rejected the job. started a tiny pizza brand instead name woodys pizzeria. at first we thought he was nuts.\n\nnow? his pizzas have a waitlist every weekend and competed with good stores in delhi, IN.\n\ni am always scared on the \"what if it doesn't work\" and idk why job safety appeals more to me. how do you get out of that mindsight?",
        "subreddit": "Entrepreneur",
        "author": "Alternative-Food-372",
        "score": 2716,
        "num_comments": 200,
        "created_utc": 1757682035.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nf2lmr/senior_quit_a_high_paying_job_to_sell_pizza_not/",
        "fetched_at": "2025-09-14T08:13:19.899750"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 453,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-14T08:13:25.331505"
      },
      {
        "id": "1nge0dc",
        "title": "How the hell did a guy selling sponges overseas end up making 7 figures?",
        "selftext": "I swear I’m still processing this. I was sitting at a cafe chatting with this older dude and he tells me he runs a cleaning supplies business. I’m thinking okay boring but respectable.\n\nThen he casually drops that 90 percent of his revenue isn’t even local. It’s from selling sponges gloves and mops overseas. And not just a little. We’re talking 7 figures a year. Off cleaning supplies.\n\nMeanwhile I’ve been breaking my back trying to compete in my crowded local market stressing over ads margins and standing out. And this guy’s over here quietly crushing it with something everyone overlooks.\n\nIt honestly flipped my perspective. Maybe the real opportunity isn’t grinding in the same oversaturated local market as everyone else but finding buyers in places that actually need what you’re selling.\n\nSo now I’m curious. Has anyone here actually broken into international markets early, was it a nightmare or surprisingly doable once you figured out where to look?",
        "subreddit": "Entrepreneur",
        "author": "Deeceness",
        "score": 357,
        "num_comments": 105,
        "created_utc": 1757812032.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nge0dc/how_the_hell_did_a_guy_selling_sponges_overseas/",
        "fetched_at": "2025-09-14T08:13:19.899712"
      },
      {
        "id": "1nfds5x",
        "title": "I stopped chasing the next big thing and finally made money",
        "selftext": "I used to spend months dreaming up “the big idea.”  \nApps, marketplaces, wild startup concepts, none of them went anywhere.\n\nOne day, I said screw it and offered a simple app to quit porn addiction named Unlust\n\nI’ve made more in the last 3 months doing that than I did in 2 years chasing unicorns.  \nIf you're stuck, maybe it’s not that your idea isn’t good; it’s just not needed.\n\nSolve something boring. People will pay you.",
        "subreddit": "smallbusiness",
        "author": "Kind_Guide_1232",
        "score": 324,
        "num_comments": 49,
        "created_utc": 1757708568.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nfds5x/i_stopped_chasing_the_next_big_thing_and_finally/",
        "fetched_at": "2025-09-14T08:13:24.053865"
      },
      {
        "id": "1ng0zyu",
        "title": "Working 100 hours a week isn’t entrepreneurship. It’s wage slavery with no boss.",
        "selftext": "If it dies when you take a day off, it’s not a business. ",
        "subreddit": "Entrepreneur",
        "author": "Dre_Limitless",
        "score": 254,
        "num_comments": 94,
        "created_utc": 1757778823.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ng0zyu/working_100_hours_a_week_isnt_entrepreneurship/",
        "fetched_at": "2025-09-14T08:13:19.899716"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 145,
        "num_comments": 175,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-14T08:13:25.331551"
      },
      {
        "id": "1nfylfq",
        "title": "I MADE $20K ON MY SAAS WITH A SINGLE IG REEL",
        "selftext": "No, I’m not kidding. Yes, I’m giving you the exact framework to replicate this.\n-I posted a reel with a super simple CTA: “Comment … and I’ll send you a free resource with all the links.”\n-People started commenting, my agent instantly replied with an automatic DM: “I’ll send it over right away, just hit follow to unlock.”\n-Once they followed, my agent asked for their email (all happening directly in the IG DMs).\n-That email automatically synced into my Email Marketing tool and entered my workflows redirected to my Saas!\n\nHere are the numbers:\nFrom 5.7M views > 12.1K comments > 8.7K emails > 90 paying clients.\nRevenue from a single post: $19K. (~200$ each) \n\nWhy is this so effective?\n\nBecause the freebie feels genuinely valuable, so people are motivated to act. Plus, educational content positions you as an authority in your niche. In my case, I sell services for job seekers, and the freebie was a guide on the best free finance courses. But honestly, the model works in any industry.\n\nThis is hands down the strongest lead-gen hack of 2025 but it only works if you’ve got a sales funnel in place to nurture, qualify, and close those leads.\n\nI can share the editable automation with anyone interested, total free, dme or drop a comment\n\nAt first it took some effort to set up but once you see how the structure works it’s easy.",
        "subreddit": "SaaS",
        "author": "Sufficient_Talk_1441",
        "score": 138,
        "num_comments": 89,
        "created_utc": 1757772973.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nfylfq/i_made_20k_on_my_saas_with_a_single_ig_reel/",
        "fetched_at": "2025-09-14T08:13:21.282197"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 113,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-14T08:13:25.331555"
      },
      {
        "id": "1nfx0jr",
        "title": "What 30k Free Users Taught Me About Charging $10/Month",
        "selftext": "Two years ago we decided to test an idea.\n\nWhat if we built a small native Trello power-up — simple, clean, and entirely dependent on the marketplace? Could it turn into a small business? Could it be a model for side projects?\n\nIt took off fast. 30,000+ installs, thousands of daily users, and today—over 500 paying customers.\n\nSounds good, right? Not really.\n\nOn the bright side — Trello is a fair ecosystem. Even small developers get discovered. No downranking, no hidden boost for “big players.” Clean UI guidelines, seamless integration, no middlemen, no 30% commission. Just connect Stripe and go. A perfect playground for a polished mini-product.\n\nBut then reality set in.\n\nWe priced it simply: $10 per workspace. Flat. Unlimited people, unlimited projects.\n\nSounds fair? Turns out even $10/month was a huge barrier.\n\nWhen it was free, growth was fast and constant. Teams used us daily for months, sometimes a year, leaving feedback and spreading love. But the moment billing kicked in, many vanished overnight. Even companies with 30+ users preferred something clunky and unsupported over paying the cost of 2–3 cappuccinos.\n\nHere’s the thing: for us, it’s hard to stay motivated supporting free users—especially if you’re bootstrapped.\n\nPaying customers energize you. Free users don’t.\n\nToday the project have 500 paying customers, and we’re happy to support them. The power-up pays for itself. It was always an experiment. And the gap between expectations and reality is what made it valuable.\n\nMy biggest lesson? Charge early.\n\nOnce people get used to “free,” that becomes the baseline. Asking for money later feels like betrayal. It’s paradoxically easier to charge upfront (after a short trial) than after a year of free use.\n\nSo, can a trello power-up be a real business?\n\nYes — if by business you mean a side project that sustains itself, serves a few hundred happy customers, and brings in some cash. But not if you expect it to become a standalone SaaS company.\n\nAnd that’s okay. Sometimes the biggest win isn’t revenue — it’s the lessons.\n\nHave you faced the same wall with free users? How did you handle it? Share your experience—I’d love to compare notes.",
        "subreddit": "SaaS",
        "author": "evermike",
        "score": 103,
        "num_comments": 51,
        "created_utc": 1757768719.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nfx0jr/what_30k_free_users_taught_me_about_charging/",
        "fetched_at": "2025-09-14T08:13:21.282199"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 97,
        "num_comments": 58,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-14T08:13:25.331538"
      }
    ]
  }
}