{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-29T08:20:33.792358"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-29T08:20:24.139891"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-12-29T08:20:24.139889"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-29T08:20:23.884898"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-29T08:20:23.884911"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2025-12-29T08:20:24.139894"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-29T08:20:23.884909"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-29T08:20:24.139886"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-12-29T08:20:23.884915"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-29T08:20:24.139874"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-29T08:20:23.884913"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 495,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-29T08:20:32.790985"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 442,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-29T08:20:32.791034"
      },
      {
        "id": "1pxjnn7",
        "title": "With Target and other retailers losing a large % to theft, why isn't the Argos model more popular in the US",
        "selftext": "Argos is a catalogue store in the UK\n\nBasically a big warehouse at the back of the store that is for staff. You order from a catalogue and pay and the staff bring it out to you. I would think this would remedy people stealing. Why isn't there stores like this in the US?",
        "subreddit": "Entrepreneur",
        "author": "Singer9999",
        "score": 229,
        "num_comments": 184,
        "created_utc": 1766900837.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pxjnn7/with_target_and_other_retailers_losing_a_large_to/",
        "fetched_at": "2025-12-29T08:20:26.078486"
      },
      {
        "id": "1py39uv",
        "title": "Competitor went out of business. Inherited 200+ of their customers. It wasn't the windfall I expected.",
        "selftext": "Got an email from a competitor saying they were shutting down. Included a message to their customers recommending us as an alternative. This was the dream right? Free customers. No acquisition cost. Just show up and collect.\n\nAbout 230 of them migrated over. Revenue jumped overnight. I was celebrating.\n\nThen the support tickets started.\n\nThese customers had been using a different product with different workflows. They didn't want to learn our way. They wanted us to work like the old thing worked. Every ticket was basically \"this isn't how I used to do it.\"\n\nFeature requests flooded in. Things the competitor had that we didn't. Things I'd never build because they didn't fit our vision. But these customers expected them. They'd paid for them before.\n\nThe churn started at month three. About 40% of them left within six months. They'd tried to make us work, couldn't adjust, and gave up.\n\nThe ones who stayed are actually good customers now. But the math wasn't what I thought.\n\nExpected: 230 new customers at $89/month = $20,470/month added\n\nReality: about 85 stayed long-term = $7,565/month added\n\nSupport cost during migration: probably ate half of that in the first year.\n\nStill a net positive. But not the windfall I expected. Inherited customers come with inherited expectations. And those expectations are expensive to disappoint or expensive to meet.\n\nFree customers aren't actually free.\n\nHas anyone else inherited customers from a dying competitor?",
        "subreddit": "SaaS",
        "author": "Crazy-Recording4800",
        "score": 166,
        "num_comments": 33,
        "created_utc": 1766957859.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1py39uv/competitor_went_out_of_business_inherited_200_of/",
        "fetched_at": "2025-12-29T08:20:27.894731"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 164,
        "num_comments": 41,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2025-12-29T08:20:32.791012"
      },
      {
        "id": "1pybmle",
        "title": "Lost my company after 10 years. Client used our software for 3 years, refused to sign off, and the court sided with them. Is this normal in your country?",
        "selftext": "I’ve been an entrepreneur since 2014. In 2015, I started a software company with my college friends. Fast forward to 2025, and we are bankrupt.\n\nHere is the nightmare: A large State-Owned Enterprise (SOE) in China owes us a significant amount of money. They used the software we built for nearly 3 years. When they refused to pay the remaining balance, I took them to court in their local jurisdiction.\n\nI fought this legal battle for a year. Last week, the final verdict came out: I lost. The court dismissed my claims because the client never provided a formal \"Acceptance Certificate\" (a document required to prove the project is finished). Essentially, they used the software for years but refused to sign the paper saying it was \"done,\" so they didn't have to pay.\n\nNow I am buried in debt and feel completely hopeless. I’m angry and at a loss for words.\n\nI genuinely want to know: Does this happen in other countries? If a client uses your work for 2.5+ years but refuses to sign the acceptance paperwork, does the law let them get away with it? Where is the justice?",
        "subreddit": "smallbusiness",
        "author": "DevCargo",
        "score": 161,
        "num_comments": 97,
        "created_utc": 1766979779.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pybmle/lost_my_company_after_10_years_client_used_our/",
        "fetched_at": "2025-12-29T08:20:30.989887"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 151,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2025-12-29T08:20:32.791010"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 90,
        "num_comments": 37,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2025-12-29T08:20:32.791008"
      },
      {
        "id": "1pxp8fv",
        "title": "SEO tactics that actually work for SaaS",
        "selftext": "Yo.\n\nJust to get things straight right away: this post isn't BS.\n\nSEO is in a terrible state these days. Experts share contradictory advice, agencies try to make SEO very complex so they can charge more. And AI search makes it even more blurry as people claim GEO is completely different from SEO when in reality there's like a 80% overlap between SEO & whatever you call the new \"AI SEO\".\n\nSo this is a **curated** list. What doesn't work isn't listed here.\n\nIf you do just the first 2 and you weren’t doing it before, I guarantee you'll get +6-10 positions for the associated pages on Google depending on your niche.\n\nI know this works because I ran experiments on 4 different websites I own and I helped about 30 different websites implement these strategies.\n\nHere you go:\n\n**1. Refresh old content (easiest win)**\n\nGo to Google Search Console. Find posts ranking positions 8-20. These are *so close* to getting traffic but invisible on page 2.\n\nUpdate them: add a new section, fix outdated stats, improve the intro. Then update the published date.\n\nI've seen posts jump 10+ positions within weeks. Lowest hanging fruit in SEO.\n\n**2. Add authors to your blog posts**\n\nGoogle's E-E-A-T framework cares about *who* wrote your content. Add a visible author with a short bio, and **a link to LinkedIn/X**.\n\nEvery time I apply this to a site that wasn't doing it, posts climb 4-8 positions within 2 weeks. Stupid easy.\n\n**3. Integration marketplaces = free high-authority backlinks**\n\nYou're building a SaaS? Then it's very likely you'll want to build an integration with another platform at some point. Get listed on their marketplace: it's free DA 90+ backlink.\n\nHubSpot App Marketplace, Zapier, WordPress plugin directory, Chrome Extensions web store. These listings also drive actual users, not just SEO juice.\n\n**4. Exact domain match still works**\n\nIf you haven't started your venture, you can get a huge SEO boost on a specific keyword if your domain & brand matches it exactly.\n\nGoogle nerfed this years ago, but it still helps when combined with quality content. If you haven't bought your domain yet, spend an extra hour finding one with your primary keyword in it.\n\n**5. Build a free tool**\n\nCalculator, checker, generator - doesn't matter. People love linking to useful resources. One weekend project can earn you backlinks for years.\n\nI built a simple [Domain Rating checker](https://blogseo.io/tools/dr-checker). It takes seconds to use, costs me almost nothing to run, and it gets linked a lot on social media.\n\n**6. Fresh, regular content**\n\nGoogle rewards sites that publish consistently. It signals your site is active and worth crawling frequently. Each article = new entry point from search.\n\n**7. Find keyword gaps**\n\nEveryone tells you to copy competitors. But the real opportunity is what they're *not* doing.\n\nFind terms competitors aren't targeting well. One overlooked keyword with decent volume can become your traffic goldmine while everyone else fights over high-competition terms.\n\nI've seen single well-chosen keywords bring 80% of total traffic on niche sites.\n\n**8. NAP consistency**\n\nYour brand name, URL, and social links should be identical everywhere: Google Business Profile, LinkedIn, Crunchbase, X, directories.\n\nWhen Google sees the same info repeated across trusted sources, it builds confidence you're legitimate. Inconsistencies create doubt.\n\n**9. Curated directories only**\n\nIf it's free and anyone can post, don't expect much. Generic directories are worthless.\n\nWhat works for SaaS: Product Hunt, G2, Capterra, \"There's an AI for That\", places that actually vet submissions or require payment.\n\n**10. Programmatic SEO**\n\nOne template + structured data = thousands of pages targeting long-tail keywords.\n\nClassic example: Zapier's integration pages. But you need a decent backlink profile first, or these pages won't rank.\n\n**11. FAQ sections**\n\nFAQs let you target long-tail keywords and qualify for rich snippets. More SERP real estate = higher CTR.\n\nEven more important now with AI search. When AI fans out your query into sub-queries, FAQ content formatted as Q&A is exactly what they're looking for.\n\n**12. Backlinks outreach**\n\nCold outreach still works:\n\n- Guest posting (you provide content, they get a backlink)\n- Broken link replacement (find broken links on relevant sites, suggest your content)\n- Unlinked mentions (find articles mentioning you without linking, ask for the link)\n\nIt's time consuming. But it works. The only downside to traditional link exchanges is that when scaled, reciprocal links can look suspicious to Google. Site A links to B, B links back to A. Google knows it's a trade.\n\nIf you want to automate link building, I built an ABC backlink exchange into [BlogSEO](https://blogseo.io/). Users get matched with sites in similar niches and the system inserts contextual backlinks using a triangle structure (A→B→C→A) so there's no direct reciprocation. No cold outreach & no reciprocal penalty.\n\n**13. Comparison pages**\n\n\"[Competitor] alternatives\" and \"[Competitor] vs [Your brand]\" searches are bottom-of-funnel gold. These people have already decided to buy - they're just picking which option.\n\nBe honest in these. If you're worse at something, say it. Builds trust and filters out bad-fit customers.\n\n**14. Schema markup that matters**\n\nMost sites skip this or add useless generic markup. Three that actually help:\n\n- `Person`/`Author` - links content to a real human\n- `FAQPage` - qualifies for rich snippets\n- `SameAs` - tells Google all places your brand exists\n\nIf you do this, and are patient enough, I can guarantee you'll get more organic traffic within 3 months.\n\nResults of some websites I've helped with the aforementioned tactics:\n\n- SaaS 1: https://imgur.com/a/OXcw9Ob\n- SaaS 2: https://imgur.com/a/PTozQLx\n- Gaming Directory website: https://imgur.com/a/aU4KK71\n\nHappy to answer questions if needed!",
        "subreddit": "SaaS",
        "author": "vince_jos",
        "score": 73,
        "num_comments": 16,
        "created_utc": 1766921420.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pxp8fv/seo_tactics_that_actually_work_for_saas/",
        "fetched_at": "2025-12-29T08:20:27.894754"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 68,
        "num_comments": 27,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-29T08:20:32.791032"
      }
    ]
  }
}