{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-06T00:57:43.449573"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-06T00:57:34.768950"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-11-06T00:57:34.348245"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-06T00:57:34.348241"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2025-11-06T00:57:34.768952"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-06T00:57:34.348227"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-06T00:57:34.768946"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-06T00:57:34.768948"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-06T00:57:34.348249"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-06T00:57:34.768934"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-06T00:57:34.348243"
      }
    ],
    "reddit": [
      {
        "id": "1oo6k1v",
        "title": "Owning a business in Texas made me think differently about marriage",
        "selftext": "I run a small design business here in Texas, nothing crazy but it’s finally doing well after a few rough years. The weird part is, the more it grows, the more I’ve started thinking about how tied up my personal life is with all of it.   \nI’ve seen friends lose half their business after a divorce, and it honestly freaked me out a bit. It’s not even about trust it’s just realizing how fast something you built from scratch can get tangled up in stuff that has nothing to do with work.   \nI’m in a serious relationship now and things are good, but for the first time, I’ve actually caught myself thinking about stuff like prenups or protecting ownership. Never thought I’d be that person, but here we are.\n\nAny other business owners hit that point where you start looking at marriage a little differently once there’s a company involved?",
        "subreddit": "Entrepreneur",
        "author": "Extreme-Eagle-3555",
        "score": 650,
        "num_comments": 219,
        "created_utc": 1762261540.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oo6k1v/owning_a_business_in_texas_made_me_think/",
        "fetched_at": "2025-11-06T00:57:35.540372"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 471,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-06T00:57:42.448209"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 182,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-06T00:57:42.448245"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 179,
        "num_comments": 28,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-06T00:57:42.448224"
      },
      {
        "id": "1oo7d07",
        "title": "This is the WORST period ever to build a startup (I will not promote)",
        "selftext": "I've come to firmly believe - after more than one attempt - that this is by far the worst time to build a startup. Anyone claiming otherwise is lying in plain sight, and I am sick of reading about these lies every now and then.\n\nSure, tools make building easier: AI, \"vibe coding\" and so on.\n\nBut that's exactly what’s killing startups. It's now almost impossible to build a moat. Every product-market fit (difficult per se to find in a solutions over-saturated world) turns into a red ocean in the blink of an eye.\n\nBefore you even manage to build an MVP and get early traction, ten other ventures are already doing the same thing - burning money and making any roadmap to profitability useless.\n\nThe only remaining way to build a moat is through distribution (and distribution only, while it used to be a mix) - and that’s the most plutocratic asset of all. Those who already have customers have money, and those with money can afford to lose more of it, for longer, even in a red ocean.\n\nTo some extent, this has always been true. But now it's 10x, maybe 100x worse.\n\nNewcomers’ efforts are fragmented; they never reach the critical mass to become something meaningful. In the best-case scenario, they get acquired early by incumbents just to speed up existing processes - so nobody really profits from the initial risk.\n\nAs a \"job\" when you weigh risks and opportunities, building startups is becoming less and less viable.\n\nIs that a sterile complaint? Yes.\n\nIs it wrong? You tell me.",
        "subreddit": "startups",
        "author": "agin_",
        "score": 174,
        "num_comments": 234,
        "created_utc": 1762263545.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oo7d07/this_is_the_worst_period_ever_to_build_a_startup/",
        "fetched_at": "2025-11-06T00:57:38.999460"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 167,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-11-06T00:57:42.448282"
      },
      {
        "id": "1ooxf1f",
        "title": "What are some productivity tools every Entrepreneur should know about? Especially in the age of AI",
        "selftext": "Being an entrepreneur today means juggling a dozen things at once-  clients, content, meetings, finances, and strategy. It’s chaos unless you’ve got the right tools holding it all together.\n\nAI has changed the game. You can now automate emails, summarize reports, manage tasks, and even create content while you focus on actual growth. The trick is finding tools that actually save time instead of adding more noise.\n\nSo I’m curious- what are some productivity tools every entrepreneur should know about, especially in the age of AI?",
        "subreddit": "Entrepreneur",
        "author": "CraftyKick5346",
        "score": 98,
        "num_comments": 65,
        "created_utc": 1762331051.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ooxf1f/what_are_some_productivity_tools_every/",
        "fetched_at": "2025-11-06T00:57:35.540317"
      },
      {
        "id": "1o40fm7",
        "title": "As someone who works from home, how do you socialise? or meet new people/make friends?",
        "selftext": "I am working from home, a 27F. Honestly it gets boring and i dont have any friends in here in my hometown. I have lived in hostel since 15 and hence havent made any friends here.\n\nMy hometown is also not a lively place with meetups or activities happening, so it just becomes difficult for me.\n\nAny other way to socialise? maybe any online ways? Please suggest.\n\nUpvote1Downvote1Go to comments  \n",
        "subreddit": "freelance",
        "author": "This-Brief6214",
        "score": 65,
        "num_comments": 62,
        "created_utc": 1760201179.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o40fm7/as_someone_who_works_from_home_how_do_you/",
        "fetched_at": "2025-11-06T00:57:42.448266"
      },
      {
        "id": "1ooy3c8",
        "title": "How to raise money from VCs at pre-seed. Don’t. <I will not promote>",
        "selftext": "Stop chasing VC money at pre-seed, if you are not prepared. It’s a waste of time.\n\nIn my first startup we raised money from Sequoia, Techstars and SkyDeck. But before that, we wasted the first six months trying to convince investors with nothing to show, just a website and some nice words.\n\nAfter going through several accelerators and meeting hundreds of founders, I realized one thing: raising money too early is one of the biggest mistakes you can make.\n\nAt the pre-seed stage, VCs care about four things:\n\n**Experience**. They want a team with real experience in the field. Not just smart people, but people who understand the industry deeply.\n\n**Traction**. They want to see real growth, something that proves people actually care about what you are building.\n\n**Credibility**. They want to invest in startups that can convince other investors too.\n\n**Progress**. If a VC asks you to keep them updated, do it. It shows that you can set goals and reach them.\n\nNow let’s destroy some myths:\n\n* VCs are not attracted by ideas. Ideas are cheap, execution is everything.\n* VCs are not your friends, even if they smile and follow you on LinkedIn. They invest because they expect a return.\n* VCs are not necessarily looking for profitable startups. They are looking for startups that can be sold. The exit is what matters, which means reaching the next round.\n\nAnd about the pitch deck, it will never raise money by itself. It is just a business card to get a meeting. Focus on clarity and content, not fancy design. YC’s guidelines are still the best reference. Keep it short, direct and free of meaningless buzzwords.\n\nHere are some hard truths most founders learn too late.\n\nThe money you raise is not your money. You will not get rich from funding rounds. In most cases your salary will be the lowest in the company.\n\nFunding is debt. It is high risk, but still debt. No one gives you money for free.\n\nVC's money are for growth, not validation.\n\nThe only reason to raise is to grow faster, not to prove that your idea works.\n\nAnd raising a lot does not mean you are successful. Sometimes it only means you are good at selling dreams. I have seen CEOs raise millions with no traction, no experience and just confidence. They looked arrogant, overly self assured, and VCs loved it. Especially if they were young.\n\nBut success means building a company that creates value for customers and generates real revenue from that. It means reaching break even and becoming self sustaining.\n\nRemember, raising more money often means getting further from profitability.\n\nBefore chasing investors, ask yourself:\n\n* Is my team experienced enough for this industry?\n* Are we credible for the next round? \n* Is my idea already validated?\n* Do I really need to grow fast?\n\nIf your answer sounds like any of these, stop now:\n\nI need money for myself.  \nI need money to validate the idea.  \nI need money to convince my cofounder.  \nI need money to hire someone to build it.  \nI need money to prove the project works.\n\nAnd the worst of all:  \nI need money to get rich.\n\n**Did you ever feel like trying to raise money from VCs was pointless? Why?**",
        "subreddit": "startups",
        "author": "diodo-e",
        "score": 57,
        "num_comments": 39,
        "created_utc": 1762333701.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1ooy3c8/how_to_raise_money_from_vcs_at_preseed_dont_i/",
        "fetched_at": "2025-11-06T00:57:38.999437"
      },
      {
        "id": "1op4e4a",
        "title": "Our small business is looking for the best identity and access management software",
        "selftext": "Our small business is expanding faster than expected – we now have over 30 employees across a bunch of teams, which is great except we’re realizing we need to get our authorizations, authenticatins, shared logins, etc. in shape. Our Google Sheets trackers are starting to fail us with so many users needing different logins, permissions, etc. \n\nOur main business tools are Google Workspace and Slack, but there’s no way to set up their accounts automatically when we hire someone new. We’ve evaluated that we need a more formal process for identity & access management software that can handle logins, permissions, access, etc. and even devices too if possible. \n\nI’ve heard great things about Rippling IT since our team was already evaluating them for HR and payroll anyways, but also was researching Okta as a separate IT alternative. What do you think would work here as an IAM option for a small biz? \n\nAppreciate the input here. ",
        "subreddit": "smallbusiness",
        "author": "metalade1",
        "score": 51,
        "num_comments": 14,
        "created_utc": 1762353042.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1op4e4a/our_small_business_is_looking_for_the_best/",
        "fetched_at": "2025-11-06T00:57:40.576991"
      }
    ]
  }
}