{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-27T08:16:15.095761"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-27T08:16:06.810974"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-12-27T08:16:06.810972"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-27T08:16:06.567032"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-27T08:16:06.567046"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-27T08:16:06.567043"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-27T08:16:06.810969"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-27T08:16:06.810976"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-12-27T08:16:06.567049"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-27T08:16:06.810957"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-27T08:16:06.567048"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 488,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-27T08:16:14.094344"
      },
      {
        "id": "1pvx3tl",
        "title": "Hit 1M ARR yesterday- everyone is lying to you",
        "selftext": "Hey everyone, this post is going to trigger a lot of folks.\n\nI joined reddit 4 years back started following these different saas startups threads hoping to get some value. \n\nI started following all the constant advice - Build in public, Post about your startup on reddit, cold messaging. Everyone is lying here and they know it.\n\nI wasted 3 FUCKING YEARS of my life building businesses out of taking these suggestions and made $740 in 3 years. Then last year I met a founder backed by a16z who is running a 7M ARR company today. His advice changed everything for me.\n\nAnd I am going to share it because IT IS NO DAMN SECRET! Everyone outside of reddit who has ever built a real business knows these things!!!!\n\n1. Don't fucking re-invent the wheel. Just fucking copy what already is selling in market.\n\n2. Your product features mean shit if no one has ever looked at your product \n\n3. Don't waste your time doing product hunt launches and all the other retarded sites to launch your product. Its a trophy that no one gives a shit about.\n\n\nNow coming to the real deal\n\n1. Homepage matters much more than your actual website. Clear CTAs creating urgency and solving one and only one problem no confusion should be there. Best AI to make home page - \"Figma Make\" dont waste your time finding anything else. I have tested all of them for months. \n\nExample of homepage title \"Get 10x leads from X\"\n\n2. Never do cold emailing, IT NEVER works. Do linkedin outreach much much higher chances of working. Best and cheapest tool - \"linkedHelper\"\n\n3. Stop trying to build your audience and go VIRAL on linkedin twitter X or whatever fucking platform. If you want to build a company 20 years later then sure go ahead\n\n4. Just fucking run Ads, whatever 5k USD you were going to waste in the next 6 months fucking around with ZERO results put all that money and run FUCKING Ads.\n\n5. Unless really irrelevant, for most businesses ONLY run META ads. If your saas is complex and mostly for enterprises etc then run google search ads.\n\n6. META has fucked the platform and now static ads dont work you need only UGC. And please dont ever try AI UGC all those tools out there will generate you ZERO clicks from AI video ads.\n\n7. Get atleast 50-60 UGC pieces from real ugc creators. cheapest website to get UGC - bulba.app\n\n8. Take the UGC and run ads on those. dont EVER try to run ada yourself. Just hire some freelancer from india/philippines from upwork but with really good rating and past work. Don't fall into any agency trap. Always independent. They will do it even for $500.\n\n9. If you product is in $20-50/month range your flow should be signup -> 1 week free trial (with card) -> conversion.\nIf its $100+ then signup -> book demo -> 1 conversion. Only offer free trial for people who ask for that on the call. \n\n10. Then track conversion and drop rates in each stage and try to optimise to finally get a better ROAS.\n\n\nTHATS IT! and people who have done it know that this is how you build a business. And they are mostly not on reddit!\n\nBYE!",
        "subreddit": "SaaS",
        "author": "Any_Database1735",
        "score": 457,
        "num_comments": 227,
        "created_utc": 1766728824.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pvx3tl/hit_1m_arr_yesterday_everyone_is_lying_to_you/",
        "fetched_at": "2025-12-27T08:16:09.235029"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 449,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-27T08:16:14.094390"
      },
      {
        "id": "1pwcnz3",
        "title": "Bought a $1,200 product from Alibaba, listed it on FB Marketplace for $2,500 out of curiosity. Now I’m wondering if I stumbled onto something real.",
        "selftext": "So here’s the story.\n\nI was looking at some car accessories and kept seeing the same products priced at what felt like a crazy markup. Out of curiosity, I started digging into Alibaba to see what the actual manufacturing cost looked like. After a decent amount of research into suppliers, reviews, and verifying the manufacturer, I pulled the trigger on one unit.\n\nWhen it arrived, I was honestly expecting stereotypical cheap Chinese knockoff quality. But it wasn’t. The build quality was on par with the name-brand US versions I’d been comparing it to.\n\nJust for fun, I threw it up on Facebook Marketplace to see if there was any interest. The response surprised me. My all-in cost including shipping was around $1,200. Comparable products were selling locally for $2,500+. I had multiple inquiries within days.\n\nSo now I’m testing it for real. Bought a few more units, planning to flip them. If it works, I’ll open an LLC and do everything above board.\nHere’s where my background helps: I work in logistics, so I’ve been able to optimize shipping and cut some costs that I think most people wouldn’t know how to avoid. I’m wondering if that gives me a legitimate edge, or if this whole space is so saturated that margins get crushed the moment you try to scale.\n\nMy questions for this community:\n\n\t∙\tIs the “Alibaba to local resale” model played out, or are there still niches where this works?\n\t∙\tDid I just get lucky with this particular product category, or is there a repeatable process here?\n\t∙\tFor those who’ve done this: what’s the capital requirement to actually make it a real business vs. a side hustle?\n\nWould love to hear from anyone who’s tried this, whether it worked or didn’t. Not looking for validation; just trying to figure out if this is worth pursuing seriously or if I should just enjoy the quick wins and move on.",
        "subreddit": "Entrepreneur",
        "author": "Different-Bridge5507",
        "score": 335,
        "num_comments": 220,
        "created_utc": 1766777250.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pwcnz3/bought_a_1200_product_from_alibaba_listed_it_on/",
        "fetched_at": "2025-12-27T08:16:07.538898"
      },
      {
        "id": "1pw55z3",
        "title": "I watched Hormozi’s 2025 Lessons (1.5 hours) so you don't have to. Here are the biggest takeaways",
        "selftext": "I just finished watching Alex's new \"26 Lessons\" video. It’s long, but honestly, there were some gems in there that hit pretty hard. I took notes for myself and figured I’d drop them here to save you guys the time.\n\nHere you go:\n\n**On Mindset & Psychology**\n\n* **Fear lives in the vague.** If you’re scared, write down the absolute worst-case scenario in detail. Usually, it’s just \"sleeping on a friend's couch,\" not dying. Once it’s on paper, it’s not scary.\n* **Mental Toughness > Motivation.** He breaks toughness down into: How much bad stuff can you take? How low do you get? How fast do you bounce back? And do you come back better?\n* **The \"Heavyweight Champion\" move is doing nothing.** When someone insults you or triggers you, your gut wants to punish them. But usually, doing nothing is the only move that actually gets you what you want (them going away).\n* **Think for yourself.** Most people are just picking \"identity packages\" off the shelf (Hipster, Redneck, etc) and adopting those beliefs. If you can't explain why you believe something, it's not your thought.\n* **It's okay to just make money.** Don't fall for the \"Third Marshmallow\" trap where you delay gratification until you're dead. At some point, you have to reap what you sowed.\n\n**On Business Strategy & Growth**\n\n* **No \"New\" Stuff.** New is risky. The hierarchy is: Do **More** of what works > Do it **Better** \\> Do something **New** (only as a last resort). He only allows himself one new big project a year.\n* **Plan life first.** Once you have money, you’re paid for judgment, not hours. So prioritize sleep and an empty calendar. Let business fill the cracks, not the other way around.\n* **Ignorance isn't a defense.** Learn the laws and contracts. \"Lawyer stuff\" eats your brainpower if you don't understand the rules of the game.\n* **The Founder's Will.** The biggest risk isn't running out of cash, it's the founder just not wanting to do it anymore. You need a \"why\" that survives past the point where the money is \"enough.\"\n\n**On Team & Leadership (The harsh truths)**\n\n* **The Leader is always the problem.** If a department sucks, the leader sucks. Period.\n* **A-Players or nothing.** You know if someone is an A-Player in the first 14 days. If you don't know by then, they aren't one. Cut them.\n* **A-Players hate B-Players.** If you keep mediocre people, your stars will leave.\n* **Hard conversations save millions.** If you can't have a tough talk when stakes are low (contracts), you guarantee a lawsuit when stakes are high.\n* **Delegation is painful.** The spiritual path of entrepreneurship is constantly giving up control. \"Scale Zero\" means if a task requires you, it’s broken.\n\n**On Marketing & Brand**\n\n* **The Offer is King.** You can't out-market a bad offer. A good offer makes people feel stupid saying no. (Razor: Can you pitch it in a text message and get a \"yes\"? If not, it's too complex).\n* **Clear > Clever.** No one is listening. You have to repeat yourself until you die.\n* **Brand is the Moat.** In an AI world, execution is commoditized. Who people trust is the only defense. Give away the secrets, sell the implementation.\n* **Volume wins.** You need thousands of ad creatives. He used like 5,000 variations for his book launch.\n\nP.S. Add yours - let's make a mega thread which is packed with value for all.",
        "subreddit": "Entrepreneur",
        "author": "alexoff",
        "score": 168,
        "num_comments": 35,
        "created_utc": 1766758221.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pw55z3/i_watched_hormozis_2025_lessons_15_hours_so_you/",
        "fetched_at": "2025-12-27T08:16:07.538902"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 165,
        "num_comments": 39,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2025-12-27T08:16:14.094369"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 149,
        "num_comments": 62,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2025-12-27T08:16:14.094366"
      },
      {
        "id": "1pvzsxr",
        "title": "I wish customers understand the expenses a micro/solo business owner goes through",
        "selftext": "I sell cakes and I have ongoing overheads such as electricity, cooking gas, fuel, labour, website costs, insurance, rent (is a effing killer), internet, phone bills, ads/marketing etc....\n\nWhile the ingredients of the cake makes up a small portion, for example, I sell my cakes at a competitive price of $74.95 AUD and that's considered cheap in my niche cakes for a professional, niche baker\n\nI am not making that much profit after expenses.\n\nFor example a vanilla and white chocolate cake ingredients is around $10AUD, me physically making a cake is around 2-2.5 hours, as in actually moving and making the cake, not taking in idle time such as time baking in the oven, time resting the cake to cool down.\n\nIf I set myself a wage such as $25 which is around minimum wage in Australia, that's already $62.50 (2.5 hours) of labour + $10 ingredients, that's already $72.50 just in ingredients and labour.\n\nObviously as you know, more I sell, the more I can create at the same time, yay mass production.\n\nBut so many damn customers are like \"I can make it myself, ingredients is only $10\" and I just wanna say \"listen here ya little sh\\*t, here are all my expenses making the cake and you tell me if I am making $64 worth of PROFIT\"\n\nAnyways.... sorry small rant.",
        "subreddit": "smallbusiness",
        "author": "salty_lake_222",
        "score": 107,
        "num_comments": 69,
        "created_utc": 1766739187.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pvzsxr/i_wish_customers_understand_the_expenses_a/",
        "fetched_at": "2025-12-27T08:16:12.342687"
      },
      {
        "id": "1pwa3a8",
        "title": "Customer is 8 months behind on $14,000 of Invoices...should I hire a collections agency? Or would a lawyer be a better bet at this point?",
        "selftext": "I've tried to call them multiple times and email, but they keep on pushing me off and saying they'll pay me \"later, when business picks up again\".",
        "subreddit": "smallbusiness",
        "author": "Broad-Worry-5395",
        "score": 95,
        "num_comments": 52,
        "created_utc": 1766770885.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pwa3a8/customer_is_8_months_behind_on_14000_of/",
        "fetched_at": "2025-12-27T08:16:12.342673"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 89,
        "num_comments": 37,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2025-12-27T08:16:14.094364"
      }
    ]
  }
}