{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-06T16:13:56.654852"
  },
  "data": {
    "youtube": [
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-12-06T16:13:46.890098"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-06T16:13:46.600415"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-06T16:13:46.600429"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-06T16:13:46.600426"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-06T16:13:46.600423"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-06T16:13:46.890104"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-06T16:13:46.890102"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-06T16:13:46.890090"
      },
      {
        "videoId": "MLBwqLcazYY",
        "title": "Bookkeeping 101 for Small Business (EASY EVEN IF YOU KNOW NOTHING ABOUT ACCOUNTING)",
        "description": "BOOKKEEPING 101 FOR SMALL BUSINESS (EASY EVEN IF YOU KNOW NOTHING ABOUT ACCOUNTING) // Do you wonder ...",
        "channelTitle": "Jill Gockel",
        "publishedAt": "2019-09-10T11:17:27Z",
        "url": "https://www.youtube.com/watch?v=MLBwqLcazYY",
        "fetched_at": "2025-12-06T16:13:46.890101"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-06T16:13:46.600427"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 489,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-06T16:13:55.653502"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 435,
        "num_comments": 125,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-06T16:13:55.653532"
      },
      {
        "id": "1pfk5gj",
        "title": "I spent €250 on our launch video, tell me if you think it was worth it",
        "selftext": "Hi everyone, \n\nIn my network, there are quite a few startups that are building their startups solely around marketing funnels instead of products. And the most successful ones are using character-based marketing- creating some pixar-like/animated character and really leaning into that. That reminded me of Duolingo success as well.\n\nI thought why more brands are not using mascots/characters?\n\nSo I participated in a Cursor hackathon a month ago, won $15k 1st place cash prize, quit my job and committed to this idea full-time- and for launch we created this video:\n\n[https://youtu.be/W82pv-sXEHw](https://youtu.be/W82pv-sXEHw) \n\nWould love to hear your thoughts and what people think about these kind of videos but since the tool is visual I thought the launch should be visual as well. Also, I got it done super cheaply and thought that this could bring in more impressions for the price than ads could- I might be wrong.\n\nTrends I am building for:  \n  \n1. Character-based marketing has been on an upwards trend, producing incredible results to companies advertising through consumer channels. Duolingo is the prime example.\n\nDistribution is everything nowadays and if mascots mean better ROI on your marketing efforts, then mascots it is! 📈\n\n2. We are betting that more and more AI-first software companies will associate their brands with characters- they all have character built-in, why not associate it with a memorable body? 🤖\n\n3. The amount of online (tech/ecom/digital products) business is growing exponentially. You can one-shot a calorie tracker app or a Shopify ecommerce store with a single prompt, but everyone is using the same tools and models to do so. 🟰\n\nThis means sameness all around- that’s where a well-developed brand character can become your moat.\n\nAnd personally, I am kinda done with this utopian futuristic minimalism.\n\nBut thats me.",
        "subreddit": "SaaS",
        "author": "Upstairs-Phone2678",
        "score": 139,
        "num_comments": 19,
        "created_utc": 1765009006.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pfk5gj/i_spent_250_on_our_launch_video_tell_me_if_you/",
        "fetched_at": "2025-12-06T16:13:49.445769"
      },
      {
        "id": "1pfj26s",
        "title": "Finally stopped doing sales calls myself. Revenue dropped 40%.",
        "selftext": "At $34K MRR, was doing all sales calls personally. 8-10 per week. Exhausting but effective.\n\nHired a salesperson. Trained them for a month. Gave them the playbook. Handed off all calls.\n\nMonth 1: closed 40% less than I did.\n\nMonth 2: closed 45% less.\n\nMonth 3: I panicked and took calls back.\n\nWhat went wrong:\n\nProduct knowledge gap. They learned features but didn't understand why they mattered.\n\nTrust factor. Prospects could tell they weren't talking to a founder. Questions got deflected.\n\nFlexibility. I could adjust pricing, offer custom terms, make commitments. They couldn't.\n\nDeal size mismatch. My average deal was $1,200 ARR. Not enough to support a $60K+ salesperson.\n\nWhat I learned:\n\nFounder-led sales has an unfair advantage. Customers like buying from the person who built it.\n\nYou can't hand off sales until the playbook is truly systematized. \"Watch me do it\" isn't a playbook.\n\nAt low deal sizes, sales hires are math problems. $60K salary needs $200K+ in new ARR to make sense.\n\nI went back to founder-led sales. Now at $52K MRR, still doing calls myself.\n\nWill I try again? Eventually. But not until average deal size is over $5K ARR.\n\nAt what point did you stop doing sales yourself?\n\n",
        "subreddit": "SaaS",
        "author": "SaaSSignal",
        "score": 114,
        "num_comments": 40,
        "created_utc": 1765004874.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pfj26s/finally_stopped_doing_sales_calls_myself_revenue/",
        "fetched_at": "2025-12-06T16:13:49.445771"
      },
      {
        "id": "1pexdkv",
        "title": "Advice needed - managers expected to chip in for extravagant gift for company owner",
        "selftext": "Tldr - 17 managers are expected to chip in $100 toward a $1700 gift for the company owner.\n\nContext - \n\nI've been working at this company for less than a year, and overall am very happy here. Though it would be considered a small business (80 employees and one owner) the company is very successful, debt free, and grosses roughly 50m revenue/ year. This morning I received the following email from the president (owners nephew training to take over after owner retires)\n\n\nTeam,\n\nAs we do each year we have secured a holiday present for Owner.  Owner eats quite a bit of fish so we got him a monthly subscription for a year from *company*.\n\nEach person’s contribution is $100.  Please venmo me when you have a chance. \n\n\nThere were 17 people on the email chain, so they are anticipating collecting $1700 for this gift. This was not discussed, and based on the email, did not seem to be posed as optional. \n\nMy first instinct was to report the email as phishing because I thought there's no way this guy is asking us all to Venmo him $100, but when I looked at the recipients, it seemed legit. Head of HR and IT were both on the To line.\n\nAm I crazy for feeling like this is a bit much? Can't we just get the guy a tie? Isn't our gift to him the labor we put in to make him his several million dollar salary? \n\nShould I report the email? Send the Venmo? What will happen if I just don't do anything, are they going to follow up? I don't want to come off as cheap or unappreciative. I get paid well and I think the owner is great, but this all seems so odd to me. ",
        "subreddit": "smallbusiness",
        "author": "BMFResearchClub",
        "score": 110,
        "num_comments": 95,
        "created_utc": 1764947087.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pexdkv/advice_needed_managers_expected_to_chip_in_for/",
        "fetched_at": "2025-12-06T16:13:53.765212"
      },
      {
        "id": "1pfcnsf",
        "title": "Brooo.... my app just made its first ever sale, I'm shaking 😂",
        "selftext": "Not even kidding, I was going to shut down my firebase account and boom, first sale!!\n\n\n\nMy purpose-built research macOS browser, SpiderBrowser, finally got its first paying client after 2 months of debugging and cold outreach.\n\n\n\nFeels like someone finally appreciated my creativity enough to pay for it.\n\n\n\nMight be small for some, but for me it's validating .\n\n\n\nSending virtual hugs to all developers and researchers grinding out there. ❤️",
        "subreddit": "SaaS",
        "author": "Itchy_Cry_8979",
        "score": 83,
        "num_comments": 28,
        "created_utc": 1764984327.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pfcnsf/brooo_my_app_just_made_its_first_ever_sale_im/",
        "fetched_at": "2025-12-06T16:13:49.445777"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 74,
        "num_comments": 53,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-06T16:13:55.653554"
      },
      {
        "id": "1pf0nyg",
        "title": "\"went from 2/10 to 8/12 demo close rate by doing the opposite of what every sales course teaches\"",
        "selftext": "running a small B2B SaaS. was closing 2 demos out of every 10. spent money on a sales course that taught me to \"control the narrative\" and \"demonstrate value\" and all that.\n\nmade it worse somehow.\n\nthen had a demo in august where my screenshare broke 5 minutes in. couldnt show anything. ended up just talking to the guy about his current process and his problems for 20 minutes. he signed up the next day.\n\nthat completely changed how i do demos now.\n\nstopped doing the 30 minute product tour thing. now i just ask them questions for the first 10 minutes. like actually understanding what they currently do and what sucks about it.\n\nthen i only show them the 2 or 3 features that would fix their specific problem. nothing else. dont even mention the other features unless they ask.\n\nend by asking \"would this actually solve what you just told me about?\" and then shut up.\n\nmy demo deck used to have like 25 slides showing everything. now its 6 slides. keep it in gamma so i can edit it quick before calls if i need to customize anything.\n\nclose rate went from 2 out of 10 to 8 out of 12 in the last 4 months. revenue went from $3k to $11k MRR.\n\nalso started sending followup emails within an hour instead of the next day. just a quick \"here's what you told me you need, heres which features would help, heres the next step\"\n\nthe whole shift was realizing people dont buy products. they buy solutions to their specific annoying problem. once i actually understood their problem first, everything got easier.\n\nstill feels weird that my demos are 20 minutes now instead of 45 but the numbers dont lie.\n",
        "subreddit": "SaaS",
        "author": "cherryy_04",
        "score": 68,
        "num_comments": 30,
        "created_utc": 1764954669.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pf0nyg/went_from_210_to_812_demo_close_rate_by_doing_the/",
        "fetched_at": "2025-12-06T16:13:49.445819"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 61,
        "num_comments": 20,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-06T16:13:55.653528"
      },
      {
        "id": "1pfamg6",
        "title": "Feeling behind in life after putting my R&D startup first from ages 25-36. I will not promote.",
        "selftext": "\nHi team,\n\nI’ve been working on my startup as a side hustle alongside my university educated day job for 10 years now. The R&D has certainly come a long way bootstrapping the whole time. I’ve been scared to take any investment because I knew that I could bootstrap that little bit longer and as a result give away less equity the further along I got it. But it’s come at a cost I didn’t think about 10 years ago, I’ve swapped gained equity for life time. \n\nI feel so behind compared to my friends and family members of similar age who are all marked with children. I had a relationship for 8 years of the startup’s life and 2 years ago it all got too much and we separated. She wanted to move forward and I just couldn’t commit to having kids before the R&D was earning revenue. When I first started the startup at 24 I thought ‘I’ll be a millionaire in a few years’. It’s not about the money specifically, it’s about the financial security of being able to do something I love rather than the day job that I don’t love. But here we are now I’m 36 and single and I feel ashamed going on dates and admitting that I don’t have a house or a nice car (which would normally be associated with my day job). I’ve attached the idea of success in the startup to my def worth as a person. Deep down I think I’ve had the belief that I need the startup to succeed in order to be loveable - even to those that admit they love me because I was/am under the illusion I need to be successful before anyone could see me and was/am too ashamed at my position relative to where I thought I would be. \n\nI should add: the startup is in the biology and material science field. It takes a long time to grow things but the IP developed along the way compounds, it’s a little different to a software startup. \n\nTL;DR: The R&D is certainly close to investment level and I can’t stop, I just feel behind, embarrassed and ashamed at where I am compared to where I thought I would be at this point in life. I’m sure so many of you can relate - I’d love to hear your experiences to just help me realise I’m not a loser or alone and that it’s all going to be ok. For anyone else who needs to hear this: you’re not alone, I’m right hear with you and I hope it’ll all work out for us. \n\nMy takeaway/what I've learnt: James Dyson has been a major role model for me. I've always wanted to operate like him and be successful without external funding but we're not all James Dyson and have a product as revolutionary as that. I am learning to accept that 100% of 0 is still 0. It's better to own part of a million/billion dollar company than to own all of a worthless company. Time to ask for help.",
        "subreddit": "startups",
        "author": "Neutron_glue",
        "score": 59,
        "num_comments": 29,
        "created_utc": 1764978682.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1pfamg6/feeling_behind_in_life_after_putting_my_rd/",
        "fetched_at": "2025-12-06T16:13:52.200183"
      }
    ]
  }
}