{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-02T08:18:51.173154"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-02T08:18:42.790309"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-02T08:18:42.568317"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-02T08:18:42.568326"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-02T08:18:42.568320"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-02T08:18:42.568303"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-02T08:18:42.790306"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-02T08:18:42.790313"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-02T08:18:42.790311"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-02T08:18:42.790296"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-02T08:18:42.568322"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 487,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-02T08:18:50.171816"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 432,
        "num_comments": 121,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-02T08:18:50.171834"
      },
      {
        "id": "1pbiiil",
        "title": "i swear entrepreneurship is just waking up every day and choosing delusion",
        "selftext": "idk who needs to hear this but i’m convinced like 80% of entrepreneurs are just running on pure delusion and caffeine.\n\nlike today i woke up fully convinced i’m gonna scale my business, dominate new markets, maybe even retire early  \nand then by noon i’m sitting on my floor eating cereal straight from the box wondering why nobody replies to my outreach 😭\n\nwhy does this stuff feel so simple in your head but turn into a whole greek tragedy when you try to do it in real life\n\nis this normal or am i just built wrong lol  \nwhat keeps u going when your brain is like pls stop but your soul is like nah we up next?\n\n",
        "subreddit": "Entrepreneur",
        "author": "Fulcilives1988",
        "score": 340,
        "num_comments": 89,
        "created_utc": 1764609213.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pbiiil/i_swear_entrepreneurship_is_just_waking_up_every/",
        "fetched_at": "2025-12-02T08:18:43.492841"
      },
      {
        "id": "1pbqs27",
        "title": "Advice from a 9-figure entrepreneur",
        "selftext": "I started my first business in 2010, and have gone from having about a thousand bucks in my bank account to a paper net worth in the low nine figures (though this will come down to high eight figures after taxes). Here's my advice FWIW:\n\n**1. Learn technical skills.** Unless you're an artist or a restauranteur or something like that, odds are that the majority of your work is going to be done on a computer. As such, you should master keyboard shortcuts, use multiple monitors, set up your workspace in an efficient way, learn basic coding skills (Javascript, HTML, and SQL are all you really need), know how to model things out in spreadsheets, etc. These skills have been instrumental to me in everything I've done as an entrepreneur, and without them there is absolutely no way I would have succeeded. One of my earliest memories of my first business was a friend asking me how I was making money (he was trying something similar and failing); I could see that a lot of the reason he was failing is that he couldn't handle any of the technical aspects of what he was doing himself (eg building a website), and so was paying for someone else do do a third-rate job of it. I said \"learn how to code\" and he responded with \"but that's too hard.\" Yes, learning new things is hard, and he also should have learned how to code. Which brings me to...\n\n**2. Suck it up and do the hard things.** The vast majority of people give up when they hit their first wall. Another huge chunk drop off after the second, third, or fourth. The people who succeed are the ones who suck it up and power through the shitty parts of entrepreneurship (and it's mostly shitty at the start). I learned this during the first year of my third business, and I'm learning it again now as I'm trying to get my philanthropic efforts off the ground: there is just so much stuff when you're starting out that's a pain in the ass, and there's no one to do it but you. If you can muster the mental fortitude to just make yourself do those things, you will separate yourself from 99% of the competition and massively increase your odds of success. As just one example: can you even *imagine* how difficult it must have been to sell books on the internet in 1993? Jeff Bezos must have literally run into thousands of pain-in-the-ass things, any one of which would have deterred a normal person, but he kept at it and now he's Jeff Bezos.\n\n**3. That which gets measured gets improved.** I have kept a side scrolling daily spreadsheet of my company's P&L every single day going back to 2010. If I determine that something is critical to my company's success, I carefully measure it over time, and take note of any initiative that moves the numbers in a positive or negative direction. Even if you're just starting out and there's not much to measure, measure it. Make it a habit. While it's possible to drown yourself in data overload, I think it's much more common for people to be deficient in their data gathering and analysis than to take it too far.\n\n**4. Practice good manners.** It's crazy to have to write this one out, but I can't tell you how many people I come across that don't do this. If someone emails you, respond quickly. If they help you, say thank you (in fact, I recommend signing off on all your emails with \"Thanks, \\[First Name\\]\"). If they ask for a favor that's easy for you to deliver, do the favor. Follow up with people after a good conversation. Remember to always speak to what the *other person* wants, not just what you want. (That's another head-scratcher: the number of people who will say \"Hey Chris, it would really help me if you do X and Y\" without even considering what I want or whether it's in my interest to do what they're asking.)\n\n**5. Be obsessed with your business.** I recently stepped away from my company and handed the reins over to the management team. One of the major differences I've noticed in how they do things vs how I did things is that I was *obsessed* with the business, and they're not (somewhat understandably, obviously, as they don't have my equity stake in it). When you're obsessed with your business, things don't catch you by surprise because you were already worried about them way before they happened. When you're obsessed with your business, you always have a dozen ideas ready to go whenever resources free up. When you're obsessed with your business, you become the ultimate expert at the company across a variety of topics, and can be an invaluable resource to employees / teammates. Get obsessed.",
        "subreddit": "Entrepreneur",
        "author": "chris-abovewealth",
        "score": 259,
        "num_comments": 93,
        "created_utc": 1764627628.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pbqs27/advice_from_a_9figure_entrepreneur/",
        "fetched_at": "2025-12-02T08:18:43.492837"
      },
      {
        "id": "1pbiht1",
        "title": "Discovered my biggest customer has been sharing their login with 14 people at their company. Do I say something?",
        "selftext": "My product has per-seat pricing. $29/user/month.\nMy biggest customer pays for 3 seats. $87/month. They've been with me for 11 months. Great relationship. Use the product heavily.\nYesterday I was checking usage analytics and noticed something weird. Their account had usage from 14 distinct IP addresses in the last month. Different cities. Usage patterns that don't make sense for 3 people.\nThey're sharing one login across their whole team.\nBy my pricing, they should be paying for 14 seats. $406/month. They're paying $87.\nThat's $319/month I'm losing. $3,828/year from a single customer.\nBut here's my dilemma:\nThey're my biggest customer by usage. They genuinely love the product. They've referred 2 other companies to me.\nIf I enforce the seat policy, they might churn entirely. I'd lose $87/month plus their goodwill plus future referrals.\nIf I don't enforce it, I'm subsidizing a customer who's technically violating terms. And if other customers find out, why would they pay full price?\nOptions I'm considering:\nSay nothing and hope they eventually upgrade voluntarily. (Unlikely but avoids conflict.)\nReach out diplomatically. \"Hey noticed some unusual login patterns, want to make sure security is good. Also here's a team plan that might fit better.\" Give them a path to compliance.\nEnforce strictly. \"Our records show X users, please upgrade or we'll need to restrict to licensed seats.\" Might lose them entirely.\nGrandfather them at current rate but lock it in. \"Your price stays the same but we're implementing device verification going forward.\"\nI genuinely don't know the right move here. The money matters but the relationship also matters.\nHow would you handle this?\n\n",
        "subreddit": "SaaS",
        "author": "Cold_Hall_5384",
        "score": 241,
        "num_comments": 170,
        "created_utc": 1764609168.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pbiht1/discovered_my_biggest_customer_has_been_sharing/",
        "fetched_at": "2025-12-02T08:18:45.079623"
      },
      {
        "id": "1pbgxum",
        "title": "Just curious: how do small businesses like coffee shops stay open in big cities like NYC?",
        "selftext": "I was recently in NYC and stopped into one of the many small coffee shops in Manhattan, pretty close to Chinatown. A tiny storefront, just two tables inside plus some display shelves, a small case for baked goods, an ordering/serving counter. It might have been 150 square feet or so inside the customer area plus some room out back for making drinks. Coffee was $4 or so, a latte was $5, a croissant was $4 or $5, banana bread was $3. Hours are 8 AM to 7 PM, seven days a week.\n\nAnyway, it got me wondering how businesses like this stay open. With all of the competition plus the low per-customer revenue, how does a little place like this stay afloat in a big city? I assume the rent must be thousands per month. Do they need to own the space? Am I just not thinking through the math and not realizing that multiple small purchases a day add up? Are they running on a loan they'll never re-pay?\n\nI think about this a lot with random stores in cities. Like a little boutique-type store that sells funky little gifts, candles, greeting cards, etc. How does a place like that stay open in a presumably-desirable storefront area in a big city? Are there really enough people stopping in to support it?\n\nI guess the answer is obviously \"yes\" since they are open, but it doesn't make sense to me...",
        "subreddit": "smallbusiness",
        "author": "ajt331840",
        "score": 121,
        "num_comments": 58,
        "created_utc": 1764605727.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pbgxum/just_curious_how_do_small_businesses_like_coffee/",
        "fetched_at": "2025-12-02T08:18:48.353963"
      },
      {
        "id": "1pbap1m",
        "title": "Made $34K this month with my 5-month-old SaaS, here’s what worked (and what didn’t) + Proof",
        "selftext": "Hey everyone,\n\nI launched [this tool](https://gojiberry.ai) in May, and we made around $34K in November\n\nIt hasn’t all been smooth sailing, so I’ll share what worked, what didn’t, and what I’d do differently.\n\nQuick disclaimer: when I started this SaaS, I had zero audience in the niche I was targeting. However, I already had experience in SaaS, having built and sold one that reached 500K ARR pretty fast. So I knew how to handle a team, find a CTO cofounder, etc.\n\nIt’s definitely not easy. The first months mean no salary and constant reinvestment. Without experience and being solo, building a SaaS feels almost impossible.\n\nFor me, it’s a “second stage” business, something to do once you already have some money and security.\n\nToday we have over 300 customers and more than 30,000 monthly website visits. Here’s how we got there.\n\nWhat didn’t work: Twitter is still super slow, my account didn’t take off. SEO is super slow; we spent quite a bit on articles, but results take time. Cold calling also wasn’t worth the effort.\n\nWhat worked:\n\n\\-Reddit brings about 30% of our traffic. We post daily across subreddits, mixing value posts, resources, and updates. It drives a lot of volume, though conversion rates are moderate. (You probably saw us a lot on Reddit... yes... it works !)\n\n\\-Outreach is our top conversion source. We use our own tool, to find high-intent leads showing buying signals on LinkedIn, then reach out via LinkedIn and cold email. We send 3000 emails per day + as many linkedIn invitations as we can.\n\nWe get 3-5x more replies by email and on LinkedIn with our own tool compared to when we used Apollo or Sales Indicator databases. Using your own tool is honestly the key to building a successful SaaS, you always know exactly what needs to be improved.\n\n\\-LinkedIn inbound works great too. We post daily, and while it brings less traffic than Reddit, the leads are much more qualified. We use 3 accounts to post content. Some days it can bring us 10 sales.\n\nOur magic formula is 3k emails sent per day + 1 LinkedIn post per day + 5 reddit posts per week.\n\n\\- Our affiliate program has also been strong. We offer 30% recurring commissions, and affiliates have already earned over $3K. The key to a successful affiliate program is paying your affiliates as much as possible and giving them a full resource pack so it’s easy for them to promote your tool including videos, banners, ready-to-post content, and more.\n\n\\-Free tools worked incredibly well too. We launched four and shared them on Reddit and LinkedIn, which brought consistent traffic and signups every day. It’s pretty crazy because we put very little effort into it, yet every day people sign up for trials thanks to these free tools.\n\n\\- One big shift was moving from sales-led to product-led growth. Back in May, I was doing around 10 calls a day. It worked but wasn’t scalable. Now people sign up automatically, even while I sleep, and we only take calls with larger teams. It completely changed my life.\n\n\\-Influencer posts : We pay influencers to post about us on LInkedIn, it has been working really well. \n\nWe’re a team of three plus one VA, spending zero on ads. Our only paid channel is affiliate commissions.\n\nOur goal for end of December was 1m ARR. It will be less. We failed but it's growing.   \n  \nIf you have any questions, I’m happy to share more details and help anyone building their own SaaS.\n\nCheers !\n\n[Proof](https://gojiberry.ai/proof)",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 110,
        "num_comments": 67,
        "created_utc": 1764589559.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pbap1m/made_34k_this_month_with_my_5monthold_saas_heres/",
        "fetched_at": "2025-12-02T08:18:45.079648"
      },
      {
        "id": "1pb87iz",
        "title": "What was the most impressive AI use case you came across this past year?",
        "selftext": "AI is moving rapidly and every month I am amazed by some specific business use case that blows my mind as an entrepreneur.\n\nFor example, recently I saw someone generating full blown apps from just sketches using tools like Windsurf Cursor, and Claude Code!\n\nSo curious, what was the most impressive AI use case you came across this past year?",
        "subreddit": "Entrepreneur",
        "author": "Sure_Marsupial_4309",
        "score": 88,
        "num_comments": 42,
        "created_utc": 1764580439.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pb87iz/what_was_the_most_impressive_ai_use_case_you_came/",
        "fetched_at": "2025-12-02T08:18:43.492878"
      },
      {
        "id": "1pbns8h",
        "title": "Business Owners, are you hosting an employee holiday party this year?",
        "selftext": "In the past few years, it seems company holiday parties have become less popular. What is your experience?\n\nLong ago, I remember attending very nice employee holiday parties, with spouses/partners invited, great food, an open bar, or maybe two \"drink tickets,\" and people would dress up, etc. Is that over?\n\nI don't host an employee holiday party. The costs have gotten relatively expensive, and I don't know if employees want this or expect it anymore. That could be a change since Covid, not sure.\n\nI think many employees focus on \"cash compensation,\" so I have offered more fringe benefits, including an educational assistance plan (capped at $5250 per year, per employee), profit-sharing for retirement fund matching, fair wages, bonuses, service awards, de minimis fringe benefits, etc.\n\n**EDIT:** Thanks for sharing all of the perspectives and experiences. This was enlightening.",
        "subreddit": "smallbusiness",
        "author": "BlizzardBlind",
        "score": 83,
        "num_comments": 95,
        "created_utc": 1764620746.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pbns8h/business_owners_are_you_hosting_an_employee/",
        "fetched_at": "2025-12-02T08:18:48.353961"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 77,
        "num_comments": 53,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-02T08:18:50.171855"
      }
    ]
  }
}