{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-08-26T00:57:11.955052"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-08-26T00:57:03.206772"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-08-26T00:57:03.206779"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-08-26T00:57:02.791606"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-08-26T00:57:02.791599"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-08-26T00:57:02.791588"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-08-26T00:57:03.206775"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-08-26T00:57:03.206777"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-08-26T00:57:02.791604"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-08-26T00:57:03.206760"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-08-26T00:57:02.791608"
      }
    ],
    "reddit": [
      {
        "id": "1mywp7p",
        "title": "I've kept 200 people employed for years. A tariff might end that overnight.",
        "selftext": "Hi guys,I run a company in Vietnam that sells wood materials for furniture manufactures like plywood, MDF, laminated panels, the raw stuff that turns into desks, cabinets, shelves. For years, U.S. buyers have been one of our biggest markets, keeping designers on budget, and honestly keeping my 200+ employees in jobs as well.\n\nNow with all this talk of a 25% tariff on furniture imports, I’m just… exhausted. Others are rushing to front-load shipments now, trying to beat the tariff window. Meanwhile, my workers are asking if hours will be cut, and I don’t even know how to answer them.\n\nWhat makes it worse is, even if these tariffs happen, does anyone really believe thousands of Americans will suddenly want to clock into a cheap furniture factory in North Carolina or Ohio tomorrow morning? We all know the answer. The U.S. makes maybe 20% of its own furniture right now, the rest is imported.\n\nInstead of generating more jobs, this just feels like a tax on everyone: higher prices for U.S. families, canceled orders for exporters like my company, and a ton of uncertainty hanging over small businesses who are already stretched thin.\n\nThis could be the first time trade policy is threatening my entire business. Has anyone else here had orders disrupted or fears of it because of tariffs? How are you preparing? Any suggestions for me? \n\n",
        "subreddit": "smallbusiness",
        "author": "AdHead5088",
        "score": 706,
        "num_comments": 267,
        "created_utc": 1756044889.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1mywp7p/ive_kept_200_people_employed_for_years_a_tariff/",
        "fetched_at": "2025-08-26T00:57:09.210253"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 442,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-08-26T00:57:10.953701"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 274,
        "num_comments": 113,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-08-26T00:57:10.953752"
      },
      {
        "id": "1mq3pt1",
        "title": "I'm Rob, failed at 5 SaaS attempts in 2 years, then built my 6th in stealth for 6 months. Added $1k MRR in 24 hours on launch day. Currently at $3.5k MRR (AMA)",
        "selftext": "Hello fellow SaaS builders. My name’s Rob & I just added $1k MRR in 24 hours after 5 failed attempts.\n\nA couple weeks ago was launch day for my 6th SaaS attempt. After building in stealth for 6 months, I went from $1,600 to $2,500+ MRR in a single day.\n\nI started my SaaS journey 2 years ago. Failed 5 times. Lost money, time, and almost my sanity. But with attempt #6 I did a few things differently.\n\nFirst off, I faced the pain-point myself. Every SaaS \"guru\" preaches build in public, launch fast, get feedback. But launching broken products never worked for me. Too much noise, too many opinions, too much damage to first impressions. So I tried something different.\n\n**My secrets to a successful launch day:**\n\n**Building in “Stealth”:** I still posted publicly, but kept the product private until it was ready.\n\n* Posted screenshots asking \"who wants to try this?\" - no product links\n* DMed interested people to join private beta\n* Got 30 paying users before anyone knew what I was building\n* Their brutal feedback made the product 10x better\n* Built hype so launch day went that much better\n\n**Launch Day Momentum:** When you finally launch, ride the wave HARD.\n\n* Posted a curry selfie celebrating 26 trials → 50,000 views\n* Screenshot PostHog analytics → 20,000 views\n* Screenshot Lemon Squeezy dashboard → 10,000 views\n* Every win becomes content that drives more wins\n\n**Why Photos Matter:** Text gets lost in the AI slop on X. But by showing you are a real human being with a real story, you stop and grab peoples’ attention.\n\n* People root for underdogs (probably you)\n* Authenticity beats polished marketing (especially in AI era)\n\n**The Numbers Game:**\n\n* 70 free trials in 24 hours\n* 50% trial conversion rate (industry average is 15-20%)\n* 200,000+ views on X in 24hrs\n* 95% of traffic from organic X posts\n\nOver 6 months of private beta, I built to $1,600 MRR. Then added $1,000 more in 24 hours. A couple weeks on, I’m at $4,500+ MRR with another 150 trials pending.\n\nAsk me anything about:\n\n* Failing 5 times and what I learned\n* Building in \"stealth\" while still posting publicly\n* Getting 30 people to pay for a private beta\n* Launch day execution\n* Why posting a picture of me eating a curry converted more users than anything else\n\nGoal is $10k MRR well before the end of the year. After 5 failures, it finally feels possible.\n\nHappy to share specific tactics, screenshots, or just commiserate about the SaaS grind :)\n\nLet's gooo!\n\n(I'll be sticking around most of the day to answer questions. And I'll try my best to answer any asked even after today, so don't hesitate to leave your question!)\n\nEDIT: This was a lot of fun, thanks so much for asking all of your questions - there were some really great ones! I'll have to bookmark this myself so I can come back and re-read my answers, since I dropped most of my brain in here today haha. Catch you all next time or on X (hopefully past $10k MRR)! :D",
        "subreddit": "SaaS",
        "author": "robj3d3",
        "score": 183,
        "num_comments": 126,
        "created_utc": 1755184997.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1mq3pt1/im_rob_failed_at_5_saas_attempts_in_2_years_then/",
        "fetched_at": "2025-08-26T00:57:06.000866"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 142,
        "num_comments": 173,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-08-26T00:57:10.953732"
      },
      {
        "id": "1mzm32e",
        "title": "Whats the dark secret in your boss company that you are willing to share?",
        "selftext": "Apparel manufacturing industry. India. Many denim dye uses wastewater from nearby polluted rivers. Now you know why your denim does not feel like your old denim.",
        "subreddit": "Entrepreneur",
        "author": "JDeng78",
        "score": 134,
        "num_comments": 73,
        "created_utc": 1756115134.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1mzm32e/whats_the_dark_secret_in_your_boss_company_that/",
        "fetched_at": "2025-08-26T00:57:04.134351"
      },
      {
        "id": "1mzb3w3",
        "title": "Is having a six figure salary better than being an entrepreneur who gets less?",
        "selftext": "What lifestyle do you all have in mind when pursuing entrepreneurship? Do you actually spend lots of money? If you have the life style, you desire, do you think you could afford it with a six figure 40 hour work week job?",
        "subreddit": "Entrepreneur",
        "author": "Stronglock4081",
        "score": 122,
        "num_comments": 129,
        "created_utc": 1756078568.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1mzb3w3/is_having_a_six_figure_salary_better_than_being/",
        "fetched_at": "2025-08-26T00:57:04.134390"
      },
      {
        "id": "1mzpa1c",
        "title": "Freelancing is just managing expectations you never agreed to",
        "selftext": "I once had a client who bought my $20 website template and said, “It’s mostly done just needs a few personal touches.” Then offered $50 for those changes.\n\nBy “personal touches,” they meant: Changing fonts, Swapping the layout, Rewriting the copy, adding a booking system, integrating a newsletter, making it feel more “premium”\n\nI reminded them it was a template. They said, “Right, but it should still reflect my brand.” I said that would take custom work. They said, “It’s just tweaks.”\n\nSo, I tweaked. And tweaked. And tweaked. Until the template was unrecognizable and I was basically rebuilding the site from scratch. No extra budget. No scope change. Just vibes.\n\nThey loved the final result. Then asked if I could “quickly” design a pitch deck to match the site.\n\nFreelancing isn’t just delivering work. It’s navigating the blurry line between what’s promised and what’s assumed.\n\nAnyone else been there?",
        "subreddit": "smallbusiness",
        "author": "gtrains44",
        "score": 118,
        "num_comments": 78,
        "created_utc": 1756125343.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1mzpa1c/freelancing_is_just_managing_expectations_you/",
        "fetched_at": "2025-08-26T00:57:09.210237"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 102,
        "num_comments": 52,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-08-26T00:57:10.953736"
      },
      {
        "id": "1mz9a74",
        "title": "CEO hiring above original team, pulling work, is this normal? (I will not promote)",
        "selftext": "I was an early swe at a startup that is now growing fast. The CEO is very established in our field and managed to get us enough funding to expand, but I feel uneasy with how this is happening.\n\nThe early employees were all fresh grads from top colleges, I guess because we don’t need sleep and can build an MVP of just about anything given enough caffeine. We’ve done really well but now the hiring strategy is changing. The focus is now on bringing in people with 10+ years of experience in each little section of our project. Basically every new hire is significantly more senior than the original team, and rather than supporting or leading, they are just given our work to take over and we have to go find something else to do. The reasoning is that they “don’t have time to teach, we need to execute.” Sometimes we pitch new features / functionalities and the response is “don’t start that, we’ll hire someone who has done that before”. In many cases we have not been able to find such a person and so the work has been left undone for months.\n\nI guess the feeling is that if we’re just going to hire more experienced people for everything, then what is the point of us grads in the company? Is this normal? Are we going to get fired?",
        "subreddit": "startups",
        "author": "Hopeful-Background91",
        "score": 87,
        "num_comments": 79,
        "created_utc": 1756073896.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1mz9a74/ceo_hiring_above_original_team_pulling_work_is/",
        "fetched_at": "2025-08-26T00:57:07.703950"
      }
    ]
  }
}