{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-01T01:00:37.137614"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-01T01:00:27.877748"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-01T01:00:27.514425"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-01T01:00:27.514412"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-01T01:00:27.877742"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-10-01T01:00:27.877744"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-01T01:00:27.877746"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-10-01T01:00:27.514431"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-01T01:00:27.514428"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-01T01:00:27.877731"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-01T01:00:27.514430"
      }
    ],
    "reddit": [
      {
        "id": "1ntxpyn",
        "title": "I have the #1 top post in r/smallbusiness this month, and it's 100% FAKE.",
        "selftext": "A few days ago, I wanted to see how easy it would be to go \"viral\" on Reddit. So I spent 3 minutes writing a completely fake post about how I ***\"just crossed $1 million in lifetime revenue and have nobody to share it with\"****.* \n\nHere are the results:\n\n* 137K+ views\n* 1.1K+ upvotes\n* 255 DMs received\n\nMoral of the story: Don't believe everything you read on the internet. When you see a crazy post on Reddit (or anywhere for that matter), take it with a grain of salt. Don't get scammed.\n\nEdit #1: Mods removed the original post, but it’s still up on my profile. This new post got even MORE views/upvotes than the original one, so that’s interesting! \n\nEdit #2: The original post is no longer visible on my profile. I guess it disappears shortly after a mod removes it from the subreddit. Only I can see it on my account; others cannot.",
        "subreddit": "smallbusiness",
        "author": "Accomplished_Fish736",
        "score": 1524,
        "num_comments": 207,
        "created_utc": 1759189037.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ntxpyn/i_have_the_1_top_post_in_rsmallbusiness_this/",
        "fetched_at": "2025-10-01T01:00:34.155327"
      },
      {
        "id": "1ntv20k",
        "title": "The weird way I win clients by “losing” negotiations",
        "selftext": "In my software dev shop, I do something most people think is crazy. When a customer bargains, I don’t play the halfway game. If they say, “I want this rate,” and it still keeps me above my 20% margin line, I just say, “done.” No tricks, no drama, just exactly what they asked for.\n\nNow, 20% is the lower end of profit for software development, so technically I’m losing compared to what I could have earned. But here’s the strange part: about half of those clients come back with repeat work almost immediately, the rest circle back later in the year, and referrals pour in because people love telling their friends, “he gave me exactly what I asked for.”\n\nWhen I first started doing this, my wife would overhear me giving these discounts and critique it. Now she just smiles, because she knows I’m not actually losing, I’m buying loyalty.\n\nSometimes the fastest way to win is by losing.",
        "subreddit": "Entrepreneur",
        "author": "richy_vinr",
        "score": 707,
        "num_comments": 166,
        "created_utc": 1759182289.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ntv20k/the_weird_way_i_win_clients_by_losing_negotiations/",
        "fetched_at": "2025-10-01T01:00:28.707095"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 453,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-01T01:00:36.136257"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 173,
        "num_comments": 45,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-01T01:00:36.136282"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 155,
        "num_comments": 49,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-01T01:00:36.136274"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 150,
        "num_comments": 179,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-01T01:00:36.136314"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 114,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-10-01T01:00:36.136320"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 97,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-10-01T01:00:36.136300"
      },
      {
        "id": "1nu8b2f",
        "title": "Entrepreneurs: What’s one thing you wish you had started doing a year earlier in your business?",
        "selftext": "I feel like every entrepreneur has that one thing they look back on and think, \"If I had just started this a year earlier, I’d be in a completely different place right now.\"\n\nIt could be marketing, hiring, building systems, networking, or even something simple like tracking finances better.\n\nCurious to hear from you all- what’s that one-year-too-late move you wish you had made?",
        "subreddit": "Entrepreneur",
        "author": "impetuouschestnut",
        "score": 88,
        "num_comments": 68,
        "created_utc": 1759223314.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nu8b2f/entrepreneurs_whats_one_thing_you_wish_you_had/",
        "fetched_at": "2025-10-01T01:00:28.707093"
      },
      {
        "id": "1lxc97s",
        "title": "Share your startup - quarterly post",
        "selftext": "Share Your Startup - Q4 2023\n\n[**r/startups**](https://www.reddit.com/r/startups/) **wants to hear what you're working on!**\n\nTell us about your startup in a comment within this submission. Follow this template:\n=====================================================================================\n\n​\n\n*   **Startup Name / URL**\n*   **Location of Your Headquarters**\n    *   Let people know where you are based for possible local networking with you and to share local resources with you\n*   **Elevator Pitch/Explainer Video**\n*   **More details:**\n    *   What life cycle stage is your startup at? (reference the stages below)\n    *   Your role?\n*   **What goals are you trying to reach this month?**\n    *   How could [r/startups](https://www.reddit.com/r/startups/) help?\n    *   Do **NOT** solicit funds publicly--this may be illegal for you to do so\n*   **Discount for** [r/startups](/r/startups) **subscribers?**\n    *   Share how our community can get a discount\n\n​\n\n\n\\--------------------------------------------------\n\n​\n\n**Startup Life Cycle Stages** (Max Marmer life cycle model for startups as used by Startup Genome and Kauffman Foundation)\n\n**Discovery**\n\n*   Researching the market, the competitors, and the potential users\n*   Designing the first iteration of the user experience\n*   Working towards problem/solution fit (Market Validation)\n*   Building MVP\n\n​\n\n**Validation**\n\n*   Achieved problem/solution fit (Market Validation)\n*   MVP launched\n*   Conducting Product Validation\n*   Revising/refining user experience based on results of Product Validation tests\n*   Refining Product through new Versions (Ver.1+)\n*   Working towards product/market fit\n\n​\n\n**Efficiency**\n\n*   Achieved product/market fit\n*   Preparing to begin the scaling process\n*   Optimizing the user experience to handle aggressive user growth at scale\n*   Optimizing the performance of the product to handle aggressive user growth at scale\n*   Optimizing the operational workflows and systems in preparation for scaling\n*   Conducting validation tests of scaling strategies\n\n​\n\n**Scaling**\n\n*   Achieved validation of scaling strategies\n*   Achieved an acceptable level of optimization of the operational systems\n*   Actively pushing forward with aggressive growth\n*   Conducting validation tests to achieve a repeatable sales process at scale\n\n​\n\n**Profit Maximization**\n\n*   Successfully scaled the business and can now be considered an established company\n*   Expanding production and operations in order to increase revenue\n*   Optimizing systems to maximize profits\n\n​\n\n**Renewal**\n\n*   Has achieved near-peak profits\n*   Has achieved near-peak optimization of systems\n*   Actively seeking to reinvent the company and core products to stay innovative\n*   Actively seeking to acquire other companies and technologies to expand market share and relevancy\n*   Actively exploring horizontal and vertical expansion to increase prevent the decline of the company",
        "subreddit": "startups",
        "author": "julian88888888",
        "score": 72,
        "num_comments": 627,
        "created_utc": 1752253287.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1lxc97s/share_your_startup_quarterly_post/",
        "fetched_at": "2025-10-01T01:00:32.391747"
      }
    ]
  }
}