{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-22T16:15:59.622195"
  },
  "data": {
    "youtube": [
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-22T16:15:51.199979"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-10-22T16:15:50.827210"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-22T16:15:50.827203"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-22T16:15:50.827189"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-22T16:15:51.199975"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-10-22T16:15:51.199981"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-22T16:15:51.199977"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-22T16:15:50.827206"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-22T16:15:51.199965"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-22T16:15:50.827208"
      }
    ],
    "reddit": [
      {
        "id": "1oco86r",
        "title": "Finally bit the bullet and switched to appointment only after 3 years of walk ins destroying my schedule",
        "selftext": "I run a small alterations shop in Austin and honestly I dont know why I waited this long to do this. For three years I kept walk in hours because I thought thats what customers wanted and I was terrified of losing business.\n\nThe reality was way different tho. Id have people walk in right when Im in the middle of a hem on a wedding dress, or Id block out time to finish rush orders and then spend 45 minutes with someone who just wanted to ask if I could fix their jacket zipper (which I dont even do). My actual turnaround times were getting worse because I couldnt focus.\n\nI spent like two months researching what other alterations places were doing, talked to my regular customers, even checked polymarket to see what the recession odds were since I was worried people would stop spending on alterations if the economy tanked. But mostly I just tracked my own numbers for a month and realized that 60% of walk ins either didnt book anything or wanted services I dont offer.\n\nMade the switch to appointment only in September. Put up signs, updated my google business, sent emails to my regular clients. First week I was stressed as hell thinking my phone would stop ringing.\n\nOpposite happened. My schedule is actually FULLER now because people book in advance and I can plan my day properly. Im finishing work faster, taking on more jobs, and honestly my stress levels dropped like crazy. Plus the clients who book appointments tend to be more serious and respectful of my time.\n\nOnly downside is I do get the occasional person who shows up anyway and gets annoyed when I cant help them right then. But honestly thats on them for not reading the giant sign on my door lol\n\nIf youre on the fence about this just do it. Track your numbers first so you know what youre actually dealing with but dont wait as long as I did.",
        "subreddit": "smallbusiness",
        "author": "AntsyAdjustment",
        "score": 627,
        "num_comments": 36,
        "created_utc": 1761078848.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oco86r/finally_bit_the_bullet_and_switched_to/",
        "fetched_at": "2025-10-22T16:15:56.847983"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 469,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-22T16:15:58.620806"
      },
      {
        "id": "1occcsn",
        "title": "How I turned eBay flips into a $3k/month side hustle",
        "selftext": "I started messing with eBay just to test the waters where I bought some electronics like mac books or watches and trading cards to see what would sell. I didn’t have a plan just curiosity and a few late nights spent looking into multiple listings.  \n  \nI began to notice patterns. Certain categories like electronics and collectibles sold quicker and had better margins. I started tracking what sold best, improving my listing descriptions , and focusing more on things like PC laptops, video cards, and even men’s shoes.  \n  \nOnce I found what was working the income became steady. It now brings in around $3k a month which still amazes me considering how it all started. But everybody has to start somewhere I guerss.  \n  \nStill learning as I go but thought Id share it here to inspire others. For those who tried it which products or niches did better for yo??",
        "subreddit": "Entrepreneur",
        "author": "Altruistic_Wind9167",
        "score": 331,
        "num_comments": 116,
        "created_utc": 1761051756.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1occcsn/how_i_turned_ebay_flips_into_a_3kmonth_side_hustle/",
        "fetched_at": "2025-10-22T16:15:51.926204"
      },
      {
        "id": "1od7j5k",
        "title": "Finally stopped offering discounts “just to be nice”",
        "selftext": "I used to give random discounts to almost everyone who asked. “It’s fine, I’ll just take a little less,” I’d tell myself, thinking it would help me keep customers happy.\n\nAll it did was make me tired and broke. The people who haggled the most were also the hardest to please.\n\nLast month I stopped. I stuck to my prices and said, “Sorry, that’s the rate.” You know what happened? Almost no one left. In fact, I got more respect, faster payments and fewer headaches.\n\nThe people who value your work will never argue over the price ",
        "subreddit": "smallbusiness",
        "author": "Wrong_Review276",
        "score": 237,
        "num_comments": 31,
        "created_utc": 1761137805.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1od7j5k/finally_stopped_offering_discounts_just_to_be_nice/",
        "fetched_at": "2025-10-22T16:15:56.847981"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 178,
        "num_comments": 49,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-22T16:15:58.620856"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 169,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-22T16:15:58.620851"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 168,
        "num_comments": 123,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-22T16:15:58.620821"
      },
      {
        "id": "1occq8r",
        "title": "When your small business starts growing how do you stay in control without becoming the money police?",
        "selftext": "I run a small team, five people, growing fast tho and I’m struggling to balance trust with structure.  \nEveryone’s great at their job but the moment we started giving out cards and budgets the gray areas showed up fast. Its not like anyone’s spending irresponsibly but receipts get missed, invoices go unpaid and small purchases slip through the cracks. I dont want to micromanage or slow people down but I also cant keep cleaning things up after the fact. For business owners who’ve been through this how do you set up a process that keeps things transparent without making it feel bureaucratic?  \nDid you create rules, use tools, or just learn to live with a bit of mess?",
        "subreddit": "smallbusiness",
        "author": "ThePositiveSediment",
        "score": 156,
        "num_comments": 47,
        "created_utc": 1761052707.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1occq8r/when_your_small_business_starts_growing_how_do/",
        "fetched_at": "2025-10-22T16:15:56.848009"
      },
      {
        "id": "1oclqbu",
        "title": "How realistic are business simulation games, really?",
        "selftext": "For example, I’m playing Tabletop Game Shop Sim, and I understand that in real life things probably aren’t this straightforward but conceptually, is it accurate? I imagine real-world logistics are far more complex; inventory doesn’t magically appear at your doorstep instantly, but that’s just a gameplay abstraction.\n\nRoughly speaking, if the game says daily operating costs for a small shop are around $200-300, how close is that to reality?",
        "subreddit": "smallbusiness",
        "author": "Pro_Farnsworth_",
        "score": 102,
        "num_comments": 10,
        "created_utc": 1761073286.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oclqbu/how_realistic_are_business_simulation_games_really/",
        "fetched_at": "2025-10-22T16:15:56.847993"
      },
      {
        "id": "1ocq3o5",
        "title": "I paid 2 influencers on LinkedIn to promote my SAAS : here’s what $500 got me",
        "selftext": "Today, I ran a small experiment:\n\nI paid two LinkedIn influencers to promote my SaaS.\n\nI’ll share everything : prices, process, results, etc\n\n🎯 Why I did it\n\nLinkedIn is already my best acquisition channel.\n\nSo I thought: instead of posting only on my own profile, what if I leveraged other people’s reach?\n\n🔍 Step 1: Picking influencers\n\nThere are two types:\n\nNiche experts : small but ultra-qualified audience\n\nViral creators : huge reach, lower precision\n\nI went with the second type:\n\n• One French influencer (for the francophone market)\n\n• One Turkish influencer (posting in English)\n\nTotal budget: $500 for 2 posts (one each).\n\nI wrote the posts myself and validated their visuals.\n\nTo find them, I simply looked for influencers who had already done sponsored posts for competitors.\n\nThen I went into their DMs and talked to dozens of people until I had pricing grids, reach estimates, and finally made my choice.\n\n⚙️ Step 2: The process\n\nEach time someone commented, the influencer replied with a Notion resource (lead magnet).\n\nThe goal of the influencers’ posts was to generate as many comments as possible, the more comments, the more reach; the more reach, the more people see the post.\n\nI asked the influencers to reply to every single comment with a Notion link, so even people who didn’t comment would see the link when scrolling through the comments, and end up clicking on it.\n\nInside that page, I linked to:\n\n→ My SaaS trial\n\n→ A “book a demo” CTA\n\nThe French influencer customized the Notion page.\n\nThe English one used a generic version.\n\nBoth performed well, but personalization clearly helped engagement.\n\nThe influencer’s goal is to bring as much visibility and engagement as possible to the post.\n\nInside the Notion page, of course, I provide a ton of value, exactly what people commented for.  \nThe idea is to flood them with so much value that they think:  \n“Wow, if this is free, I can’t even imagine what I’d get if I paid.”\n\n📈 Step 3: The results (after 10h)\n\n• $500 spent (2 posts live)\n\n• 18 trials (card added)\n\n• 50+ new signups\n\n• 9 paid conversions expected (≈$990 MRR)\n\n• 5 demo calls booked (large sales teams: 10–30 reps each)\n\nThat means I’ll likely recover my $500 within a week,\n\nand everything after that is pure profit.\n\nPlus, the posts keep bringing impressions and future traffic.\n\n🔁 Step 4: What’s next\n\nThis worked insanely well.\n\nNext step → scale it with more influencers in different niches.\n\nIf I could run this every day, I would.\n\nIf you want to check : [Here is a doc](https://www.notion.so/LInkedIn-Influencer-s-results-293b9abcbe3f8099afa5ef2c5b1f4fe8?source=copy_link) with links to both posts + notion exemple\n\nCheers !",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 100,
        "num_comments": 47,
        "created_utc": 1761083200.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ocq3o5/i_paid_2_influencers_on_linkedin_to_promote_my/",
        "fetched_at": "2025-10-22T16:15:53.541242"
      }
    ]
  }
}