{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-23T08:15:10.956089"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-23T08:15:00.828018"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-23T08:15:00.457394"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-23T08:15:00.457396"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-23T08:15:00.457379"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-23T08:15:00.828015"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-23T08:15:00.828022"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-23T08:15:00.828020"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-23T08:15:00.457402"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-23T08:15:00.828001"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-23T08:15:00.457398"
      }
    ],
    "reddit": [
      {
        "id": "1p3cdwi",
        "title": "Being a entrepreneur - designing a site myself with control or finding trusted designers?",
        "selftext": "I started freelancing as a photographer in Austin last month and realized having a proper site is way more important than I thought since some of the commercial artists I know have websites. Word of mouth isn't cutting it for me . Spent hours googling \"small business designers” (forgot to include WEB , smh).. but reviews are all over the place it seems. Did anyone else have this problem when they were first getting set up? How did you finally decide which one to use?\n\nmaestrosites looks interesting but its trustpilot barely has any reviews. How do small business owners typically decide which web designer to use?",
        "subreddit": "Entrepreneur",
        "author": "BrainPuzzled9987",
        "score": 517,
        "num_comments": 40,
        "created_utc": 1763764060.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p3cdwi/being_a_entrepreneur_designing_a_site_myself_with/",
        "fetched_at": "2025-11-23T08:15:02.857860"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 480,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-23T08:15:09.954721"
      },
      {
        "id": "1p3wziz",
        "title": "We've been paying a contractor 1.5k for 10 months after he stopped working for us",
        "selftext": "I was reconciling our books this weekend (because our finance person quit) and I noticed we’ve been sending monthly payments to a freelance designer who hasn’t delivered anything since January\n\nI messaged him asking if we hired him for something recently and we've forgotten because you've been receiving monthly payments and he said no because (based on his words) I finished that logo project in January. He assumed that we just wanted to keep him on retainer so he didn’t say anything  \nFirst of all retainer is CRAZY. He just kept getting paid because nobody turned off the recurring payment when the project ended!!!!  \nI checked with the team and everyone thought someone else was still using him for stuff. We’re 24 people like how does something like this even happen?\n\nApparently he’s been receiving 1.5k every month for 10 months and figured we knew what we were doing which honestly fair cuz that’s on us not him  \nThe worst part is he’s a nice guy and offered to pay some of it back but like legally that’s our fuckup not his. We just gave him $15k for nothing because nobody communicated...........\n\nHow do you deal with this if you don't have a proper financial team set up?",
        "subreddit": "smallbusiness",
        "author": "SadAlternative2422",
        "score": 330,
        "num_comments": 140,
        "created_utc": 1763827851.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p3wziz/weve_been_paying_a_contractor_15k_for_10_months/",
        "fetched_at": "2025-11-23T08:15:08.158085"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 185,
        "num_comments": 133,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-23T08:15:09.954779"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 181,
        "num_comments": 35,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-23T08:15:09.954764"
      },
      {
        "id": "1p3zovd",
        "title": "I just sold my startup for $980M and I’m still in the womb (breakdown included)",
        "selftext": "Hey everyone! This is John (9 months old)  \n  \nTyping this from inside my temporary studio apartment (aka my mom).\n\nDoctor says I’m crowning soon, so I’ll keep this brief.\n\n# How it started:\n\nAround Week 14, I overheard my parents arguing about hospital bills.  \nMassive market gap detected:  \n  \n**Prenatal financial anxiety is severely underserved.**\n\n# Launching the product:\n\nI deployed v1 during a routine ultrasound.  \nThe technician accidentally saw my dashboard and said “this is better than what our hospital uses.”\n\nBoom: first enterprise client.  \nACV: $12M + free applesauce post-birth.\n\nI slapped a Stripe link on the heartbeat monitor.  \nARR started climbing faster than my amniotic fluid levels.\n\n# Here’s what I learned (3 steps):\n\n1. **Solve real pain.** Expecting parents will spend $400 on a vibrating crib - they will definitely pay for predictive kick analytics.\n2. **Move stupid fast.** The window between morning nausea and afternoon cravings is TINY. Ship before the hormones ship you\n3. **Know when to exit.** I got in contact with a Fortune 500 medical supplier with a $980M offer. I accepted so I could focus on being born.\n\n# What’s next?\n\nProbably learning to open my eyes.  \nMaybe a seed round after that.\n\nAnyway, I hear the doctor saying “push,” so I gotta dip.\n\nAMA once I have fingers.\n\n\\- John | *Fetus, 0*",
        "subreddit": "SaaS",
        "author": "Ok-Series-4597",
        "score": 167,
        "num_comments": 35,
        "created_utc": 1763834315.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p3zovd/i_just_sold_my_startup_for_980m_and_im_still_in/",
        "fetched_at": "2025-11-23T08:15:04.842300"
      },
      {
        "id": "1p3vvmc",
        "title": "hit £31k on gumroad in 3 months selling digital products + ebooks with zero audience and no money",
        "selftext": "so i just hit £31k on gumroad in 3 months and the whole thing started because i was tired of waiting to build an audience first\n\neveryone says grow your instagram or start a newsletter before you sell anything. i just went straight to selling and figured out the audience part later\n\nthe method was kinda backwards but it worked. i went on reddit and twitter and found people complaining about specific problems. not general stuff like i want to make money but specific like i dont know how to organise my content calendar or i need email templates for my consulting business\n\nthen i made exactly that. like word for word what they said they needed\n\ni didnt make some massive course or 100 page ebook. i made small specific digital products. notion templates. canva kits. plug and play stuff people could use in 10 minutes. priced them between £9 and £27\n\nfirst product took me maybe 6 hours to make. launched it in a reddit comment where someone literally asked for that exact thing. made £180 the first week and i was buzzing\n\nthe thing with gumroad is you dont need traffic if your product shows up when people search for it. their discover page actually works if you nail your title and description with the exact words people type\n\nalso i tested the same products on different gumroad accounts for different niches. one for productivity stuff. one for creative templates. one for business tools. keeps everything organised and lets me see what actually sells vs what i think should sell\n\nnow i have like 8 products across a few accounts and some months hit £12k some hit £8k. this month was £31k which is wild\n\nthe biggest thing i learned is people dont buy solutions to big problems. they buy solutions to the annoying small problem theyre dealing with right now\n\nhonestly though now im at this point and its getting messy. managing multiple accounts and customer emails is taking up so much time. im terrible at the automation side of things and i know im leaving money on the table because i cant scale properly\n\nanyone here whos further along than me. how are you handling fulfilment and customer support without it taking over your life. like what tools or systems actually work because im drowning in admin stuff and i know theres a better way to do this",
        "subreddit": "Entrepreneur",
        "author": "dumbl3d00r",
        "score": 127,
        "num_comments": 60,
        "created_utc": 1763825088.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p3vvmc/hit_31k_on_gumroad_in_3_months_selling_digital/",
        "fetched_at": "2025-11-23T08:15:02.857820"
      },
      {
        "id": "1p3so21",
        "title": "I cannot get rid of the feeling that I am exploiting my employees for profit",
        "selftext": "I own a tutoring company and pay my tutors 60% more than our biggest competitors, so a really attractive and fair wage. Competitors tutors get paid only about 25% of what the parents/student pay for their lessons, while my tutors get about 55%. \n\nFor more context, I pay them 50% above the average hourly wage in my country. Most of my tutors are university students, so having full flexibility over their time and this high of a pay while working from home is amazing.\n\nBecause of that, even my competitors tutors are applying for a position at my company\nOut of what I have left after I pay them, I need to pay for everything else: marketing, accounting, software... you know the drill. I have barely enough for myself. \n\nI also teach my own student. They pay me 2-3x what I pay my own tutors. From the money I earn, I pay my rent, most basic necessities (phone, internet, gym), and everything else goes back into my business, so basically I am not earning anything from my business (I put more in than I get out) - even though I work pretty much all day every day (only had one day off since august)\n\nI also try to treat my tutors the best I can - I often ask them if there is anything they need, such as dealing with a bad student, stress, time management, or new features in our internal system, which I am also developing on my own.\n\nI can objectively say that I treat and compensate my tutors way better than they would be treated if they worked for our competitors. But I still have the feeling that I am exploiting them for my own profit (even though they make more money out of my business than I do)\n\nHas anyone experienced anything similar? Is this guilt just a product of anticapitalistic propaganda?",
        "subreddit": "Entrepreneur",
        "author": "Bradzu",
        "score": 96,
        "num_comments": 161,
        "created_utc": 1763816448.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p3so21/i_cannot_get_rid_of_the_feeling_that_i_am/",
        "fetched_at": "2025-11-23T08:15:02.857823"
      },
      {
        "id": "1p3l352",
        "title": "finally done shutting down my business and honestly it's such a relief",
        "selftext": "I closed my Delaware LLC last week and I can finally breathe, like actually breathe for the first time in months.\n\nI started this business with my partner, we had this whole vision but... it just didn't work out… wasn’t a dramatic failure story, we just couldn't make the numbers work and kept bleeding money until we made the call to shut down and heck saying goodbye to something you built hurts no matter what…. But we had to let go and I thought it'd be quick, maybe a few weeks of paperwork to get it down but wow was I wrong like nobody warned me about the actual shutdown part like you spend all this energy building something and then when it's time to close it down you're just... exhausted already, uk? And then Delaware needs this form, IRS needs that form, you're chasing down old contracts you forgot existed, a software subscription still charging u monthly, and man let me tell you this but every time I thought we were done, something else popped up. And I had to endure this for 2 months. Two whole months of this, two months of feeling like I couldn't move forward because I was stuck dealing with the past. My partner checked out emotionally pretty early, so most of it fell on me to the point where there were days I just wanted to walk away from the whole thing but kept thinking about what happens if I miss something important, what if Delaware keeps billing me or we get sued years from now because I didn't file something right.\n\nBut yeah, it's over now. Really over. And I'm sitting here feeling this weird mix of sad and relieved and tired and kind of excited? Like I can finally think about what's next without this thing hanging over me.\n\nI’m not sure what to do next tbh, I might start something new eventually, might just work for someone else for a while and not think about any of this.\n\nAnyway, I just wanted to share because I see a lot of startup content but nobody really talks about this part it's messy and it sucks and it costs more than you think but you get through it eventually",
        "subreddit": "smallbusiness",
        "author": "supersaiyanvivek83",
        "score": 94,
        "num_comments": 24,
        "created_utc": 1763788847.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p3l352/finally_done_shutting_down_my_business_and/",
        "fetched_at": "2025-11-23T08:15:08.158124"
      },
      {
        "id": "1p3q7ut",
        "title": "The “All In Tech Bro” Lifestyle idolization needs to STOP.",
        "selftext": "Every week it’s the same shit.\n\n“Finally quit my 9-5, all in on the startup, no boss, living life on my terms.”\n\nThen the comments are all the same flex, dudes bragging about “16-18 hour days for months straight”, “sleep is for after we make it”, “haven’t taken a real day off since launch”, “who needs structure when you’re building something big.”\n\nShut the fuck up.\n\nThat shit is a one-way ticket to a total meltdown. You spike hard for 6-12 months, maybe make some money, then you crash so hard you can’t even open your laptop without wanting to puke. You end up sleeping till 3 pm, eating garbage, zero motivation, looking back wishing you’d just kept a normal schedule.\n\nJust wake up at 8, shower, eat, coffee, start at 9. Work till noon, take a break, eat lunch, work till 5-6, close the computer. You still ship, you still get paid, you don’t hate your life.\n\nYou’re not Elon. Stop waking up at 2 pm, coding till 6 am, and pretending that chaos is the path. It’s just burnout with extra steps.\n\nAnyone else sick of this burnout worship bullshit or is it just me? This crap needs to stop getting promoted. I understand the early days of a business are nothing but grinding, but again, you need to be calculated or be prepared to deal with the inevitable burnout. \n\n",
        "subreddit": "SaaS",
        "author": "DaisySunFlowers6372",
        "score": 75,
        "num_comments": 17,
        "created_utc": 1763808076.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p3q7ut/the_all_in_tech_bro_lifestyle_idolization_needs/",
        "fetched_at": "2025-11-23T08:15:04.842311"
      }
    ]
  }
}