{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-13T08:17:47.082064"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-13T08:17:37.809038"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-13T08:17:37.809040"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-13T08:17:37.412943"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-13T08:17:37.412948"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-13T08:17:37.412929"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-13T08:17:37.809033"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-13T08:17:37.809036"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-13T08:17:37.412945"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-13T08:17:37.809020"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-13T08:17:37.412947"
      }
    ],
    "reddit": [
      {
        "id": "1o4jup6",
        "title": "i audited 47 failed startups codebases and the pattern is actually insane",
        "selftext": "ok so for context ive been doing this for about 3 years now. startups bring me in when shit hits the fan - not the \"we ran out of money\" fan, the \"our product literally cannot scale and we have no idea why\" fan\n\nand theres this pattern that shows up EVERY. SINGLE. TIME.\n\nmonth 1-6: everything is great. moving fast, shipping features, customers are happy, lifes good\n\nmonth 7-12: things start slowing down. weird bugs popping up. \"we'll fix it later\" becomes the team motto\n\nmonth 13-18: you literally cannot add a new feature without breaking 3 old ones. every deploy is stressful\n\nmonth 19-24: youve now hired 3 more engineers and theyre just maintaining the existing mess. not building anything new\n\nmonth 25+: rebuild from scratch or watch your startup die in slow motion\n\n**what i found in those 47 codebases:**\n\nlike 89% had zero database indexing. ZERO. your app is slow because youre searching through 100,000 records on every single request. thats not a bug thats just... why\n\n76% were paying for like 8x more servers than they needed. the average is 13% utilization - youre paying for 100 servers and using 13 of them. burning $3k-15k a month for nothing\n\n68% had auth vulnerabilities that would make any security person have a panic attack\n\n91% had no automated tests at all. so every new feature is literally russian roulette\n\n**the math on this is depressing:**\n\navg engineer salary is like $120k right stripe did research showing devs spend 42% of time dealing with bad code so for a team of 4 over 3 years thats $600k+ just... wasted. on maintaining garbage then add $200-400k to rebuild plus 6-12 months of lost revenue during the rebuild total damage per company: $2-3M\n\nand founders dont realize until month 18-24. by then youve raised series A based on growth that is about to completely fall apart\n\n**what actually prevents this:**\n\nhonestly just spend 2 weeks on architecture before writing code. i know its boring and you wanna ship fast but those 2 weeks save you 18 months of hell\n\nthink \"what breaks at 10,000 users\" not \"what works for 100 users\" - your db queries, file uploads, background jobs, everything needs to handle 100x day one\n\nautomate tests from the start. if you cant click one button and know nothing broke youre just gambling\n\npick boring tech. react/node/postgres is boring and thats GOOD. you can hire for it, theres stackoverflow answers, it doesnt randomly die at 2am\n\nget someone whos done this to review your architecture in WEEK ONE. not month 12 when its too late\n\n**the part nobody wants to hear:**\n\nmost technical cofounders and first eng hires are really good at coding but have never architected something that scales. its like being a great cook but never running a restaurant kitchen during dinner rush\n\nreal example from last month - saas company spending $47k/month on aws\n\ni did a 3 day review and found:\n\n* running 40 servers when they needed 6\n* storing files in literally the most expensive way possible\n* db queries taking 4 seconds that should take 40 milliseconds\n\nnew bill: $8,200/month\n\nthey saved $38,800 PER MONTH. thats $465k a year. for 3 days of work.\n\n**why im posting this**\n\nbecause im tired of watching founders burn 18 months and $500k-2M learning lessons that are completely avoidable\n\n\"move fast break things\" works when youre facebook with unlimited money. for your startup its just suicide\n\n**if youre building something right now ask yourself:**\n\n* what breaks at 10x current users?\n* do you have automated tests?\n* can your db handle 100x the queries?\n* would your infrastructure cost $50k/month at 10k users?\n\nif you said \"i dont know\" to any of these youre building on quicksand\n\nhappy to answer questions about tech stack or architecture stuff in comments. ive seen this movie too many times. \n\nMeir Avimelec Davidov (You can search me over linkedin)  \nFounder & CEO of gliltech software",
        "subreddit": "Entrepreneur",
        "author": "MeirDavid",
        "score": 2074,
        "num_comments": 212,
        "created_utc": 1760258094.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o4jup6/i_audited_47_failed_startups_codebases_and_the/",
        "fetched_at": "2025-10-13T08:17:38.558461"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 462,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-13T08:17:46.080690"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 175,
        "num_comments": 48,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-13T08:17:46.080722"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 168,
        "num_comments": 54,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-13T08:17:46.080716"
      },
      {
        "id": "1o50jhl",
        "title": "You don't need a business plan, you need three paying customers",
        "selftext": "Every week someone posts here asking for feedback on their 47-page business plan. Complete with projected revenue charts for year five and a detailed organizational structure for the executive team they'll hire... someday.\n\nMeanwhile, they haven't talked to a single potential customer.\n\nLook, I get it. Writing a business plan *feels* productive. It's concrete. You can show your parents and they'll nod approvingly. But it's also the world's most elaborate procrastination technique.\n\nHere's the thing - your business plan is going to be wrong. Not slightly off. *Catastrophically* wrong. Because you're essentially writing fiction about a market you haven't actually entered yet.\n\nWant to know if your idea works? Find three people who will pay you money for it. Not \"yeah that sounds cool\" people. Not your cousin who promises to buy it when you launch. Actual humans who open their wallets.\n\nThose three customers will teach you more in a week than six months of planning ever could. They'll tell you what features actually matter, what price point works, and which of your assumptions were completely backwards.\n\nThe business plan can come later, after you've proven someone actually wants what you're selling. Until then, you're just writing expensive fan fiction about your own startup.\n\nAm I wrong, or are we all just allergic to actual validation?",
        "subreddit": "Entrepreneur",
        "author": "JFerzt",
        "score": 130,
        "num_comments": 48,
        "created_utc": 1760302620.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o50jhl/you_dont_need_a_business_plan_you_need_three/",
        "fetched_at": "2025-10-13T08:17:38.558466"
      },
      {
        "id": "1o4mn9f",
        "title": "Investment banker here. $14B in total transactions raised $128M in 3 weeks. Here's how you close investors",
        "selftext": "I'm Louis Garoz. I run an investment bank called Kadenwood Capital. Me and my team have closed $14 billion in aggregate transaction volume - everything from $10M early-stage rounds to billion-dollar fund formations.\n\nLast July, we closed a $128M deal within weeks of launching the firm.\n\nFirst time on Reddit. Figured I'd drop some value here since I see a lot of founders struggling with fundraising. I talk to VCs, PE firms, and family offices every day. I see what makes them write checks and what makes them pass.\n\n96% of raises fail, and most of it comes down to not understanding what investors actually want. So here's what I'm telling founders based on what the market is asking for right now.\n\nHere's what actually works:\n\nBefore You Even Start - The 5 Must-Haves\nMiss even one and you're wasting time:\n\n1. Real product that exists today (not an idea)\n2. Specific customers you can name (not \"everyone\")\n3. Something defensible (patent, exclusive deal, unique data)\n4. Real traction (revenue, pilots, committed investors)\n5. Path to $200M+ in revenue\nMost deals fail 3 of these. If yours does too, fix it before pitching.\n\nWhy Your Pitch Isn't Working\nNormal sales: Customer talks 80%, you listen and solve their problem.\n\nInvestor pitch: YOU talk 80%, because they don't even know the problem exists yet.\n\nYou're educating them, not discovering their needs. Completely flipped.\n\nThe Email That Gets 8% Opens (vs 1% average)\nSubject line: \"3M ARR SaaS [what it does] - Raising $15M Series A\"\n\nBody (4 lines):\n\n1. Your best credential (YC, notable investor, founder's track record)\n2. Your traction (20% growth MoM, 50 enterprise clients)\n3. Your edge (exclusive partnership, first-mover)\n4. \"Can we chat for 15 min?\"\nNo hype words. Just facts. That's it.\n\nThe Pitch Structure\n1. Why you're credible (past wins, expertise)\n2. How you found this problem\n3. The problem with real numbers\n4. Why existing solutions suck\n5. Your unique insight nobody else sees\n6. Your solution with proof it works\n7. Market size (build from bottom-up, never top-down)\n8. Why you need money NOW\nStop Sending \"Just Checking In\" Emails\nEvery follow-up needs something new:\n\n● Day 0: Send 1-page teaser\n● Day 3: More metrics\n● Day 7: New milestone (customer win, partnership)\n● Keep going every week with real updates\nAlways give them a reason to reply.\n\nThe Actual Call\n● 2 min: Quick intro\n● 5 min: Ask what they're looking for (check size, timeline, focus areas)\n● 10 min: Walk through your pitch\n● 5 min: Answer questions\n● 3 min: Set next steps (NDA, data room access, another call)\nResearch their last 10 deals before you get on the call.\n\nBiggest Mistakes\n● Saying yes to any client who pays you\n● Using the same pitch for VCs, PE firms, and family offices (they want different things)\n● Sending 1000 emails from your Gmail (you'll kill your domain)\n● Pitching something you don't actually believe in\nLook, there's more capital in circulation right now than most founders realize. VCs raised record funds in 2024, PE firms are sitting on billions in dry powder, and family offices are actively looking for deals.\n\nThe money is there. The problem isn't availability - it's that most founders don't know how to position their deal in a way that makes investors actually want to move.\n\nIf you have real traction and a defensible business, 2025 is one of the best times to raise. You just need to speak their language and show them what they want to see.\n\n \n\n ",
        "subreddit": "SaaS",
        "author": "luis_garoz",
        "score": 103,
        "num_comments": 31,
        "created_utc": 1760268519.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o4mn9f/investment_banker_here_14b_in_total_transactions/",
        "fetched_at": "2025-10-13T08:17:40.385908"
      },
      {
        "id": "1o4b9dl",
        "title": "I’ve been stuck at $200k in revenue for three years now",
        "selftext": "It’s becoming very frustrating. My buddy and I started this business from nothing, and it felt like we would be well off fairly quickly. Our first full year, we hit almost 200k. Seemed like the sky was the limit. We make a product and sell both online and in person. We also have a storefront/production facility. \n\nOur online sales grew consistently until they peaked at 10k in March. They’ve since stabilized around 30% below that. We’ve released new products, explored other markets, and maintained consistent presence where we’ve had success. Yet we seem to lose a customer for every one we gain. \n\nI always thought gaining the initial customers would be the hardest part of running a business. For the third year in a row, I’ve been proven wrong. Any advice for growing beyond this point? I’m in the wellness sector",
        "subreddit": "smallbusiness",
        "author": "whocaresthrowa",
        "score": 101,
        "num_comments": 92,
        "created_utc": 1760228859.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o4b9dl/ive_been_stuck_at_200k_in_revenue_for_three_years/",
        "fetched_at": "2025-10-13T08:17:43.866297"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 101,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-10-13T08:17:46.080740"
      },
      {
        "id": "1o4k7ew",
        "title": "Most people posting revenue screenshots are lying",
        "selftext": "Every day I see the same posts. \"$100k MRR in 6 months!\" with a blurry Stripe dashboard. \"From 0 to $1M ARR!\" with conveniently cropped screenshots.\n\nI've been running online businesses for years. I know people making real money. None of them are posting about it on Reddit.\n\nThe ones killing it are too busy actually working. They're dealing with customer support tickets, fixing bugs, negotiating with suppliers or just trying to keep their head above water as they scale.\n\nMeanwhile, the loudest voices online are usually:\n\n* Selling courses on how to make money (their actual business)\n* Inflating numbers by counting gross revenue instead of profit\n* Showing one good month and pretending it's consistent\n* Straight up lying for engagement\n\nI fell for this early on. Felt like a failure because I wasn't hitting these crazy numbers everyone else seemed to reach effortlessly. Spent months feeling inadequate because my business was \"only\" making $3k/month.\n\nThen I met some of these \"successful\" people at conferences. The guy with \"$50k MRR\"? Living with his parents. The woman with the \"7-figure agency\"? That was gross revenue across 3 years, not annual. After expenses and taxes, she was making less than a corporate job.\n\nHere's what real business growth looks like:\n\n* Year 1: Losing money, everything breaks, you question everything\n* Year 2: Maybe breaking even, still everything breaks\n* Year 3: Small profit, things break less often\n* Year 4: Decent profit if you haven't quit\n\nThe sustainable businesses making good money took years to build. The owners aren't posting screenshots. They're boring businesses solving boring problems.\n\nStop comparing yourself to these people online. Most of it's fake anyway. The real entrepreneurs are too busy building to post about it.\n\nFocus on your customers. Make something people actually pay for. Let everyone else focus on the screenshots.\n\nYour competition isn't as far ahead as they claim to be :)",
        "subreddit": "Entrepreneur",
        "author": "notdl",
        "score": 77,
        "num_comments": 18,
        "created_utc": 1760259469.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o4k7ew/most_people_posting_revenue_screenshots_are_lying/",
        "fetched_at": "2025-10-13T08:17:38.558492"
      },
      {
        "id": "1o54ogh",
        "title": "Tired of this sh**, another \"AI Powered app\" nobody asked for. [I will not promote]",
        "selftext": "Sorry for the bad words, but I'm really tired of this bs, Everywhere I look at is the same story, startups building software with (to the surprise of nobody) AI features.  \n  \nHave our brains stopped working after the release of GPT? I have seen all kind of application: to manage finances with AI, apps to build applications with AI (aghh this is the most common one 🤢🤮), apps to sumarize emails, meetings, conversations, apps to generate content for social media with... AI, chatbots for every possible niche, AI productivity tools, AI employees, oh man, I can continue listing more of this \"AI powered\" apps for the whole day.\n\nWhy is nobody intereted in solving the real problems of the world ? \n\nWhat about\n\n\\- The millions who still don’t have access to clean water, education, or even a sense of hope?  \n\\- The families that can’t afford healthcare ?  \n\\- The informal workers who live day to day without healthcare, without social security, without any kind of protection ?  \n\\- The **housing problem**, where owning a home feels like an impossible dream \n\nAnd you know what frustrates me the most ? that this so-called \"AI startups\", most of what they do is just use the chatgpt API, like c'mon they don’t even know what a machine learning model is, what deep learning actually means, what a transformer architecture does or what regularization or overfitting even are.\n\nI wonder how many of these AI apps ideas born from a conversation with chatGPT\n\nI don’t have the answers, and maybe I’m just expressing my frustration, but how many of you feel the same way I do ?   \n  \n ",
        "subreddit": "startups",
        "author": "Loque18-",
        "score": 65,
        "num_comments": 38,
        "created_utc": 1760313330.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1o54ogh/tired_of_this_sh_another_ai_powered_app_nobody/",
        "fetched_at": "2025-10-13T08:17:42.183866"
      }
    ]
  }
}