{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-30T00:58:32.978776"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-30T00:58:23.888532"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-30T00:58:23.888534"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-10-30T00:58:23.664485"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-30T00:58:23.664480"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-30T00:58:23.664468"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-30T00:58:23.888529"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-30T00:58:23.888536"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-30T00:58:23.664482"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-30T00:58:23.888517"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-30T00:58:23.664484"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 470,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-30T00:58:31.977349"
      },
      {
        "id": "1oifxh3",
        "title": "Here's how to waste 250K in building an healthcare app",
        "selftext": "1. App requires 5 clicks to do the thing\n\nSpend the first 6 months perfecting the user flow. It's beautiful. It's intuitive. It adds 3 clicks to something doctors do 40 times a day. One cardiologist pulls out a spreadsheet proving the app will cost him $47k annually in lost patient time.\n\n2. Treat HIPAA like just another checkbox\n\nClick \"yes\" on a compliance form and genuinely believed that made the app secure and complaint. Learn about what it actually means in compliance review.\n\n3. Someone named O'Connor tried to log in\n\nEntire app crashes because some one forgot apostrophes exist in human names. The devs spend the next week learning about characters like Renée, Smith-Jones, and people whose entire legal name is just \"Cher.\"\n\n4. Show it to one doctor, product market fit confirmed.\n\n5. Epic wanted $25k just to have a conversation\n\nAssumed integration would be easy, Googled \"Epic integration\" and laughed at the $25k price tag, thinking it was a typo. It wasn't. Eight months later you get approval, and the app still crashes when it receives any data because integration testing is apparently a different $25k.\n\n9. AWS bill went from $500 to $15k, app hasn't launched yet\n\nTurns out HIPAA compliant infrastructure has opinions about encryption, logging,  and redundancy. Hospitals want you to sign SLA guaranteeing 4-nines. You hired a DevOps person at $12k/month because everything kept breaking and risk breaking the SLA. You've burned $220k and still don't have a single paying customer.\n\n10. They said \"this doesn't fit our workflow at all\" and you realized workflow was a word you should have learned earlier\n\nYou built scheduling. You built messaging. You built a beautiful patient portal. None of it maps to how clinicians actually work. They have to see 40 patients a day. Your app makes that harder, not easier. You spent a year solving problems nobody had while ignoring the ones they actually face daily.\n\n\nBut remember to have fun!",
        "subreddit": "SaaS",
        "author": "joe_at_topflight",
        "score": 414,
        "num_comments": 97,
        "created_utc": 1761673001.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1oifxh3/heres_how_to_waste_250k_in_building_an_healthcare/",
        "fetched_at": "2025-10-30T00:58:26.477146"
      },
      {
        "id": "1oiuef1",
        "title": "I regret leaving my job to start my own business",
        "selftext": "Honestly, I’ve been feeling a bit of regret about leaving my job. I know it was the right decision at the time since it was really affecting my confidence and mental health (due to toxic coworker). Still, I wish I had found better ways to cope with the stress back then or ways to manage it better so I could’ve kept that stable monthly income.\n\nBuilding a business now has been even more challenging for my mental health and confidence. But I know this is what I really want to do than work for someone else's dream. But it’s hard, especially when you’re surrounded by people with steady jobs. You start feeling like you’re missing out or doing something wrong, even when you’re not. It’s definitely a bit of FOMO.\n\nOne thing I’ve learned is that I will never leave a job again without a backup plan, no matter how much I have saved. I really thought I’d be fine living off my savings for a while that can sustain me for a year or two, but it’s different when you don’t have that regular income. I end up feeling lost, distracted, and constantly doubting myself, questioning whether I’m doing the right thing.\n\nI used to think that working on my own business full time would help me focus more, since having a job seemed like a distraction. But in reality, the pressure of doing your own thing without seeing results quickly can be overwhelming. Maybe I just need to build a stronger mindset, be more patient, be consistent, practice delayed gratification, but looking back, even during my school days, I was never great at working under pressure - and working on building a business full time is a whole lot of pressure.\n\nHas anyone else left a stable job to chase their dream, only to find it’s way harder than you expected?\n\nI’d love to hear your experiences and any lessons you learned along the way.",
        "subreddit": "Entrepreneur",
        "author": "BusinessToe4459",
        "score": 396,
        "num_comments": 158,
        "created_utc": 1761709211.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oiuef1/i_regret_leaving_my_job_to_start_my_own_business/",
        "fetched_at": "2025-10-30T00:58:24.594488"
      },
      {
        "id": "1oiqxhm",
        "title": "Learned an important lesson from my old man today",
        "selftext": "I run a Agriculture custom application business. Basically I spend a few months every winter spreading fertilizer, ag lime or cover crops for farmers. The work is steady and ive built up a solid clientele the past 6 years. \n\nPart of the job sometimes involves getting calls from farmers ive never dealt with inquiring about my prices etc. Cue sketch ball McGee. (SB for short)\n\nI get a call from a farmer not in my territory, which was a red flag. My service isnt super unique. You travel and hour or two any direction and you find another of me thats happy to do the work. Why wasn't he calling them?\n\nSays he cant get anyone to spread ag lime for him. Red flag #2. Has 120 acres he wants a whopping 4 tons to the acre. (Note, 1-2 tons an acre is most common, 3 is max if the ph is awful). \nI say sure ill do whatever you want. Asks for a quote, get him one, $30 a ton for purchasing the lime, trucking and spreading. $120/acre. He says sure sounds good. Start anytime. \n\nNow normally with my usual farmers this is no big deal. I spread, pay all the inputs, then bill them for all materials plus my time on top. Never had an issue. But something was off with him, but at the same time if he was real this was a big profit job. My dad whose much wiser than me told me to ask him for half up front. \"Tell him this is standard procedure with new clients.\" So I did. Dude said ok ill get back you. Never heard from again. Dodged a bullet i think. \n\nNow I know why no one in his area would work with him. ",
        "subreddit": "smallbusiness",
        "author": "limeboi148",
        "score": 367,
        "num_comments": 50,
        "created_utc": 1761699178.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oiqxhm/learned_an_important_lesson_from_my_old_man_today/",
        "fetched_at": "2025-10-30T00:58:30.098630"
      },
      {
        "id": "1oj285e",
        "title": "Why is yelp allowed to exist?",
        "selftext": "If I don't want a google business profile, I can delete mine (or simply never create one) and that's it.    \n  \nBut if some butt-head that has a personal beef with my wife wants to, he can \"create\" my business on yelp and leave me a totally fake 1 star review without any proof whatsoever and I can't do anything about it.  This is legal? This is allowed? This sounds insane to me but lawyer's aren't cheap!\n\nHas anyone ever created a website dedicated to slandering yelp?  What can they do?  As long as everyone checks the box asserting everything is true, of course.",
        "subreddit": "smallbusiness",
        "author": "roy_lobster",
        "score": 308,
        "num_comments": 139,
        "created_utc": 1761738125.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oj285e/why_is_yelp_allowed_to_exist/",
        "fetched_at": "2025-10-30T00:58:30.098625"
      },
      {
        "id": "1oi1zhr",
        "title": "Been in singapore for a few months… finally get why everyone registers their business here 💀.I will not promote.",
        "selftext": " I used to think registering a company in singapore was just a flex for indian founders. but after being here for a few months for my tetr programme, i kinda get it. it’s stupidly efficient, 1–2 days to register, flat 17% corporate tax, crazy good IP protection, and global clients actually take you more seriously if your company says “Singapore” in the footer.\n\nnow i’m just thinking… instead of overcomplicating my startup idea, what if i just help other founders register here and take a cut lol. like literally be the “connector” between European/Indian/US founders and Singapore accounting firms that do this in bulk. feels like a decent hustle ngl.\n\nanyone here actually done this or worked with singapore registration agencies? how does the commission/partnership side work?",
        "subreddit": "startups",
        "author": "Acer53",
        "score": 233,
        "num_comments": 86,
        "created_utc": 1761632153.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oi1zhr/been_in_singapore_for_a_few_months_finally_get/",
        "fetched_at": "2025-10-30T00:58:28.315825"
      },
      {
        "id": "1oj8z5y",
        "title": "Most startups don't need an ERP (I will not promote)",
        "selftext": "We're a series A company with about 45 people and doing around $4M ARR. Last year our CFO (who came from a big corp background) convinced everyone to implement ERP  \nI was sus from day one but got overruled because of reasons like we need to scale properly and  that we can't keep using spreadsheets and random tools forever which is fair but also we weren't exactly falling apart. Fast forward 8 months and we've spent probably 80k on implementation consultants, our finance team has been basically useless this entire time because they're drowning in configuration meetings, we STILL don't have it fully set up and half our team refuses to use it correctly because it's so goddamn complicated for basic tasks   \nIMO I think ERP only makes sense when you are a manufacturing company with complex supply chains and inventory and whatever but for a saas startup it's kinda useless. We're paying sales people buying software subscriptions and occasionally ordering laptops. Why do we need enterprise resource planning for that? The worst part is everyone's too proud to admit it was a mistake at this point and we're stuck with it. Our old setup of quickbooks was working fine idk why some people want to get stuff like this I think it's related to delusion and thinking you're a huge corp when you're actually not",
        "subreddit": "startups",
        "author": "WobblySynopsis",
        "score": 197,
        "num_comments": 40,
        "created_utc": 1761754829.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oj8z5y/most_startups_dont_need_an_erp_i_will_not_promote/",
        "fetched_at": "2025-10-30T00:58:28.315787"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 181,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-30T00:58:31.977411"
      },
      {
        "id": "1oinw1n",
        "title": "Made an app that finally surpassed $1k/mo. Here's what nobody tells you.",
        "selftext": "Six months ago, I was building features nobody asked for.\n\nToday, I hit $1,200 in monthly recurring revenue.\n\nNot life changing money, but it's the first time I've built something that actually makes money while I sleep. Here's what I learned that nobody talks about in the success posts.\n\n## The First $100 is Harder Than the Next $900\n\nEveryone talks about scaling to $10k. Nobody mentions the psychological hell of going from $0 to $100.\n\nMy first paying customer took 3 months to land. Three entire months of shipping features, fixing bugs, posting on Twitter to crickets, and wondering if I was delusional.\n\nThat first $29 payment notification hit different. Not because of the money, but because it proved the concept wasn't just in my head.\n\n## Validation Tools Are More Valuable Than You Think\n\nThe app is a research platform that helps people validate ideas before building them. Sounds boring, right?\n\nThat's exactly why it works.\n\nEveryone wants to build the next viral AI tool. Almost nobody wants to do the unsexy work of researching if anyone actually has the problem they're trying to solve.\n\nI built this because I wasted months on projects nobody wanted. Turns out, a lot of other builders have the same problem.\n\n## The Pricing Mistake That Cost Me 2 Months\n\nI launched at $9/month because I was scared nobody would pay more.\n\nBig mistake.\n\nThe people who paid $9 were tire kickers. They'd sign up, use it once, then churn. My revenue looked like a yo yo.\n\nI changed pricing to $29/month (and added a $99 tier). Lost half my customers. Revenue doubled. The people who stayed actually used the product and gave real feedback.\n\nLesson: Cheap pricing attracts cheap customers.\n\n## What Actually Drives Growth (Not What Twitter Says)\n\nI tried everything:\n- Twitter threads (12 likes, 0 conversions)\n- Product Hunt launch (ranked #47, got 8 customers who churned)\n- Reddit ads ($200 spent, 2 signups, both canceled)\n\nWhat actually worked:\n- Reddit posts in r/Entrepreneur and r/SaaS (not promotional, just genuinely helpful)\n- Solving specific use cases (added Reddit research tools, App Store analysis)\n- Word of mouth from people who actually got value\n\nGrowth isn't sexy. It's answering the same questions 50 times in different subreddits until someone finally checks out your product.\n\n## The Features That Matter vs The Ones You Think Matter\n\nI spent 3 weeks building a beautiful dashboard with charts and graphs. Users opened it once.\n\nI spent 2 hours adding a \"copy to clipboard\" button for research results. People use it constantly and mention it in testimonials.\n\nUsers don't care about your architecture or your fancy UI animations. They care about getting their job done 5 minutes faster.\n\n## The Uncomfortable Truth About Competition\n\nWhen I started, there were already 10+ idea validation tools. I almost didn't launch because \"the market is saturated.\"\n\nReality: Most of those tools are abandoned side projects or have terrible UX.\n\nThe real competition isn't other validation tools. It's the manual process people already use (scrolling Reddit for hours, reading hundreds of app reviews).\n\nYour competition is the status quo, not other startups.\n\n## What $1k/Month Actually Means\n\nIt covers my AWS bill, domain renewals, and maybe half my rent.\n\nBut more importantly:\n- It proves people will pay for this\n- It funds more development\n- It gives me leverage to quit my day job eventually\n- It proves I can build something profitable\n\nThe goal isn't to stay at $1k. It's to prove the model works at small scale before scaling.\n\n## Next Milestones\n\nGetting to $3k/month: Need 100 paying customers at $29/mo average\nGetting to $10k/month: Need better enterprise features for teams\n\nNot going to pretend I have all the answers. Still figuring out most of this. But if you're stuck at $0 trying to hit your first dollar, these lessons might save you a few months.\n\nI interviewed some people and here is my app [Dev box](https://bigideasdb.com)\n\n",
        "subreddit": "SaaS",
        "author": "Important_Word_4026",
        "score": 173,
        "num_comments": 52,
        "created_utc": 1761691320.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1oinw1n/made_an_app_that_finally_surpassed_1kmo_heres/",
        "fetched_at": "2025-10-30T00:58:26.477144"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 167,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-30T00:58:31.977442"
      }
    ]
  }
}