{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-16T16:12:49.282225"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-16T16:12:40.518183"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-16T16:12:40.159485"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-16T16:12:40.159487"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-16T16:12:40.159470"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-16T16:12:40.518180"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-16T16:12:40.518184"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-16T16:12:40.159492"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-16T16:12:40.518170"
      },
      {
        "videoId": "MLBwqLcazYY",
        "title": "Bookkeeping 101 for Small Business (EASY EVEN IF YOU KNOW NOTHING ABOUT ACCOUNTING)",
        "description": "BOOKKEEPING 101 FOR SMALL BUSINESS (EASY EVEN IF YOU KNOW NOTHING ABOUT ACCOUNTING) // Do you wonder ...",
        "channelTitle": "Jill Gockel",
        "publishedAt": "2019-09-10T11:17:27Z",
        "url": "https://www.youtube.com/watch?v=MLBwqLcazYY",
        "fetched_at": "2025-11-16T16:12:40.518186"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-16T16:12:40.159489"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 478,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-16T16:12:48.280870"
      },
      {
        "id": "1oyat5y",
        "title": "Photographers using my property. Am I crazy for finding this uncool?",
        "selftext": "\nSo I live on the coast in New England and about 5 years ago I bought a small fish house. Its a touristy area and we sell fresh fish to tourists/locals. Its right on the water with a long dock and very beautiful\n\nWord has been getting around and last summer we started noticing people hanging around that weren't customers. One of our employees pointed out a camera. That's when we noticed a photographer and a couple were using our private dock for a photo shoot. I didn't really think anything of it.\n\nIt kept happening but what bothered me was it seemed like the photographers were being underhanded. They never asked for permission and would even pretend to be paying customers. They would pretend to look at things and then head out back. \n\nThen more photographers started coming. We had entire families dressed up for a shoot. Apparently word got out how pretty this place was for family pictures.\n\nI said something to one of the photographers and got an earful about how it's a public business that anyone  can access. \n\nWhat are your thoughts on this? I dont want to be a hard ass but we aren't a huge operation and it's annoying as fuck to have all these extra people around not buying anything.",
        "subreddit": "smallbusiness",
        "author": "Comfortable_Dish5217",
        "score": 265,
        "num_comments": 188,
        "created_utc": 1763262387.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oyat5y/photographers_using_my_property_am_i_crazy_for/",
        "fetched_at": "2025-11-16T16:12:46.286416"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 188,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-16T16:12:48.280912"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 183,
        "num_comments": 34,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-16T16:12:48.280894"
      },
      {
        "id": "1oxw217",
        "title": "I'm too dumb to start a business.",
        "selftext": "I don't get business. I have a degree in math and I was an average student in school and college. I'm currently unemployed and quite desperate. I really want to venture here but whenever I read articles on the internet its like my mind goes blank. I'm unable to understand how to manage and start one. Any idea never progresses past the first stage. I'm unable to execute the plan. Please help me. Anyone.",
        "subreddit": "Entrepreneur",
        "author": "Both_Huckleberry2586",
        "score": 128,
        "num_comments": 156,
        "created_utc": 1763224257.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oxw217/im_too_dumb_to_start_a_business/",
        "fetched_at": "2025-11-16T16:12:41.210954"
      },
      {
        "id": "1oy7ohe",
        "title": "What’s the one skill every small business must have to succeed?",
        "selftext": "There’s a lot of advice out there, learn sales, marketing, storytelling, or leadership.  \nBut if you had to pick *just one skill* that’s absolutely non-negotiable for entrepreneurial success… what would it be?\n\nSome people say it’s resilience, others say execution, communication, or focus.\n\nFor those who’ve been building or running small businesses, what’s the one skill that truly made the difference for you, and how did you develop it?",
        "subreddit": "smallbusiness",
        "author": "LongjumpingSuit5615",
        "score": 79,
        "num_comments": 85,
        "created_utc": 1763253320.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oy7ohe/whats_the_one_skill_every_small_business_must/",
        "fetched_at": "2025-11-16T16:12:46.286418"
      },
      {
        "id": "1oxwvpw",
        "title": "What kind of business can be started with $50,000?",
        "selftext": "What industries?",
        "subreddit": "Entrepreneur",
        "author": "Moneybucks12381",
        "score": 65,
        "num_comments": 169,
        "created_utc": 1763226169.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oxwvpw/what_kind_of_business_can_be_started_with_50000/",
        "fetched_at": "2025-11-16T16:12:41.210964"
      },
      {
        "id": "1o40fm7",
        "title": "As someone who works from home, how do you socialise? or meet new people/make friends?",
        "selftext": "I am working from home, a 27F. Honestly it gets boring and i dont have any friends in here in my hometown. I have lived in hostel since 15 and hence havent made any friends here.\n\nMy hometown is also not a lively place with meetups or activities happening, so it just becomes difficult for me.\n\nAny other way to socialise? maybe any online ways? Please suggest.\n\nUpvote1Downvote1Go to comments  \n",
        "subreddit": "freelance",
        "author": "This-Brief6214",
        "score": 63,
        "num_comments": 64,
        "created_utc": 1760201179.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o40fm7/as_someone_who_works_from_home_how_do_you/",
        "fetched_at": "2025-11-16T16:12:48.280928"
      },
      {
        "id": "1oyg9re",
        "title": "We automated everything except the chaos",
        "selftext": "We’re 233 people across four countries. Payroll runs itself. Analytics too. Even onboarding emails. Everything’s automated except the part that touches real hardware.\n\nWhen someone joins, chaos starts. IT requests specs and procurement orders, HR fills out forms, and finance waits for invoices. When someone leaves, it’s worse. Laptops vanish, sit unopened, or never come back.\n\nAnd somehow I’m the one asking on Slack if anyone’s seen a MacBook from two months ago. I’m the CEO. I’m not supposed to be chasing laptops. How do you fix that?\n\n",
        "subreddit": "Entrepreneur",
        "author": "Apprehensive_Pay6141",
        "score": 62,
        "num_comments": 20,
        "created_utc": 1763280954.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oyg9re/we_automated_everything_except_the_chaos/",
        "fetched_at": "2025-11-16T16:12:41.210942"
      },
      {
        "id": "1oxokz2",
        "title": "What is your opinion on Peter Thiel's 7 investor questions in 2025? I will not promote",
        "selftext": "I think many of them still apply a lot to modern startups. Do you use these when thinking about startup ideas?  \nOr what are some other questions one should ask themselves?\n\nJust to summarize:\n\n* **The Engineering Question**: Can you create breakthrough technology instead of incremental improvements? This emphasizes developing something that's at least 10 times better than existing solutions to achieve true innovation.\n* **The Timing Question**: Is now the right time to start your business? Timing is crucial—being too early or too late can doom even great ideas, so assess why the present moment is ideal.\n* **The Monopoly Question**: Are you starting with a big share of a small market? Aim to dominate a niche first rather than competing in a large, crowded market from the outset.\n* **The People Question**: Do you have the right team? Success depends on assembling a capable, aligned group of people who can execute the vision effectively.\n* **The Distribution Question**: Do you have a way to not just create but also deliver your product? Even the best product fails without a strong sales and distribution strategy.\n* **The Durability Question**: Will your market position be defensible 10 to 20 years into the future? Consider barriers like network effects, proprietary tech, or branding that protect against competition long-term.\n* **The Secret Question**: Have you identified a unique opportunity that others don't see? Great companies are built on insights or \"secrets\" about the world that are hard to spot but true.",
        "subreddit": "startups",
        "author": "vire00",
        "score": 53,
        "num_comments": 39,
        "created_utc": 1763203115.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oxokz2/what_is_your_opinion_on_peter_thiels_7_investor/",
        "fetched_at": "2025-11-16T16:12:44.669965"
      }
    ]
  }
}