{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-22T16:15:47.938828"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-22T16:15:39.627410"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-12-22T16:15:39.627411"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-22T16:15:39.317861"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-22T16:15:39.317876"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-22T16:15:39.317872"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-22T16:15:39.627407"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-22T16:15:39.627413"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-12-22T16:15:39.317878"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-22T16:15:39.627397"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-22T16:15:39.317875"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 492,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-22T16:15:46.937447"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 446,
        "num_comments": 131,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-22T16:15:46.937489"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 161,
        "num_comments": 39,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2025-12-22T16:15:46.937469"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 151,
        "num_comments": 62,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2025-12-22T16:15:46.937467"
      },
      {
        "id": "1ps9bjh",
        "title": "I mass email all your data to a competitor: My biggest customer was just using me to gather leads on his competitors. Took a month to realize.",
        "selftext": "This one still stings a bit so bear with me.\n\r\nHad a guy sign up for the highest tier. Paid annually upfront. Dream customer, right? He was super engaged too. Logging in daily, exporting reports, asking detailed questions about every feature. I thought he was just thorough.\n\r\nThen I noticed something weird. He kept asking for \"industry benchmark\" data. Wanted to know what other companies in his space were doing. At first I thought he was just curious. Then the requests got more specific. He wanted to know which of his competitors were using my tool. Asked if I could share\r\nanonymized data about companies similar to his.\n\r\nI said no obviously. But something felt off.\n\r\nDid some digging. Turns out this guy runs a consulting firm. His entire business model is gathering competitive intelligence for enterprise clients. He wasn't using my product to solve his own problems. He\r\nwas using it to learn how his competitors solved theirs. Every export, every question, every \"benchmark request\" was him trying to extract information about my other customers.\n\r\nThe moment I figured it out I felt sick. Not because he did anything technically wrong. He paid. He used the product. But the intent was completely different from what I assumed.\n\r\nRefunded him and closed his account. He complained. Threatened a bad review. I didn't care at that point.\n\r\nNow I actually pay attention to usage patterns that seem off. Someone exporting everything on day one?Red flag. Someone asking about other customers constantly? Red flag. High engagement without any obvious use case for their stated business? Red flag.\n\r\nNot everyone who pays you is a customer you want.\n\r\nAnyone else dealt with users who weren't what they seemed?",
        "subreddit": "SaaS",
        "author": "Old-Guess-3243",
        "score": 125,
        "num_comments": 34,
        "created_utc": 1766331592.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ps9bjh/i_mass_email_all_your_data_to_a_competitor_my/",
        "fetched_at": "2025-12-22T16:15:41.929864"
      },
      {
        "id": "1psd8n9",
        "title": "Burned out founder here. The productivity advice made it worse. What actually helped was doing less.",
        "selftext": "Six months ago I was working 70 hour weeks and proud of it. Optimizing every minute. Time blocking. Pomodoro. Wake up at 5am. Cold showers. The whole performative productivity thing. And I was miserable and the business wasn't even growing that fast.\n\nThe breaking point was a Thursday afternoon when I sat at my desk for 3 hours and literally couldn't make myself do anything. Just stared at the screen. Brain completely empty. I thought something was medically wrong with me.\n\nTalked to a therapist. She asked me what I did for fun. I couldn't answer. Asked me when I last took a day completely off. Couldn't remember. Asked me if I actually enjoyed running this business. I started crying which was embarrassing but also clarifying.\n\nHere's the thing nobody tells you. Productivity systems are designed for people who aren't working enough. If you're already working too much, optimizing your work just means you burn out more efficiently.\n\nWhat actually helped was cutting my hours. Not optimizing them. Cutting them. I went from 70 to 45. Felt terrifying at first. Felt like I was abandoning the business. But the business didn't notice. Revenue kept growing at roughly the same rate. Some things just didn't get done and turns out they didn't need to get done.\n\nThe 25 hours I got back went to sleep, exercise, seeing friends, and just existing as a human. My actual productive output during the 45 hours is now higher than it was during the 70. I can think clearly again. I can make decisions. I don't dread Monday anymore.\n\nMore hours isn't more output. It's just more hours.\n\nAnyone else been through something similar?",
        "subreddit": "Entrepreneur",
        "author": "Responsible-Radish65",
        "score": 120,
        "num_comments": 43,
        "created_utc": 1766341388.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1psd8n9/burned_out_founder_here_the_productivity_advice/",
        "fetched_at": "2025-12-22T16:15:40.280350"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 89,
        "num_comments": 36,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2025-12-22T16:15:46.937465"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 66,
        "num_comments": 27,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-22T16:15:46.937487"
      },
      {
        "id": "1psntv9",
        "title": "Joined a tiny startup as “employee #2” with a flat hierarchy… now there's a weird power struggle and I don’t know how to handle it. (I will not promote).",
        "selftext": "I joined a very small startup recently - basically a 3-person team inside a slightly larger group of sister companies. When I accepted the role, I was clearly told:\n\nI’m effectively employee #2 in this branch/ startup\n\nIt’s a flat structure\n\nI report to the COO (of the whole group of companies)\n\nMy work would span product-ish stuff, operations, and building internal systems\n\nThere’s room to grow into more product responsibilities\n\nThis is exactly the kind of hybrid role I wanted, and I’ve been delivering. I adapt fast, the work suits me, and I enjoy being close to both building and operations.\n\nBut… something is off.\n\nThe other guy on the team (I’ll call him X) has started behaving like he’s my manager, even though nobody ever said that and it directly contradicts what I was told.\n\nSome examples:\n\n* In group conversations (internal or external), he talks over me or completely ignores what I say.\n* He hijacks meetings I am having with other stake-holders and schedules the follow ups with himself. The worst part is it's not his domain/ expertise or even related to him.\n* When I reach out for quick clarifications, I often get stonewalled or made to wait, even for simple yes/no things. It's this weird power trip in situations where I can see he is just scrolling on his phone.\n* If I raise concerns or offer ideas, he tends to dismiss them until someone else validates the same point.\n* He has this subtle but constant need to assert control over decisions, process, and communication. \n\nIt’s not a personality clash. It’s an odd, unspoken power dynamic that appeared out of nowhere. And now it’s starting to affect workflow because I can’t move fast if another person keeps acting like I need his approval for everything.\n\nMy issue isn’t authority or ego. I genuinely don’t care about titles. I just want clarity so things don’t bottleneck and so the environment doesn’t get toxic. There was supposed to be transparency, autonomy, and collaboration, not this kind of shadow hierarchy.\n\nI like the COO (my actual manager) and trust him, but I’m struggling with how to bring this up without sounding like I’m complaining about a co-worker. I want to frame it as: “This dynamic is slowing our execution. Can we align on structure and expectations?”\n\nFor anyone who’s worked in tiny startups or flat teams:\n\nIs this kind of power struggle normal when roles aren’t clearly defined?\n\nAnd how do you bring this up with leadership without sounding political?\n\nAny advice would help. It's uncomfortable navigating a structure that says it’s flat, but feels like there's an invisible hierarchy someone invented on their own.",
        "subreddit": "startups",
        "author": "No_Insurance1395",
        "score": 55,
        "num_comments": 40,
        "created_utc": 1766369865.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1psntv9/joined_a_tiny_startup_as_employee_2_with_a_flat/",
        "fetched_at": "2025-12-22T16:15:43.528653"
      },
      {
        "id": "1pt0v2b",
        "title": "\"If I have to micromanage you, you’re fired.\" Too harsh?",
        "selftext": "Saw [a clip](https://www.youtube.com/watch?v=Ag72jS1aEuQ) of a CEO saying that if he has to micromanage someone, he’s already failed at the hire and they need to go.\n\nAs a small business owner, I'm starting to agree. I don’t have the time or the budget to babysit. If I’m hovering over your shoulder to make sure things get done, I’m basically not delegating anything....\n\nI’ve realized micromanaging usually means one of two things:\n\n1. I hired the wrong person.\n2. I’m a control freak who hasn’t built proper systems.\n\nCurious how you guys handle this. Do you try to \"fix\" an employee who needs constant hand-holding, or do you just cut bait?\n\nHow long does it usually take for you to realize it's time to make a change?",
        "subreddit": "smallbusiness",
        "author": "itsmeamirax",
        "score": 54,
        "num_comments": 44,
        "created_utc": 1766413602.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pt0v2b/if_i_have_to_micromanage_you_youre_fired_too_harsh/",
        "fetched_at": "2025-12-22T16:15:45.130020"
      }
    ]
  }
}