{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-11T08:14:03.291606"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-11T08:13:55.100256"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-11T08:13:55.100258"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-11T08:13:54.667652"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-11T08:13:54.667639"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-11T08:13:55.100252"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-11T08:13:55.100254"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-10-11T08:13:54.667658"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-11T08:13:54.667655"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-11T08:13:55.100241"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-11T08:13:54.667656"
      }
    ],
    "reddit": [
      {
        "id": "1o2zwi7",
        "title": "I think AI slop killed my business.",
        "selftext": "We do production for creators and this year we only signed 2 big industry players. We didnt sign any small and medium sized clients. It appears the entire middle market got destroyed by AI slop and low efort podcasts and generally there is a fear of income loss for any production.\n\nCreators spend a ton on production and editing etc and they are losing views and engagement to AI shorts about women washing dishes in the olympics. 4 millions likes that short got. There are clients with 10m+ subs getting less than 100k views now. So, its clear, AI will kill jobs in code generation and content creation.\n\nWhat exactly is going to pay everyone's bills??? Id love to know how everyone else is handling this.\n\nedit: a lot of comments are underestimating the magnitude of this. These are not just random people that will be directly or indirectly affected. It will be fathers and mothers. Brothers and sisters. Sons and daughters. And to those that think they are immune to AI, like mechanics, when people lose their jobs/incomes, they typically dont keep 2-3 cars.\n\nedit: apparently China waited for the markets to close before telling DJT we aren't getting those gpus. In this game of high-stakes poker, DJT like to play his cards face-up.",
        "subreddit": "Entrepreneur",
        "author": "Ashleyosauraus",
        "score": 526,
        "num_comments": 300,
        "created_utc": 1760100338.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o2zwi7/i_think_ai_slop_killed_my_business/",
        "fetched_at": "2025-10-11T08:13:55.749311"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 464,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-11T08:14:02.290233"
      },
      {
        "id": "1o30wz7",
        "title": "I Spent 4 Years Working with a Youtuber that made $3M in 2024 - AMA",
        "selftext": "We make content about Military Aviation, naval, on going wars and war machines. We started in 2020 and hit 3M subs in 4 years. Shorts helped quite a bit to to attract people to the long form content. Have 3B total views and counting. Reach wise he has the biggest reach compared to the other channels I've been with since the beginning. (I will not promote)\n\nMy background: I'm the producer that means I handle scripting, editing, handling sponsorships, Sm management etc. I work with other content content creators (some are now close to 1M subs and some have 2M+ subs from different niches, Automotive, financial advice, podcast and etc) and work with some brands with their marketing.\n\nI don't say I'm an expert or knows everything, my things have performed quite successful because we understood the social media is changing, new trends come and carefully have decided what to follow what not to follow.",
        "subreddit": "Entrepreneur",
        "author": "BreadOnIce",
        "score": 327,
        "num_comments": 126,
        "created_utc": 1760102887.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o30wz7/i_spent_4_years_working_with_a_youtuber_that_made/",
        "fetched_at": "2025-10-11T08:13:55.749313"
      },
      {
        "id": "1o2xvvi",
        "title": "No one showed up to my event",
        "selftext": "I make websites and do digital marketing and there's so much going on in the industry with new AI changes, new tools, Google changing things up, new strategies, etc., that I wanted to try to make a meetup to meet new people (potential people to hire and potential new clients). I moved to a new city last year and in my old city there was a big scene for marketers with meetups and conferences every week, so I wanted to start something similar here. \n\nI spent $100 on the venue, $100+ on catering, spent money on flyers, and spent a lot of time making the presentation I was going to give, hanging up flyers at dozens of local businesses, meeting business owners, and promoting on meetup.com, Facebook, LinkedIn, etc. Several people RSVP'd and I had close to 50 people interested or saying they would come including my friends. I promoted the event with my small team every day for 5 weeks sending reminders just enough to not be annoying. \n\nI got there and set everything up and... nothing. No one came. One person had been asking me questions on meetup named Curtis and I saw one person there who looked like him so I went up to say hello and introduced myself and he looked at me strange and said his name was Shawn and it was nice to meet me. SO AWKWARD. I casually played it off and left him alone, then waited 30+ minutes after the start time by the front door of the venue like some kind of 1970's breakup song to see if anyone would show before packing up my stuff and going home. \n\nNext month I was planning a follow up and was going to have a guest speaker come out, but now I'm thinking of emailing him (a respected name in my field) and canceling next month because it would embarrass me even more. \n\nMaybe Thursday nights aren't good? Maybe 6:30pm is a bad time for a business event? Maybe my offer wasn't good enough? Maybe something else was going on last night that I didn't know about? Maybe I should have tried paid ads on the radio or Facebook instead? Maybe I should try changing it to Saturday and pay a big name to appear? Maybe this town isn't interested in marketing and I need to try the big city 30 minutes away?\n\nI guess I'm just venting into the void here. I used to be in bands and I've definitely played shows where no one came, so this is nothing new, but it's never fun to go through it. \n\n\n\nI realize I'm not good at in-person event promotion and need to keep trying things until I make progress.",
        "subreddit": "smallbusiness",
        "author": "justdandycandy",
        "score": 252,
        "num_comments": 130,
        "created_utc": 1760094342.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o2xvvi/no_one_showed_up_to_my_event/",
        "fetched_at": "2025-10-11T08:14:00.500326"
      },
      {
        "id": "1o3drk2",
        "title": "I can’t vibe code a saas that sells",
        "selftext": "Hey all, how the fuck do these teenagers vibe code saas tools and make 5k a month or more? I am 21 years old and I can’t code and can’t pay a developer bc im broke. I an losing my mind and need to get a saas that works strictly via vibecode. Equity is of no value to a company that is pre-revenue ",
        "subreddit": "SaaS",
        "author": "PlainTheory",
        "score": 237,
        "num_comments": 71,
        "created_utc": 1760132090.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o3drk2/i_cant_vibe_code_a_saas_that_sells/",
        "fetched_at": "2025-10-11T08:13:57.401873"
      },
      {
        "id": "1o2o3wx",
        "title": "Customer suddenly putting over $20k on credit in the past 25 days (and they're on NET30)...how do I find out if they're planning on paying or not, without being annoying?",
        "selftext": "They've bought a few times before, max $1500 purchase, and never had more than $2k in outstanding invoices...suddenly over the past month they've cracked up over $20k for just a certain item. It could very well be they just switched to using us for that item now and they go through a LOT of them, but I'm kinda getting nervous that they're not gonna pay for them...(It's a consumable item btw, something that they constantly need to serve their customers)",
        "subreddit": "smallbusiness",
        "author": "VirtualMacaroon64t",
        "score": 228,
        "num_comments": 84,
        "created_utc": 1760060588.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o2o3wx/customer_suddenly_putting_over_20k_on_credit_in/",
        "fetched_at": "2025-10-11T08:14:00.500350"
      },
      {
        "id": "1o32d4a",
        "title": "First time trying local ads instead of social media actually seeing better results",
        "selftext": "I run a tiny local cafe and I’ve always been told to go digital post on instagram, buy facebook ads, all that. I did it for months with almost no traction. Last month I printed a stack of flyers, partnered with a nearby gym for discounts, and left business cards at apartment mail areas. I swear, that oldschool stuff worked better in two weeks than anything I did online.  \nI still keep socials active, but now I’m focusing on word-of-mouth and real people. Sometimes I’ll be on my phone and think about how weird it is that the offline methods are saving my online business.  \nAnyone else find that local, human connections still beat algorithms?",
        "subreddit": "smallbusiness",
        "author": "CurrencySpecific9668",
        "score": 212,
        "num_comments": 22,
        "created_utc": 1760106335.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o32d4a/first_time_trying_local_ads_instead_of_social/",
        "fetched_at": "2025-10-11T08:14:00.500324"
      },
      {
        "id": "1o30qd2",
        "title": "6 lessons from 17 years of never having a boss",
        "selftext": "I’ve been self-employed my whole adult life -  no resume, no salary, no “career ladder.”  \nJust projects, clients, and my own ideas.\n\nAfter 17 years, here are 6 things that kept me going:\n\n**1. Know your “why.”**  \nIf it’s not strong enough, you’ll burn out.  \nMine was simple: freedom.\n\n**2. Discipline beats motivation.**  \nThere’s no manager, no deadline -  only u  \nMiss a few days, and it all falls apart.\n\n**3. Family matters.**  \nTheir early support made a big difference, even when I was failing constantly.\n\n**4. Manage money like a pessimist.**  \nSome months are great, others are brutal.  \nBuffers keep you sane.\n\n**5. Think in systems, not fads.**  \nUnderstand how things *work*, not just how to copy them.\n\n**6. Be comfortable with risk.**  \nEntrepreneurship is trading comfort for control.  \nYou won’t win every time -  but you’ll always move forward.\n\nCurious -  how long have you been working for yourself?  \nWhat’s the biggest thing that keeps you going?",
        "subreddit": "Entrepreneur",
        "author": "LiveAwareness2206",
        "score": 182,
        "num_comments": 31,
        "created_utc": 1760102428.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o30qd2/6_lessons_from_17_years_of_never_having_a_boss/",
        "fetched_at": "2025-10-11T08:13:55.749317"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 176,
        "num_comments": 47,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-11T08:14:02.290261"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 167,
        "num_comments": 54,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-11T08:14:02.290252"
      }
    ]
  }
}