{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-11T16:14:11.048125"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-11T16:14:04.366941"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-11T16:14:04.027873"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-11T16:14:04.027865"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-11T16:14:04.027854"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-11T16:14:04.366939"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-11T16:14:04.366943"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-11T16:14:04.366946"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-11T16:14:04.027870"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-11T16:14:04.366926"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-11T16:14:04.027872"
      }
    ],
    "reddit": [
      {
        "id": "1ndauhk",
        "title": "Don’t underestimate “boring” businesses",
        "selftext": "A few years ago I tried to launch a trendy DTC product sleek branding, influencers, everything. It bombed. Later, I started a really unsexy business: commercial cleaning for small offices. No hype, no buzz. But within 18 months it was profitable and paying me more than my “cool” startup ever did. The older I get, the more I realize boring businesses often win because they solve real problems. Flashy is fun, but boring pays. Kind of like slots on Stakе exciting for a bit but steady beats flashy every time. Have you had more success with “boring” or “sexy” ideas?",
        "subreddit": "Entrepreneur",
        "author": "UnlikelyExpert9456",
        "score": 897,
        "num_comments": 144,
        "created_utc": 1757501288.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ndauhk/dont_underestimate_boring_businesses/",
        "fetched_at": "2025-09-11T16:14:04.736307"
      },
      {
        "id": "1nd942i",
        "title": "How these guys made $1.2B by shamelessly copying startups (and what we can learn from it) i will not promote",
        "selftext": "Back in 1998, three German brothers: Marc, Oliver, and Alexander noticed something interesting: eBay was exploding in the US, but hadn’t yet touched Germany.\n\nThey pitched eBay directly: *“Bring your platform here, and let us run it.”*  \neBay said no.\n\nSo the Samwers went home, cloned eBay almost pixel for pixel, called it **Alando**, and launched it in Germany. Within **100 days**, eBay realized it was losing the market, and ended up acquiring Alando for **$43M**.\n\nThat deal lit a fire. The brothers went on to found **Rocket Internet**, a venture studio dedicated to a simple playbook: find a proven US startup, rebuild it for Europe or emerging markets, scale it fast, then sell it back (or compete directly). They cloned Facebook (StudiVZ), Airbnb (Wimdu), Groupon (Citydeal), and even Amazon (Zalando started as a Zappos copy).\n\nWhether you see it as genius or shady, it worked today each brother is worth around **$1.2B**.\n\n**My takeaway:**\n\n* You don’t always need to invent something new. You can *localize* what already works elsewhere.\n* Speed and execution often beat originality. Rocket wasn’t first; they were just the fastest in their market.\n* Distribution can matter more than innovation. Even the best product loses if it doesn’t show up where users are.\n\nDo you think cloning US SaaS products for Europe still works, or are most tools global enough now that just translating the interface is all you need?",
        "subreddit": "startups",
        "author": "Ben_LF9",
        "score": 467,
        "num_comments": 59,
        "created_utc": 1757494924.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nd942i/how_these_guys_made_12b_by_shamelessly_copying/",
        "fetched_at": "2025-09-11T16:14:07.471455"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 450,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-11T16:14:10.047121"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 273,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-09-11T16:14:10.047188"
      },
      {
        "id": "1ndrs95",
        "title": "This sub sucks.",
        "selftext": "Are there even mods here? The amount of spam makes this sub unreadable. End rant and unjoined. ✌🏻",
        "subreddit": "smallbusiness",
        "author": "Bitter-Heat-8767",
        "score": 234,
        "num_comments": 74,
        "created_utc": 1757542110.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ndrs95/this_sub_sucks/",
        "fetched_at": "2025-09-11T16:14:08.779348"
      },
      {
        "id": "1nddeyp",
        "title": "Startup life isn’t beaches and laptops. It’s sacrifice, loneliness, and resilience.",
        "selftext": "Startup life isn’t beaches and laptops. It’s sacrifice, loneliness, and resilience.\n\n It's harder, lonelier, and more rewarding than anyone tells you. \n\nThe brochures of entrepreneurship are filled with beaches and laptops.\n\nThe reality?\n\nSacrifices. Long hours. Moments of profound isolation.\n\nBuilding something real demands everything you have. It’s a constant test of resilience.\n\nFreedom isn’t gifted. It’s earned through relentless effort.\n\nIt’s about making tough calls. It’s about pushing through when every cell in your body screams to stop.\n\nBut amidst the struggle, there’s unparalleled joy:\n\n* The joy of seeing your vision take shape\n* The joy of impacting lives\n* The joy of creating something from nothing\n\nEntrepreneurship isn’t for the faint of heart. It’s for those who dare to dream and are willing to bleed to make those dreams a reality.\n\nWhat’s been the hardest part of your founder journey?\n\nHow do you stay resilient when everything feels stacked against you?",
        "subreddit": "Entrepreneur",
        "author": "attacomsian",
        "score": 159,
        "num_comments": 69,
        "created_utc": 1757508873.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nddeyp/startup_life_isnt_beaches_and_laptops_its/",
        "fetched_at": "2025-09-11T16:14:04.736337"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 149,
        "num_comments": 174,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-11T16:14:10.047166"
      },
      {
        "id": "1nde1p0",
        "title": "Is there such a thing as a workforce management platform that does both HR and payroll for small businesses and does it well?",
        "selftext": "Posting here to ask if anyone has recommendations for a workforce management platform that does both HR and payroll for small businesses and does it well. \n\nAs it is, we’re a fairly lean company with less than 50, including contractors overseas. \n\nWe’re running into inefficiencies running HR tasks like logging leave manually, calculating hourly employee’s time, and are running payroll through QBO. \n\nWhat we’re looking for one single, ideally cost-efficient platform, so we can avoid switching between platforms – just a general upgrade from our current set-up. I’ve looked into a few platforms, but it’s unclear which of them are actually all-in-ones that can do everything HR/payroll for us as a small business in a cost-efficient way. ",
        "subreddit": "smallbusiness",
        "author": "joeguy1776",
        "score": 112,
        "num_comments": 22,
        "created_utc": 1757510450.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nde1p0/is_there_such_a_thing_as_a_workforce_management/",
        "fetched_at": "2025-09-11T16:14:08.779381"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 108,
        "num_comments": 55,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-11T16:14:10.047171"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 95,
        "num_comments": 58,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-11T16:14:10.047152"
      }
    ]
  }
}