{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-12T16:12:35.892410"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-12T16:12:27.279175"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-12T16:12:27.279177"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-12T16:12:26.968938"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-12T16:12:26.968943"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-12T16:12:26.968925"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-12T16:12:27.279171"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-12T16:12:27.279174"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-12T16:12:26.968940"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-12T16:12:27.279160"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-12T16:12:26.968942"
      }
    ],
    "reddit": [
      {
        "id": "1o3qimp",
        "title": "Thank you for crushing my dreams",
        "selftext": "I just want to thank this subreddit for laughing at my business idea. \n\nSeveral months ago I posted on this subreddit as market research of how business owners feel about consultants and I was torn a new one.\n\nI had a whole llc that I invested over $600 with no clients except for one who barely paid me and anything that came close to a new lead somehow got away from me. I was desperate to grow a portfolio to the point I started offering my services for free.\n\nStill no one accepted my services. After 3 months I got immediately burnt out and ended all operations until my one client that I kept told me that I could actually make a living doing my services.\n\nI didn't want to hear it and told them fuck no I hated everything I did for my llc. My client then told me \"You can chose what services you offer.\" That's when I gave it another go.\n\nHowever, I remember what this subreddit said to me and instead of going back to my llc, I completely rebranded, decided that I'm never going to create a portfolio or run ads. I came up with a brand true to me, an awkward autistic woman.\n\nAnd it worked. Owners who told me no before are now telling me yes. \n\nIt is all thanks to the only people that told me my llc was shit. \n\nLove you, r/smallbusiness",
        "subreddit": "smallbusiness",
        "author": "Meem002",
        "score": 502,
        "num_comments": 102,
        "created_utc": 1760172169.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o3qimp/thank_you_for_crushing_my_dreams/",
        "fetched_at": "2025-10-12T16:12:33.109765"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 465,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-12T16:12:34.891036"
      },
      {
        "id": "1o3twx0",
        "title": "Started an IT consulting business. 4 months in. No leads.",
        "selftext": "Hey everyone,\n\nI started an IT consulting business about 4 months ago focused on data center and enterprise networking (things like connectivity, cloud, and infrastructure design).\n\nI’ve been trying to generate some traction, mostly by cold calling local clinics and small businesses just to get a few base clients, but so far nothing to have clicked. No leads. No replies to emails. No callbacks. \n\nI’ve got the technical expertise and can deliver great results, but clearly I’m missing something on the sales or marketing side.\n\nHas anyone here been through something similar? How did you get your first few clients for a B2B technical service like this?\n\nAny tips on outreach, partnerships, or where to focus my energy would be really appreciated.\n\nWould really appreciate any helpful insight here. 🙏🏾\n\n\nThanks in advance. ",
        "subreddit": "Entrepreneur",
        "author": "Champ885",
        "score": 212,
        "num_comments": 108,
        "created_utc": 1760184337.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o3twx0/started_an_it_consulting_business_4_months_in_no/",
        "fetched_at": "2025-10-12T16:12:27.967680"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 178,
        "num_comments": 47,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-12T16:12:34.891066"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 161,
        "num_comments": 54,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-12T16:12:34.891059"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 154,
        "num_comments": 180,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-12T16:12:34.891104"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 99,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-10-12T16:12:34.891084"
      },
      {
        "id": "1o4b9dl",
        "title": "I’ve been stuck at $200k in revenue for three years now",
        "selftext": "It’s becoming very frustrating. My buddy and I started this business from nothing, and it felt like we would be well off fairly quickly. Our first full year, we hit almost 200k. Seemed like the sky was the limit. We make a product and sell both online and in person. We also have a storefront/production facility. \n\nOur online sales grew consistently until they peaked at 10k in March. They’ve since stabilized around 30% below that. We’ve released new products, explored other markets, and maintained consistent presence where we’ve had success. Yet we seem to lose a customer for every one we gain. \n\nI always thought gaining the initial customers would be the hardest part of running a business. For the third year in a row, I’ve been proven wrong. Any advice for growing beyond this point? I’m in the wellness sector",
        "subreddit": "smallbusiness",
        "author": "whocaresthrowa",
        "score": 84,
        "num_comments": 83,
        "created_utc": 1760228859.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o4b9dl/ive_been_stuck_at_200k_in_revenue_for_three_years/",
        "fetched_at": "2025-10-12T16:12:33.109759"
      },
      {
        "id": "1o414yj",
        "title": "Spent $2k on ads. Got 3 signups. 0 conversions.",
        "selftext": "$800 on Facebook, $900 on Google, $300 on LinkedIn, three signups, and none stayed. I feel like I lit $2k on fire. Paid channels promised scale; instead, I got a learning bill  \nMy mistake (after speaking to 5-6 folks) \n\nRan custom landing pages with no product demos (should’ve used Trupeer), no automated email sequences (should’ve used Instantly), and used generic pitch decks (should’ve used Gamma).",
        "subreddit": "SaaS",
        "author": "SaaSSignal",
        "score": 82,
        "num_comments": 59,
        "created_utc": 1760202882.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o414yj/spent_2k_on_ads_got_3_signups_0_conversions/",
        "fetched_at": "2025-10-12T16:12:29.663396"
      },
      {
        "id": "1o3tr4w",
        "title": "I tried corporate and startups. Now I feel completely lost. Is it middle-age crisis or what? I will not promote.",
        "selftext": "I started working as software engineer in 2016. Been pretty happy with 2x-ing my salary every year up until I hit that Senior-level roles. Growth stoped (I mean that rapidly). 2020 year outside and I decided to do something for myself and launch own side projects. For 4 years I've been trying to build something that ppl will use. Sometimes I did it alone, sometimes with co-founders. In the end - none of my 6+ projects made it any further then 10-20 semi-active users. I know the mistakes I made and this post is not about HOW-TO or HOW-NOT-TO, but rather - what you guys do when your life turns into a complete uncertainty and there is no clear way forward?\n\nI took a month of break of doing absolutely nothing to kinda reset myself. Yet I still think I have to do something in the side-project area (btw, I work 9-5 as well so that's why I call it side- project). But I have more questions then answers.\n\nAll the AI hype is becoming really scary. I see little to no founders who actually raised VC funds but was able to move on significantly (take YC updates - 99% of all their alumnis are not even live after pre-ceed).\n\nOpenAI and others are releasing one feature after another that kills lots of startups that worked on it before. And I mean, yeah, it makes sense. \n\nSo what am I suppose to do? Ignore all the noise and still double down on GPT wrappers and do as everyone does - apply to YC and hope my stuff will actually work? Or shall I double down on my corporate work, admit I'm a bad founder and move on with 9-5? I'm 36yo and apparently time is of the essence. Or, maybe kill that founder mood and search for co-founders and just be a founding engineer?\n\nWould really love to hear from ppl in similar boat (if there are such). Cheers!",
        "subreddit": "startups",
        "author": "PassengerOk493",
        "score": 77,
        "num_comments": 94,
        "created_utc": 1760183853.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1o3tr4w/i_tried_corporate_and_startups_now_i_feel/",
        "fetched_at": "2025-10-12T16:12:31.501740"
      }
    ]
  }
}