{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-05T08:15:25.180734"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-05T08:15:17.779849"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-05T08:15:17.388993"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-05T08:15:17.388984"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-05T08:15:17.388972"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-05T08:15:17.779846"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-05T08:15:17.779851"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-05T08:15:17.779854"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-05T08:15:17.388989"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-05T08:15:17.779834"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-05T08:15:17.388991"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 447,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-05T08:15:24.179333"
      },
      {
        "id": "1n8j5r6",
        "title": "Homeless Smell",
        "selftext": "Lately we've had some homeless people sleeping by our business at night. They're respectful and leave before we get in in the morning and clean up after themselves. I've had conversations with them and they know that as long as more people don't start showing up and they keep it clean, we're basically cool. But there is a smell. So my question is outside of getting rid of them altogether, any suggestions for dealing with the smell? Is there a product I can buy, some kind of deodorizer or something I can sprinkle out there or spray to try to cut down on the smell?\n\nAnd please no comments about calling the cops and getting them out of here and how it's gonna multiply and all that, we're obviously trying to deal with this in a more compassionate way right now and that's all there is to it for now and those kind of repsponses are not helpful. Would just love to try to cut that smell down if possible.",
        "subreddit": "smallbusiness",
        "author": "bydavidrosen",
        "score": 347,
        "num_comments": 134,
        "created_utc": 1757012881.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n8j5r6/homeless_smell/",
        "fetched_at": "2025-09-05T08:15:22.806949"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 273,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-09-05T08:15:24.179393"
      },
      {
        "id": "1n86l6t",
        "title": "Don't do like me, save 10 years",
        "selftext": "2018: Launched my first company around an idea. No competitors. No market. 3 years later: dead.\n\nLesson: No competitors usually means no market.\n\n\\--\n\n2022: Switched to solving a real problem. It worked, but the market was tiny.Nice side business, no scale.\n\nLesson: small problem = small outcome.\n\n\\--\n\n2025: Now I’m going after a big market. Competitors are hitting $10M ARR. The pain is universal: lead acquisition. Much easier to sell when you help businesses get more clients. So I launched my own signal-based LinkedIn outreach tool (now \\~100k AAR after 6 months)  \n  \nMy bet: differentiate, ride proven demand, hit $10M ARR too.\n\n\\--\n\nSo here’s the takeaway:\n\nOPTION A: If you want a side hustle, then solve a hyper-specific niche problem.\n\nOPTION B: If you want a bigger company, then build a better alternative in a market where competitors are already making millions.\n\nBut PLEASE\n\nForget unicorn chasing. Play the real game.",
        "subreddit": "Entrepreneur",
        "author": "wawa_masked",
        "score": 260,
        "num_comments": 33,
        "created_utc": 1756982111.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n86l6t/dont_do_like_me_save_10_years/",
        "fetched_at": "2025-09-05T08:15:18.276786"
      },
      {
        "id": "1n7xpo3",
        "title": "Hired a Freelancer. It’s not going well.",
        "selftext": "I hired a freelancer off of Fiverr to set up automated workflows in my CRM. I have a template provided by the CRM company to that I used when I thought I would do it myself. I had a lot done but didn’t have all the canned emails written. \nFreelancer shared a a draft. I made a bunch of revisions because he doesn’t look like he used the template at all. And none of the emails he drafted even have my company logo/email signature on them. \nWe met again today to talk about it and for me to explain the revisions I needed. I left the meeting feeling pretty discouraged. \nThen later today another client emails me confused because they’d just gotten an (automated) email that doesn’t have anything to do with where they are in my process (this client is booked and paid already and the email they received was about proposals). This is the third client to get that email in the last two weeks!\n\nI’m frustrated and worried. I want to give the guy time to work it out but also I want to cut my loses. Do I have too much of a “if you want something done right you’ve got to do it yourself” attitude or is this really not working out?\n\nUpdate: Thank you for your responses I’ve let the freelancer go and am learning a lot from this experience. ",
        "subreddit": "smallbusiness",
        "author": "-me-myself-",
        "score": 253,
        "num_comments": 73,
        "created_utc": 1756951173.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n7xpo3/hired_a_freelancer_its_not_going_well/",
        "fetched_at": "2025-09-05T08:15:22.806981"
      },
      {
        "id": "1n85fgc",
        "title": "i made a free list of 85 places where you can promote your app",
        "selftext": "Every time I launch something new, I end up wasting hours hunting down SaaS directories — bouncing between random lists, checking which ones are still alive, and cobbling together a spreadsheet. It’s messy, inconsistent, and honestly just frustrating.\n\nSo I finally sat down and prepared a clean list of launch directories, places like Reddit, go-publicly and a bunch more. Ended up with 85+ solid ones, all active. I even added Domain Rating (DR) so you can see which sites have stronger authority for SEO and visibility.\n\nNo fluff, no upsell, just the list I wish existed.\n\nIf anyone wants it, happy to share the sheet.\n\nadding the link to sheet since a lot of users are in need \n\n[https://docs.google.com/spreadsheets/d/1shdlZRhhAKNa47B2Lo2I7pIi29vo9MH3mX6u0cV4LoM/edit?gid=0#gid=0](https://docs.google.com/spreadsheets/d/1shdlZRhhAKNa47B2Lo2I7pIi29vo9MH3mX6u0cV4LoM/edit?gid=0#gid=0)",
        "subreddit": "SaaS",
        "author": "Outside_Elephant3445",
        "score": 172,
        "num_comments": 111,
        "created_utc": 1756977877.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n85fgc/i_made_a_free_list_of_85_places_where_you_can/",
        "fetched_at": "2025-09-05T08:15:19.742035"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 150,
        "num_comments": 173,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-05T08:15:24.179373"
      },
      {
        "id": "1n8mk2s",
        "title": "How do you deal with chargebacks as a small business in 2025?",
        "selftext": "So I am running a small online store and getting hammered by chargebacks lately. What used to be 1-2 per month has jumped to 8-10 and it's honestly scary for my cash flow. Must be like 15%...\n\n\n\n\n\n  \nThe patterns I'm seeing:\n\n\n\n\n\n  \n\\- Customer receives item, uses it, then disputes saying \"never received\"\n\n\n\n\n\n  \n\\- People buying expensive items then claiming card was stolen right after delivery\n\n\n\n\n\n  \n\\- Getting \"item not as described\" disputes despite detailed photos and descriptions\n\n\n\n\n\n  \nI'm already doing signature confirmation over $100, tons of product photos, detailed item descriptions, etc. But the chargeback companies seem to automatically side with customers about 90% of the time regardless of what evidence you provide.\n\n\n\n\n\n  \nWhat's actually working for other small business owners in 2025?\n\n\n\n\n\n  \nLooking for advice on:\n\n\n\n\n\n  \n\\- Payment processors that actually defend merchants\n\n\n\n\n\n  \n\\- Documentation strategies that win disputes\n\n\n\n\n\n  \n\\- How to identify suspicious orders before shipping\n\n\n\n\n\n  \n\\- Whether chargeback protection services justify the cost\n\n\n\n\n\n  \nStarting to wonder if I should just stick to local markets because this online stuff is brutal. Any strategies from fellow business owners would be greatly appreciated.\n\n\n\n  \n \n\n  \nThanks in advance for any help! Btw this is my first post on reddit so I hope I'm doing it right. \n\n  \n",
        "subreddit": "smallbusiness",
        "author": "VanillaMeteor5_",
        "score": 145,
        "num_comments": 13,
        "created_utc": 1757020792.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n8mk2s/how_do_you_deal_with_chargebacks_as_a_small/",
        "fetched_at": "2025-09-05T08:15:22.806951"
      },
      {
        "id": "1n8f02j",
        "title": "Do you think success is more about luck or effort?",
        "selftext": "I’ve been thinking about this a lot lately when it comes to success is it mostly about how hard you work or is it really just luck and timing?\n\nOn one hand you always hear the classic advice that effort, discipline and persistence are what truly make the difference. And yeah it’s true that without putting in the work you’re not going to get very far. But at the same time there are so many people who work insanely hard their whole lives and never really “make it” while others seem to be in the right place at the right time and everything just falls into place. Sometimes it feels like success is this weird mix of both you need the effort to be prepared but you also need the luck to get the right break. I can’t tell which side weighs more heavily though.\n\nWhat do you think does effort always pay off in the long run or is success mostly about luck and timing?",
        "subreddit": "Entrepreneur",
        "author": "GalaxyFrog28",
        "score": 140,
        "num_comments": 95,
        "created_utc": 1757003459.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n8f02j/do_you_think_success_is_more_about_luck_or_effort/",
        "fetched_at": "2025-09-05T08:15:18.276776"
      },
      {
        "id": "1n8fjvl",
        "title": "Going bankrupt.",
        "selftext": "I don't know what to do.\n\nI quit my job a few months ago to start working on my own thing.\n\nThrough sheer force of personality, I managed to get a guy to generate leads for me on a commission deal.\n\nLanded a big client and another one in the pipeline.\n\nI spent all my money on tools and hiring a guy to help me out with some manual work (it was like a lot of manual work).\n\nI started the first day for the client today. Because of the tools and stuff, that client's money is basically gone now. And I still have a month of work to do for it.\n\nTo make things worse, I sold the client on a promise. I did a decent amount of research but had no actual tested game plan that was guaranteed to work. Today I realized that what I promised may actually just not work.\n\nI risked it all, currently I'm in a hotel room I'm paying for that I have to get out of in 5 days (I got a hotel because rent with deposit was more expensive for the month than a cheap hotel room). I'm in China just to get clients here but I don't even have a visa, I'm just doing visa free 30 days on repeat.\n\nI don't know what to do. \n\nOn paper, I am pretty good. I'm 23, I can build impressive projects with code, I have a good sales experience and work experience in different fields, which is pretty rare in my age I believe.\n\nI never really asked anyone for help but I really need some now. Do you see any skillset that you could use from me? I'd look for a job here but I literally don't know the language. And I don't want to go back to Mongolia (that's where I'm from).\n\nIf you can't help, that's cool. I'm just writing this to calm down\n\n",
        "subreddit": "Entrepreneur",
        "author": "Square_Highlight9593",
        "score": 111,
        "num_comments": 76,
        "created_utc": 1757004709.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n8fjvl/going_bankrupt/",
        "fetched_at": "2025-09-05T08:15:18.276783"
      }
    ]
  }
}