{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-06T00:52:12.559352"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-06T00:52:05.512539"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-06T00:52:05.102249"
      },
      {
        "videoId": "1A0C2Ux7ESw",
        "title": "Video Editing like a Pro: Organizing Your Timeline",
        "description": "videoeditingtips #filmmaking #editing #editingworkflow #timelineorganisation #videoeditingtricks #creative #youtube.",
        "channelTitle": "The Editing Podcast",
        "publishedAt": "2023-04-01T13:00:01Z",
        "url": "https://www.youtube.com/watch?v=1A0C2Ux7ESw",
        "fetched_at": "2025-09-06T00:52:05.102258"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-06T00:52:05.102238"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-06T00:52:05.512537"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-06T00:52:05.512545"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-06T00:52:05.512542"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-06T00:52:05.102254"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-06T00:52:05.512527"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-06T00:52:05.102256"
      }
    ],
    "reddit": [
      {
        "id": "1n8j5r6",
        "title": "Homeless Smell",
        "selftext": "Lately we've had some homeless people sleeping by our business at night. They're respectful and leave before we get in in the morning and clean up after themselves. I've had conversations with them and they know that as long as more people don't start showing up and they keep it clean, we're basically cool. But there is a smell. So my question is outside of getting rid of them altogether, any suggestions for dealing with the smell? Is there a product I can buy, some kind of deodorizer or something I can sprinkle out there or spray to try to cut down on the smell?\n\nAnd please no comments about calling the cops and getting them out of here and how it's gonna multiply and all that, we're obviously trying to deal with this in a more compassionate way right now and that's all there is to it for now and those kind of repsponses are not helpful. Would just love to try to cut that smell down if possible.",
        "subreddit": "smallbusiness",
        "author": "bydavidrosen",
        "score": 506,
        "num_comments": 171,
        "created_utc": 1757012881.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n8j5r6/homeless_smell/",
        "fetched_at": "2025-09-06T00:52:10.280520"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 443,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-06T00:52:11.558000"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 274,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-09-06T00:52:11.558057"
      },
      {
        "id": "1n8mk2s",
        "title": "How do you deal with chargebacks as a small business in 2025?",
        "selftext": "So I am running a small online store and getting hammered by chargebacks lately. What used to be 1-2 per month has jumped to 8-10 and it's honestly scary for my cash flow. Must be like 15%...\n\n\n\n\n\n  \nThe patterns I'm seeing:\n\n\n\n\n\n  \n\\- Customer receives item, uses it, then disputes saying \"never received\"\n\n\n\n\n\n  \n\\- People buying expensive items then claiming card was stolen right after delivery\n\n\n\n\n\n  \n\\- Getting \"item not as described\" disputes despite detailed photos and descriptions\n\n\n\n\n\n  \nI'm already doing signature confirmation over $100, tons of product photos, detailed item descriptions, etc. But the chargeback companies seem to automatically side with customers about 90% of the time regardless of what evidence you provide.\n\n\n\n\n\n  \nWhat's actually working for other small business owners in 2025?\n\n\n\n\n\n  \nLooking for advice on:\n\n\n\n\n\n  \n\\- Payment processors that actually defend merchants\n\n\n\n\n\n  \n\\- Documentation strategies that win disputes\n\n\n\n\n\n  \n\\- How to identify suspicious orders before shipping\n\n\n\n\n\n  \n\\- Whether chargeback protection services justify the cost\n\n\n\n\n\n  \nStarting to wonder if I should just stick to local markets because this online stuff is brutal. Any strategies from fellow business owners would be greatly appreciated.\n\n\n\n  \n \n\n  \nThanks in advance for any help! Btw this is my first post on reddit so I hope I'm doing it right. \n\n  \n",
        "subreddit": "smallbusiness",
        "author": "VanillaMeteor5_",
        "score": 163,
        "num_comments": 17,
        "created_utc": 1757020792.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n8mk2s/how_do_you_deal_with_chargebacks_as_a_small/",
        "fetched_at": "2025-09-06T00:52:10.280536"
      },
      {
        "id": "1n98grg",
        "title": "Friendly reminder to renegotiate all contracts",
        "selftext": "I signed a 5 year contract with Waste Management for a 2 yard bin. Started at $160 a month. Then it went up about 20%+ every year. I have the contract on autopay and last year after it went up to $350 from $280, I saw on my invoice that I had the option of opting our of the contract because of the size of the price increase, but and that payment meant that I opted in. I didn't notice until after the bill was auto paid. So I looked at my bill every month waiting for the next increase. Sure enough, it went to $450 this month. I called a different waste company and they quoted me at $140 a month. I called WM to cancel the contract and they asked to match. I said I would listen. They quoted $135. I said no. Got another call today with the price of $90. I said no again. I would rather the company that hasn't cost me thousands a year. \n\nRandomly a supplier (a paper company because I am a printer), who I used to use more before finding a slightly inferior alternative at a 10% better price, offered me MUCH better pricing (18% lower than the cheaper option) on a product that should be in between quality of their old paper and the different company's paper. \n\nI am currently going to reach out to a company that does maintenance on one of my machines at an unfavorable rate to see if they will match the maintenance contact on a different machine which I use more now. \n\nBy the end of the week, I can save about $20k a year by calling and negotiating. ",
        "subreddit": "smallbusiness",
        "author": "nettcity",
        "score": 160,
        "num_comments": 19,
        "created_utc": 1757086394.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n98grg/friendly_reminder_to_renegotiate_all_contracts/",
        "fetched_at": "2025-09-06T00:52:10.280509"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 148,
        "num_comments": 173,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-06T00:52:11.558038"
      },
      {
        "id": "1n8z73d",
        "title": "Every startup thinks they need more meetings. Ours almost died because of them.",
        "selftext": "As a founder, I used to think the more we talk, the better the business will run and honestly that was a big mistake.\n\nWe were drowning in meetings endless check-ins, status updates, syncs. It felt like we were working but in reality, nothing was moving forward. Eventually, it almost killed our momentum (and nearly the company).\n\nThe big unlock? Cutting down meetings, automating note-taking/recaps, and focusing only on conversations that drive revenue or strategy. Everything else at async.\n\nI’m curious, how do other entrepreneurs handle this? Do you run lean on meetings, or do you still rely on them heavily?",
        "subreddit": "Entrepreneur",
        "author": "GcNiceKick8846",
        "score": 127,
        "num_comments": 48,
        "created_utc": 1757059056.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n8z73d/every_startup_thinks_they_need_more_meetings_ours/",
        "fetched_at": "2025-09-06T00:52:06.009170"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 108,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-06T00:52:11.558042"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 100,
        "num_comments": 57,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-06T00:52:11.558025"
      },
      {
        "id": "1n983ir",
        "title": "Share your startup, I’ll find 5 potential customers for you (free).",
        "selftext": "Hey everyone,\n\nI’d love to help some founders here connect with real potential customers.  \nDrop your startup link + a quick line about who your target customer is.\n\nWithin 24 hours, I’ll send you 5 people who are *already showing buying intent* for something like what you’re building.\n\nI’ll be using our tool [**gojiberry.ai**](http://gojiberry.ai), which tracks online conversations for signals that someone is in the market. But this is mostly an experiment to see if it’s genuinely useful for folks here.\n\nAll I need from you:\n\n* Your website\n* One sentence on who it’s for\n\nCapping this at 20 founders since it requires some manual work on my end.",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 98,
        "num_comments": 150,
        "created_utc": 1757085547.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n983ir/share_your_startup_ill_find_5_potential_customers/",
        "fetched_at": "2025-09-06T00:52:07.421491"
      }
    ]
  }
}