{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-26T16:15:26.113199"
  },
  "data": {
    "youtube": [
      {
        "videoId": "Q1tCEvqakUo",
        "title": "Fastest Editing Workflow in DaVinci Resolve! - Perfect for Tutorials and How To Vids!",
        "description": "Get the FREE practice media here: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2025-10-14T14:00:41Z",
        "url": "https://www.youtube.com/watch?v=Q1tCEvqakUo",
        "fetched_at": "2025-11-26T16:15:16.825973"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-26T16:15:17.189555"
      },
      {
        "videoId": "8MQfZTjbvPw",
        "title": "🔥 This FREE plugin will change your video editing workflow FOREVER!",
        "description": "Say hello to Premiere Composer, packed with transitions, sound effects, and motion graphics #videoeditingtips #premierepro ...",
        "channelTitle": "Sebastien Jefferies",
        "publishedAt": "2025-04-15T17:21:05Z",
        "url": "https://www.youtube.com/watch?v=8MQfZTjbvPw",
        "fetched_at": "2025-11-26T16:15:16.825993"
      },
      {
        "videoId": "6SadD5fbneQ",
        "title": "My Editing Workflow (End to End for a Simple Video)",
        "description": "Quite a few people have asked me to describe my end-to-end workflow for editing videos; here it is (for the simplest kind of video ...",
        "channelTitle": "Atomic Shrimp",
        "publishedAt": "2025-03-01T08:00:04Z",
        "url": "https://www.youtube.com/watch?v=6SadD5fbneQ",
        "fetched_at": "2025-11-26T16:15:16.825964"
      },
      {
        "videoId": "954L0eVIdaE",
        "title": "How I Would Learn Video Editing (If I Had to Start Over in 2025)",
        "description": "If I could go back in time and learn video editing, I would do a lot of things differently. In this video, I walk you through an entire ...",
        "channelTitle": "Gavin Herman",
        "publishedAt": "2025-01-22T22:00:10Z",
        "url": "https://www.youtube.com/watch?v=954L0eVIdaE",
        "fetched_at": "2025-11-26T16:15:16.825987"
      },
      {
        "videoId": "DYOPXAmwHgA",
        "title": "Final Cut Pro 11: Boost Your Workflow with AI Magic! |@TECHSENSEI24",
        "description": "Final Cut Pro 11: Boost Your Workflow with AI Magic! Join Marques Brownlee, Andrew Manganelli, and David Imel in this ...",
        "channelTitle": "TECH SENSEI",
        "publishedAt": "2024-11-17T14:30:09Z",
        "url": "https://www.youtube.com/watch?v=DYOPXAmwHgA",
        "fetched_at": "2025-11-26T16:15:16.825990"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-26T16:15:16.825942"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-11-26T16:15:16.825945"
      },
      {
        "videoId": "QIJPxeI--QQ",
        "title": "Effective Editing Workflow that can save you hours! Davinci Resolve Beginner Tips",
        "description": "Download the HeartSupport Media files here: https://www.groundcontrol.film/heartsupport And you can download my Keyboard ...",
        "channelTitle": "MrAlexTech",
        "publishedAt": "2024-05-27T22:41:51Z",
        "url": "https://www.youtube.com/watch?v=QIJPxeI--QQ",
        "fetched_at": "2025-11-26T16:15:16.825978"
      },
      {
        "videoId": "NBiqQED27sI",
        "title": "Pro Editor&#39;s First Steps To Editing A Movie - Lucas Harger",
        "description": "Our two new books... STORY QUESTIONS is currently 10% off! - https://payhip.com/b/ZTvq9 and 17 Steps To Writing A Great Main ...",
        "channelTitle": "Film Courage",
        "publishedAt": "2024-03-18T00:00:09Z",
        "url": "https://www.youtube.com/watch?v=NBiqQED27sI",
        "fetched_at": "2025-11-26T16:15:16.825985"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 482,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-26T16:15:25.111822"
      },
      {
        "id": "1p6a1u5",
        "title": "(Rant) I HATE ALL THIS AI STUFF!!!",
        "selftext": "I get a TON of chat requests saying \"hey, I built this AI tool that helps businesses do XYZ...\"; I DON'T CARE that it's \"AI-powered\", as a business owner all I care about is \"does it get the job done RIGHT, THE FIRST TIME?\"!\n\nWere in an AI bubble right now because people are deluded into thinking that \"AI\" means \"I'll get funding\"...but if your business/tool/app/site doesn't actually DO anything BETTER than what's already out there, you're TOAST.\n\nAnd STOP with all this \"AI is a new thing\" nonsense. Quake III had a pretty good AI, as did Battlefront II.\n\nEnd Rant. Thanks for listening. \n\nNow get back to building.",
        "subreddit": "Entrepreneur",
        "author": "Broad-Worry-5395",
        "score": 177,
        "num_comments": 86,
        "created_utc": 1764070012.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p6a1u5/rant_i_hate_all_this_ai_stuff/",
        "fetched_at": "2025-11-26T16:15:17.975582"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 134,
        "num_comments": 62,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-11-26T16:15:25.111832"
      },
      {
        "id": "1p789gc",
        "title": "A tiny FaceSeek insight made me rethink small product decisions",
        "selftext": "A small detail in FaceSeek while I was sketching a feature idea made me consider how much a product's direction can be shaped by minor adjustments. Planning big features seems less important when resources are scarce than making the correct small adjustments. How do you determine which refinements are most important? Do you focus on customer feedback speed of implementation or strategic alignment? In order to prioritise significant improvements without overcrowding the roadmap, I want to develop a straightforward framework. I could improve my own process by learning how others handle this.",
        "subreddit": "SaaS",
        "author": "Available-Street6039",
        "score": 70,
        "num_comments": 0,
        "created_utc": 1764165155.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p789gc/a_tiny_faceseek_insight_made_me_rethink_small/",
        "fetched_at": "2025-11-26T16:15:19.717872"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 70,
        "num_comments": 49,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-26T16:15:25.111853"
      },
      {
        "id": "1p6s0do",
        "title": "Client building without permit is threatening to sue me over a $150 city fee. Am I crazy?",
        "selftext": "I’m a solo design professional and I need a sanity check. I’ve never had a client behave like this and I don’t have a mentor to run this by.\n\n**The Context:**\n\n* I have a client who started construction **before** the building permit was issued. He is currently panicked because he’s risking a Stop Work Order or worse.\n* The City review process has been frustrating. The reviewer used generic \"boilerplate\" comments and didn't mark up/redline the reports, just the plans. This ambiguity caused a 3rd review cycle.\n* The City charged a re-submittal fee. It is **$150**.\n\n**The Conflict:**\n\n* The Client is demanding I pay this $150 fee out of my own pocket.\n* My contract (and industry standard) states that all agency/permit fees are the Owner's responsibility.\n* I am currently fighting the City to waive the fee on his behalf because I agree the review was lazy, but I told the Client I will not pay it personally if the waiver is denied.\n\n**The Behavior:**\n\n* He is texting me \"???\" late at night.\n* He told me \"I’m a businessman, I know how this works,\" and accused me of \"not taking ownership\" because I won't pay the $150.\n* **He has threatened to sue me.**\n\n**My Position:** I feel like he is projecting his anxiety about his illegal construction onto me. He wants me to pay the fee to validate his narrative that the delays are my fault, not the City's or his own. I’m holding the line on the $150 not because of the money, but because paying it feels like an admission of guilt/liability.\n\nHas anyone dealt with a client like this? Am I wrong for refusing to pay a small fee just to make him shut up, given that he’s already threatened legal action?\n\n**TL;DR:** Client building illegally is trying to bully me into paying a $150 City fee and threatening to sue. I'm standing my ground.",
        "subreddit": "smallbusiness",
        "author": "QualityAntique5582",
        "score": 66,
        "num_comments": 90,
        "created_utc": 1764113203.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p6s0do/client_building_without_permit_is_threatening_to/",
        "fetched_at": "2025-11-26T16:15:23.369543"
      },
      {
        "id": "1p6yccm",
        "title": "Feel like a complete failure, hardly any growth in last 1 year",
        "selftext": "I have been building my SaaS for nearly 3 years now. I sit to work every day by 9 am and have been putting 4 to 8 hours of work daily, except weekends.   \nWhile browsing today, I came across another SaaS website, the name seemed familiar, and then I recalled it had started at the same time I had started 3 years back giving the same service which I am building. I checked the founders X profile and saw he has reached $15K MRR and is targeting $1M. My SaaS hardly pulls in $200 MRR. \n\nThis makes me feel like a complete failure, I am in my mid 40s and the other founder is probably decades younger to me. This age gap doesn't help either and makes the feeling worse. \n\nFrom a logical perspective, I can make peace with this, but I don't like it when it pulls my enthusiasm and motivation down. And this did pull me down, although temporarily.",
        "subreddit": "SaaS",
        "author": "rookie-bee",
        "score": 63,
        "num_comments": 69,
        "created_utc": 1764131140.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p6yccm/feel_like_a_complete_failure_hardly_any_growth_in/",
        "fetched_at": "2025-11-26T16:15:19.717867"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 53,
        "num_comments": 51,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-11-26T16:15:25.111860"
      },
      {
        "id": "1p6y44y",
        "title": "You need a beachhead",
        "selftext": "Many people know that Amazon started off by selling books. But they weren't just any books, they sold technical non-fiction books. Their first sale ever was Fluid Concepts and Creative Analogies by Douglas Hofstadter, a technical cognitive-science book.\n\nWhy? Because they saw a problem in this very specific market niche. Buyers knew exactly what they wanted, but it was often hard to find these technical books at local bookstores. Amazon delivered them to you. These technical books were their beachhead.\n\nThis allowed them to prove themselves and they quickly expanded to other books, then DVDs then home goods. Now Amazon is the everything store.\n\nIf you are just starting or trying to grow your business think carefully about your market entry strategy. You can't sell to everyone at first. Find that one specific type of customer that has a very specific problem you can solve. That is your beachhead.",
        "subreddit": "Entrepreneur",
        "author": "spencert46",
        "score": 48,
        "num_comments": 16,
        "created_utc": 1764130426.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p6y44y/you_need_a_beachhead/",
        "fetched_at": "2025-11-26T16:15:17.975547"
      },
      {
        "id": "1p736ef",
        "title": "What automation blew your mind recently as an entrepreneur?",
        "selftext": "I saw this in a different sub reddit but made more sense for entrepreneurs. So asking it here! AI has been creeping into every corner of business, but every now and then there’s a workflow or automation that feels next-level! Something thats way smarter, faster  or more effective than you expected. \n\nSo I'm curious, what AI-powered marketing automation recently blew your mind?",
        "subreddit": "Entrepreneur",
        "author": "Sure_Marsupial_4309",
        "score": 47,
        "num_comments": 38,
        "created_utc": 1764148235.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p736ef/what_automation_blew_your_mind_recently_as_an/",
        "fetched_at": "2025-11-26T16:15:17.975545"
      }
    ]
  }
}