{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-15T16:12:49.511693"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-15T16:12:41.144415"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-15T16:12:41.144417"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-15T16:12:40.791114"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-15T16:12:40.791103"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-15T16:12:41.144411"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-15T16:12:41.144413"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-10-15T16:12:40.791119"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-15T16:12:40.791116"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-15T16:12:41.144404"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-15T16:12:40.791118"
      }
    ],
    "reddit": [
      {
        "id": "1o6g42g",
        "title": "I just made $1.5 B by selling my SaaS (AMA)",
        "selftext": "The title speaks for itself. I've been a software developer for four hours. Last night as I was playing with my toy trains in my mom’s basement I came up with the idea of not just another service, or an agent for the sake of an agent but a truly in-demand service. Took a two hour break from scrolling Reddit, watched an 5 minute intro to HTML & CSS tutorial and coded the most brilliant software ever created (to-do app that saves to localStorage).\n\nAn hour later and I have over 100 million visits (DDoS attack) which is truly unimaginable growth, I never expected my product to catch on THIS fast. Also, I received a call from a huge company (Indian customer service I think that tells you all you need to know ;) ) about buying my app for $1.5 billion and a contract that includes free use of the company’s private jet, private island, mansion and more.\n\nI instantly accepted their offer, gave the my mom’s credit card number and internet banking password and am currently waiting for the money to come in. To say it's a it career speedrun is an understatement :) my relatives don't know (my mom has no idea lol), real-life gf non existent. Only my imaginary furry girlfriend knows because I tell her everything (she makes me, otherwise I get punished).\n\nThere is no point in advertising anything anymore, so I will answer your questions as best as I can while waiting for my money to come in. \n\nThe most important thing to know is that luck is, of course, very important, but the most important thing is your ideas.\n\n>I will be answering your questions but I’m closing the AMA because my mom says she wants to have a talk (she must be so proud and happy!!)",
        "subreddit": "SaaS",
        "author": "Ok-Firefighter4745",
        "score": 804,
        "num_comments": 202,
        "created_utc": 1760449951.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o6g42g/i_just_made_15_b_by_selling_my_saas_ama/",
        "fetched_at": "2025-10-15T16:12:43.571961"
      },
      {
        "id": "1o6dl9g",
        "title": "We scaled from 3 to 12 employees this year and I feel like our spending is getting out of control",
        "selftext": "I run a small digital marketing agency started it in my apartment three years ago with two friends. This year, things finally took off. We signed a few big clients, hired more people, and for the first time, we’re actually profitable. But now it feels like we’ve hit a new kind of chaos. Everyone has cards, subscriptions multiply overnight, and invoices pop up from random tools that nobody remembers signing up for. Last month, I found out we’d been paying for two different analytics platforms because two departments didn’t realize they were using the same thing. We’re not “corporate” enough to hire a CFO, but I’m spending way too much time trying to figure out where money’s going. I’ve tried using Google Sheets and QuickBooks tags, but it still feels like patchwork. For those of you who hit this stage how do you keep visibility without micromanaging? Is there a system that actually works for small but growing teams?",
        "subreddit": "Entrepreneur",
        "author": "earnest_scarcity",
        "score": 553,
        "num_comments": 137,
        "created_utc": 1760443347.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o6dl9g/we_scaled_from_3_to_12_employees_this_year_and_i/",
        "fetched_at": "2025-10-15T16:12:41.865558"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 464,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-15T16:12:48.510397"
      },
      {
        "id": "1o6a2jg",
        "title": "I made my first $300 online, and it completely changed how I see money.",
        "selftext": "I know it’s not a big number, but damn, it hit different. I spent months learning, reading, watching videos, trying random side hustles. Then one day, I woke up to a PayPal notification, someone bought a digital product I made myself. $15. Then another. And another. By the end of the week, I had $300. It’s not about the money, it’s about realizing that I can \\*create\\* value and get paid for it. That one moment flipped a switch in my brain. Now I can’t stop thinking about how to scale, optimize, build more. It’s like a whole new level of freedom I didn’t know existed.",
        "subreddit": "Entrepreneur",
        "author": "Ocharen",
        "score": 406,
        "num_comments": 63,
        "created_utc": 1760431244.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o6a2jg/i_made_my_first_300_online_and_it_completely/",
        "fetched_at": "2025-10-15T16:12:41.865579"
      },
      {
        "id": "1o6dmvd",
        "title": "How do you all handle employee expenses without losing your mind?",
        "selftext": "Every end of the month turns into this massive chore chasing down missing receipts, checking if that Starbucks charge was a client meeting or just coffee, sorting random Venmo reimbursements, etc. I thought I could handle it manually with a simple shared Google Sheet, but as soon as we hit six employees, it started spiraling. Half the receipts get lost, nobody remembers what category things belong to, and by the time I match everything, the month’s already over. It’s not even about people overspending I trust the team it’s just the administrative chaos that eats away hours every week. I’ve looked at some apps that claim to “automate” the process, but most feel like overkill or require everyone to constantly log in and upload stuff.  \nWhat do you all use to make this less painful? Ideally something that doesn’t require a whole finance department to manage.",
        "subreddit": "smallbusiness",
        "author": "secretivethriller67",
        "score": 284,
        "num_comments": 79,
        "created_utc": 1760443481.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o6dmvd/how_do_you_all_handle_employee_expenses_without/",
        "fetched_at": "2025-10-15T16:12:46.736511"
      },
      {
        "id": "1o7deey",
        "title": "Started offering a \"throwaway\" service to keep customers happy and now it makes more than my actual business",
        "selftext": "I need some perspective here: I run a small landscaping company, been doing it for about 4 years now. Standard stuff like lawn maintenance, seasonal cleanups, mulching, the usual.\n\nAbout 8 months ago I had this one client who kept asking if I could pressure wash their driveway while I was already there doing their yard. I said sure whatever, charged them like $75 extra just to not deal with scheduling another visit. Took me maybe 30 mins.\n\nWord got around I guess because then other clients started asking. I figured why not, easy add on right? Fast forward to now and I'm getting calls specifically for pressure washing. Like people don't even want the landscaping part anymore they just want their driveways, decks, house siding done.\n\nDid the math last week and the pressure washing stuff brought in almost double what the landscaping did last month. I've got some money saved up from the busy season so I could buy better equipment and actually pivot to this full time but it feels weird abandoning what I started with?\n\nAnyone else deal with something like this where a side thing accidentally became the main thing? Do I just roll with it or am I overthinking this",
        "subreddit": "smallbusiness",
        "author": "young_wealth",
        "score": 212,
        "num_comments": 43,
        "created_utc": 1760540467.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o7deey/started_offering_a_throwaway_service_to_keep/",
        "fetched_at": "2025-10-15T16:12:46.736497"
      },
      {
        "id": "1o6oagz",
        "title": "Most clients don’t want cheap. They want chill.",
        "selftext": "Had a client last month who said my quote was “a bit high.”\nCool. Three weeks later they came back crying because the “cheaper guy” ghosted them mid-project.\n\nAnyway, I took them back. Same price. Same deliverables.\nThis time they paid instantly.\nNot because I suddenly became affordable, because they were tired of chaos.\n\nThat’s the funny part.\nMost clients don’t leave because of cost.\nThey leave because your process feels like applying for a passport.\n\nYou can literally double your rate if working with you feels smooth.\nPeople pay for peace of mind, not pricing tables.\n\nSo yeah, it’s not your price that’s scaring clients away.\nIt’s the friction. The waiting. The micro-annoyances.\nThat “I’ll get back to you soon” email that takes 3 business days.\n\nMake it easy to say yes.\nThat’s the real discount.\n",
        "subreddit": "Entrepreneur",
        "author": "ksundaram",
        "score": 207,
        "num_comments": 32,
        "created_utc": 1760468152.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o6oagz/most_clients_dont_want_cheap_they_want_chill/",
        "fetched_at": "2025-10-15T16:12:41.865557"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 174,
        "num_comments": 48,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-15T16:12:48.510435"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 165,
        "num_comments": 56,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-15T16:12:48.510427"
      },
      {
        "id": "1o6lgzz",
        "title": "The one thing I wish I had known about being the \"boss\"",
        "selftext": "I have been in business 10 years, Started a lice treatment company from my kitchen and now have 5 locations.  I could have saved myself so much trouble if I would have learned to fire people faster from the jump. It's  one of the most uncomfortable conversations to have, AND you feel bad, AND you want to believe in the ability for people to change, AND you feel stupid for the poor hiring decision. Hear me when I say this.  FIRE FASTER!  The minute you get that nagging feeling, just do it. Rip off the band aid and move on.  Once things go downhill, they will never improve to the level that you need to run your biz.",
        "subreddit": "smallbusiness",
        "author": "theLiceNanny",
        "score": 144,
        "num_comments": 15,
        "created_utc": 1760461963.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o6lgzz/the_one_thing_i_wish_i_had_known_about_being_the/",
        "fetched_at": "2025-10-15T16:12:46.736509"
      }
    ]
  }
}