{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-26T08:17:42.725715"
  },
  "data": {
    "youtube": [
      {
        "videoId": "Q1tCEvqakUo",
        "title": "Fastest Editing Workflow in DaVinci Resolve! - Perfect for Tutorials and How To Vids!",
        "description": "Get the FREE practice media here: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2025-10-14T14:00:41Z",
        "url": "https://www.youtube.com/watch?v=Q1tCEvqakUo",
        "fetched_at": "2025-11-26T08:17:34.235446"
      },
      {
        "videoId": "_XySZQrHPCE",
        "title": "Steal This Easy Vlog Editing Workflow, It&#39;ll Simplify Everything",
        "description": "Get 2 extra months free on an annual plan from Motion Array https://geni.us/tEEoIY 🎞️ New to video editing? Learn the ...",
        "channelTitle": "Tamara Gabriel",
        "publishedAt": "2025-07-18T11:18:22Z",
        "url": "https://www.youtube.com/watch?v=_XySZQrHPCE",
        "fetched_at": "2025-11-26T08:17:34.235459"
      },
      {
        "videoId": "mjiT0g3mYgw",
        "title": "9 Editing Tips To Save HOURS in DaVinci Resolve!",
        "description": "9 Editing Tips in DaVinci Resolve you probably didn't know! In this DaVinci Resolve tutorial, I'm going to show you 9 powerful ...",
        "channelTitle": "Sightseeing Stan",
        "publishedAt": "2025-05-26T14:01:15Z",
        "url": "https://www.youtube.com/watch?v=mjiT0g3mYgw",
        "fetched_at": "2025-11-26T08:17:34.235457"
      },
      {
        "videoId": "JEAkQLMxqtw",
        "title": "How to Set Up Your Books as a New Business Owner",
        "description": "Bookkeeping doesn't have to be scary—and getting it right from day one can save you major headaches down the road. In this ...",
        "channelTitle": "Mark J Kohler",
        "publishedAt": "2025-04-29T21:54:58Z",
        "url": "https://www.youtube.com/watch?v=JEAkQLMxqtw",
        "fetched_at": "2025-11-26T08:17:34.507181"
      },
      {
        "videoId": "6SadD5fbneQ",
        "title": "My Editing Workflow (End to End for a Simple Video)",
        "description": "Quite a few people have asked me to describe my end-to-end workflow for editing videos; here it is (for the simplest kind of video ...",
        "channelTitle": "Atomic Shrimp",
        "publishedAt": "2025-03-01T08:00:04Z",
        "url": "https://www.youtube.com/watch?v=6SadD5fbneQ",
        "fetched_at": "2025-11-26T08:17:34.235442"
      },
      {
        "videoId": "YoxVhLdfEdE",
        "title": "Easy Animate Noob VS Pro Editing",
        "description": "Check out our Website: https://pixflow.net/video-templates/ LIKE this video, SUBSCRIBE to us, and hit the NOTIFICATION BELL to ...",
        "channelTitle": "Pixflow",
        "publishedAt": "2024-12-26T14:30:24Z",
        "url": "https://www.youtube.com/watch?v=YoxVhLdfEdE",
        "fetched_at": "2025-11-26T08:17:34.235469"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-11-26T08:17:34.507177"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-26T08:17:34.235423"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-11-26T08:17:34.235429"
      },
      {
        "videoId": "QIJPxeI--QQ",
        "title": "Effective Editing Workflow that can save you hours! Davinci Resolve Beginner Tips",
        "description": "Download the HeartSupport Media files here: https://www.groundcontrol.film/heartsupport And you can download my Keyboard ...",
        "channelTitle": "MrAlexTech",
        "publishedAt": "2024-05-27T22:41:51Z",
        "url": "https://www.youtube.com/watch?v=QIJPxeI--QQ",
        "fetched_at": "2025-11-26T08:17:34.235451"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 480,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-26T08:17:41.724339"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 185,
        "num_comments": 37,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-26T08:17:41.724395"
      },
      {
        "id": "1p6a1u5",
        "title": "(Rant) I HATE ALL THIS AI STUFF!!!",
        "selftext": "I get a TON of chat requests saying \"hey, I built this AI tool that helps businesses do XYZ...\"; I DON'T CARE that it's \"AI-powered\", as a business owner all I care about is \"does it get the job done RIGHT, THE FIRST TIME?\"!\n\nWere in an AI bubble right now because people are deluded into thinking that \"AI\" means \"I'll get funding\"...but if your business/tool/app/site doesn't actually DO anything BETTER than what's already out there, you're TOAST.\n\nAnd STOP with all this \"AI is a new thing\" nonsense. Quake III had a pretty good AI, as did Battlefront II.\n\nEnd Rant. Thanks for listening. \n\nNow get back to building.",
        "subreddit": "Entrepreneur",
        "author": "Broad-Worry-5395",
        "score": 172,
        "num_comments": 83,
        "created_utc": 1764070012.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p6a1u5/rant_i_hate_all_this_ai_stuff/",
        "fetched_at": "2025-11-26T08:17:35.186950"
      },
      {
        "id": "1p5ibhk",
        "title": "hot take: the first 10 users of any startup are just people who liked the founder- I will not promote",
        "selftext": "so I was watching this Sauce VC podcast on Masters union yt channel (don't ask why, I was procrastinating)\n\nand they said something like: **“the founder’s passion attracts the first alpha users + early employees.”** and honestly… yeah. I’ve literally never seen an early-stage startup where the *product* was the reason people showed up. it’s always the founder. their energy. their delusion.\n\nso tell me if you’ve ever joined an early startup or tested an early app… did you do it for the product or because the founder was your friend ???",
        "subreddit": "startups",
        "author": "Alternative-Wish9912",
        "score": 97,
        "num_comments": 38,
        "created_utc": 1763994143.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p5ibhk/hot_take_the_first_10_users_of_any_startup_are/",
        "fetched_at": "2025-11-26T08:17:38.347657"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 84,
        "num_comments": 47,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-11-26T08:17:41.724350"
      },
      {
        "id": "1p6f252",
        "title": "Shipped 8 SaaS products in 2 years. Here's my complete 10-14 day build process, tech stack, and why speed matters more than perfection",
        "selftext": "Most developers overthink their tech stack and spend 3-6 months building before launching. I tested eight different SaaS products over two years, and the stack that consistently got me from validated idea to production in 10-14 days became my competitive advantage as a solo founder.\n\n**The Complete Tech Stack:**\n\nFrontend Next.js 14 with App Router, TailwindCSS for styling, shadcn/ui for component library. Why this matters: Server-side rendering is crucial for SEO from day one, the component library speeds up UI development by 5x compared to building from scratch, and React's ecosystem means every problem has been solved by someone already. Backend Next.js API routes, no separate backend until you hit $50K+ MRR. Why: maintaining one codebase in one repo with one deploy process eliminates 90% of DevOps complexity early stage. Zero API versioning headaches, no CORS issues, simpler mental model.Database Supabase (Postgres) with Prisma ORM for type safety. Why: free tier genuinely covers your first 1,000 users, real-time subscriptions are built-in if you need them, migrations are straightforward, and you can always migrate to any Postgres host later if needed. Auth Clerk or NextAuth, absolutely never build authentication yourself. Why: two-hour setup versus two weeks of custom building that will inevitably have security holes you don't know about. Payments Stripe with proper webhook handling. Why: webhooks are reliable, documentation is exceptional, everyone trusts Stripe checkout, and international payments just work. Hosting Vercel for frontend (push to deploy, zero config), Supabase for database and storage.\n\n**The 10-14 Day Build Process:**\n\nDays 1-2: Set up boilerplate with the entire stack above. Never start from absolute scratch use starter templates or your own boilerplate. Days 3-7: Build exactly one core feature. Not a dashboard. Not analytics. Not user settings. Just the single feature that solves the validated pain point from your customer interviews. This is the hardest part resisting feature creep. Days 8-10: Integrate Stripe completely, test every payment scenario including failures, implement basic error handling and logging. Ugly UI is completely acceptable at this stage. Working checkout is absolutely mandatory. Days 11-12: Deploy to production on your actual domain, test the entire flow end-to-end as a real user would, fix only critical bugs that break core functionality. Days 13-14: Create a simple landing page explaining the value proposition clearly, prepare basic launch assets (screenshots, demo video if needed), and ship it to your first users.\n\n**What I Deliberately Skip:**\n\nCustom backend architecture, GraphQL (REST is fine), microservices (monolith until $100K+ MRR), custom design systems (Tailwind + shadcn is enough), complex state management (React hooks are sufficient), testing beyond manual testing (add tests after revenue).The pattern I've learned: speed of iteration matters infinitely more than technical perfection at the start. Every week you spend perfecting architecture is a week you're not learning from real users. I've documented this entire process with actual code examples, deployment checklists, and common pitfalls in [Toolkit](http://foundertoolkit.org) based on building these eight products.",
        "subreddit": "SaaS",
        "author": "Express_Memory_8236",
        "score": 80,
        "num_comments": 16,
        "created_utc": 1764083832.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p6f252/shipped_8_saas_products_in_2_years_heres_my/",
        "fetched_at": "2025-11-26T08:17:36.809544"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 74,
        "num_comments": 47,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-26T08:17:41.724371"
      },
      {
        "id": "1p63nb6",
        "title": "If you had to restart your income streams from zero today, what would your first 48 hours look like?",
        "selftext": "Not hypotheticals. Actual step-by-step actions you’d take immediately.",
        "subreddit": "Entrepreneur",
        "author": "Timely-Fondant-7228",
        "score": 72,
        "num_comments": 64,
        "created_utc": 1764046403.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p63nb6/if_you_had_to_restart_your_income_streams_from/",
        "fetched_at": "2025-11-26T08:17:35.186995"
      },
      {
        "id": "1p68wjj",
        "title": "UPS is charging us heavy surcharges every week.",
        "selftext": "Hi - as the title suggests…I work for a small business and we ship a lot of stuff. It recently became my responsibility to reconcile the UPS invoice we get weekly and it has become clear that UPS is essentially scamming us out of hundreds of dollars a week. I wanted to see if others have been having the same experience. \n\nWe are being hit with two surcharges mainly: “dimensional weight adjustments” & “address corrections”. These sometimes amount to more than the original cost of the shipment, are often not valid and easily disputed, and feel very much like UPS attempting to skim money from businesses that are shipping enough to not be able to catch these additional fees. \n\nWhen speaking with our account executive, she mentions that they use an automated (I assume AI) system to image and measure packages. I’ve asked for proof from this system on a few occasions for dimensional adjustments and received nothing, but have had disputes accepted instead. She also has mentioned that the team that handles the surcharges is “third party and overseas”, which makes me think they are receiving a portion of these surcharges, incentivizing them to overcharge and not accept disputes. \n\nAnyway, just want to know if this is a common issue others who use UPS for 30+ shipments a week are experiencing. Thanks! ",
        "subreddit": "smallbusiness",
        "author": "StitchedRebellion",
        "score": 63,
        "num_comments": 71,
        "created_utc": 1764065855.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p68wjj/ups_is_charging_us_heavy_surcharges_every_week/",
        "fetched_at": "2025-11-26T08:17:39.923094"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 52,
        "num_comments": 51,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-11-26T08:17:41.724378"
      }
    ]
  }
}