{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-13T16:11:27.130369"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-13T16:11:20.106037"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-13T16:11:19.769816"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-13T16:11:19.769809"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-13T16:11:19.769798"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-13T16:11:20.106035"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-13T16:11:20.106039"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-13T16:11:20.106040"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-13T16:11:19.769813"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-13T16:11:20.106024"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-13T16:11:19.769815"
      }
    ],
    "reddit": [
      {
        "id": "1nf2lmr",
        "title": "senior quit a high paying job to sell pizza. not kidding.",
        "selftext": "one of my seniors at masters union got a fat offer during mba placements. everyone thought he was set for life.\n\nbut he kept saying, “if i take this, i’ll regret never trying.” so he rejected the job. started a tiny pizza brand instead name woodys pizzeria. at first we thought he was nuts.\n\nnow? his pizzas have a waitlist every weekend and competed with good stores in delhi, IN.\n\ni am always scared on the \"what if it doesn't work\" and idk why job safety appeals more to me. how do you get out of that mindsight?",
        "subreddit": "Entrepreneur",
        "author": "Alternative-Food-372",
        "score": 2200,
        "num_comments": 174,
        "created_utc": 1757682035.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nf2lmr/senior_quit_a_high_paying_job_to_sell_pizza_not/",
        "fetched_at": "2025-09-13T16:11:20.564501"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 448,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-13T16:11:26.128997"
      },
      {
        "id": "1newbyr",
        "title": "I received a call from someone named Paul, claiming to be a Google Business Profile manager. He asked me to pay $499 for renewal of my listing and threatened to close it if I didn’t pay. This is a scam. The call came from +1 650-772-5957, and after researching, I found his details linked to the webs",
        "selftext": "I received a call from someone named Paul, claiming to be a Google Business Profile manager. He asked me to pay $499 for renewal of my listing and threatened to close it if I didn’t pay. This is a scam. The call came from +1 650-772-5957, and after researching, I found his details linked to the website [https://onechancetogrow.com/](https://onechancetogrow.com/). Please beware of such scammers.",
        "subreddit": "smallbusiness",
        "author": "Good-Weakness564",
        "score": 407,
        "num_comments": 37,
        "created_utc": 1757660320.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1newbyr/i_received_a_call_from_someone_named_paul/",
        "fetched_at": "2025-09-13T16:11:24.896977"
      },
      {
        "id": "1nfds5x",
        "title": "I stopped chasing the next big thing and finally made money",
        "selftext": "I used to spend months dreaming up “the big idea.”  \nApps, marketplaces, wild startup concepts, none of them went anywhere.\n\nOne day, I said screw it and offered a simple app to quit porn addiction named Unlust\n\nI’ve made more in the last 3 months doing that than I did in 2 years chasing unicorns.  \nIf you're stuck, maybe it’s not that your idea isn’t good; it’s just not needed.\n\nSolve something boring. People will pay you.",
        "subreddit": "smallbusiness",
        "author": "Kind_Guide_1232",
        "score": 246,
        "num_comments": 39,
        "created_utc": 1757708568.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nfds5x/i_stopped_chasing_the_next_big_thing_and_finally/",
        "fetched_at": "2025-09-13T16:11:24.896941"
      },
      {
        "id": "1nf4hng",
        "title": "What makes night clubs so unprofitable in today's world?",
        "selftext": "I have a good sum of money saved and am considering using it towards opening a night club business. I asked on here about the logistics of doing so a while back, though I initially highlighted that it would be an EDM centered club, but was informed that the business model is simply unprofitable pretty much universally nowadays. What makes it a bad business model in the modern world? Is it the heavy time commitments that come with maintaining the club and finding artists/DJ's to perform live?",
        "subreddit": "smallbusiness",
        "author": "Main-Magazine-4113",
        "score": 151,
        "num_comments": 241,
        "created_utc": 1757686703.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nf4hng/what_makes_night_clubs_so_unprofitable_in_todays/",
        "fetched_at": "2025-09-13T16:11:24.896966"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 147,
        "num_comments": 174,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-13T16:11:26.129044"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 111,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-13T16:11:26.129047"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 97,
        "num_comments": 58,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-13T16:11:26.129031"
      },
      {
        "id": "1nf8fwl",
        "title": "What businesses are people creating in 2025 solo?",
        "selftext": "I'm eager to dive into entrepreneurship this year and create a business from scratch. \n\nWhat are some trending solo ideas that others are pursuing? If you've started something solo, \n\nwhat niche did you pick and why? \n\nLet's build a live list of what works, what fails, and what surprises in today's market.",
        "subreddit": "Entrepreneur",
        "author": "SurajDevX",
        "score": 78,
        "num_comments": 109,
        "created_utc": 1757695985.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nf8fwl/what_businesses_are_people_creating_in_2025_solo/",
        "fetched_at": "2025-09-13T16:11:20.564538"
      },
      {
        "id": "1nfdj77",
        "title": "How to get sales when trying startup for the first time",
        "selftext": "Disclaimer - Post only for those with 0 MRR, No startup, wanna be founder/solopreneur/Indie hacker etc \n\nDisclaimer continued - \n\nBefore coming to main thing, why you should trust me?\n\nI am not going to share any links, screenshots, stripe dashboards but I will say you must have did 100 things till today, why not trust me for few seconds and try 101th too. \n\nIf this doesnt makes sense or don't work out, come after trying abuse me. I will accept that gracefully.   \n  \n**How to get sales when trying startup for the first time ?**\n\n**Step 1.** Define who you are, your strengths, your network, like write down everything about you. \n\nConfused? I will go with example - \n\nYesterday I launched my playbook for wanna be founders, but why? I got this idea because - \n\n\\- I myself founded startup and made it good recurring income  \n\\- I got 5K followers on Linkedin - students of my college, my ex team mates, people in indie hacking etc  \n\\- I got 600+ followers on X - same ICP  \n\\- I spend my time making friends on discord, reddit, X and linkedin who are interested in startups and have no money and idea but lot of ambition.\n\nSo if you see that my daily life told me WHOM i connect with, WHO are my connections, WHAT life i myself have lived. So ask yourself about experiences, connections, strengths etc and thats how you will your NICHE, SECTOR, ICP, etc etc \n\nStay with me. \n\n**Step 2.** Now after knowing your accessibilities, we need IDEA, like what to build, what to sell - \n\nDo not start creating new category, do not start becoming Elon Musk on day 1. \n\nMost easiest and fastest way is to see VALIDATED & SUCCESSFUL ideas doing decent or good in your niche and which aligns with your things you figured out in step 1. \n\nAgain confused? My example - \n\nI saw all indie hackers launching playbooks after first successful $10K MRR product, I did same. I made my own. \n\nI saw about how they sell, how they price, I saw playbooks sell via word of mouth more than marketing, I saw how to share your tricks and learnings everything. So its a validated thing.\n\nBetter example - My first indie tool was a service, not even product back then - just a directory submission service \\[ copied from listingbott of john rush \\] \n\nI saw his idea.  \n\\- people were using it  \n\\- John was bragging \n\nNow I found some pseudo users - WHO WANT TO BUY ABC TOOL BUT THEY HAVE SOME ISSUES - just solve these issues and these are your early 10 customers.\n\nListingbott had issues like - High price, no customer support, no clarity, bad reports etc. I CLEARED THEM ALL and texted 4 bad review people and told them I will do it at 1/5th price. \n\nI got my first customer. \n\n**Step 3.** Market before you build \n\n\\[ It's not valid for all cases but general thing \\] \n\nI did my first sale without even domain name, second sale and third sale too without anything. YES my X account helped maybe you can;t do it but that's why I told you in step 1, find your strengths so that next moves and uncertainities align with your power punches. \n\nI built landing page using lovable, and added paypal \\[ dodo payments wasnt launched back then \\] and started making list of all my competitors, their bad reviewers and also people calling them out. Took 3 days, reached to all of them, shared why I made it, and told them I can solve their issues at less price and better service.\n\nI got lucky \\[ see 70% luck is there, honestly. BUT if luck wasn;t there I would still have made it as I keep trying \\]  \n\nGot my first 10 customers, and 3 public posted reviews. \n\nThat's the beginning.\n\n**Step 4.** Time to build product \n\nObviously won't share details of getmorebacklinks as that trade secret but we took around 40 days to build it. \n\nAfter your first 10 customers, you should continue marketing, share updates, post daily and start building your final product. \n\n\\- Always take reviews from people on X and reddit, there are hundreds of people their like me dropping suggestions here and there, but I mean it - those reviews are valuable, those helped me and will help you too. \n\n**Step 5.** Launch, foundation and road to first 100 paying customers\n\nNow   \n\\- you have maybe 10-20 customers who paid.  \n\\- a ready product   \n\n\n\\- Start posting in communities where your potential customers are found online.  \n\\- Start posting on X, reddit, linkedin, engage on discord, facebook groups etc  \n\\- Launch your product on producthunt, thousands of directories, Hacker News etc  \n\\- Build in public - share success, failures, updates, features, do collabs and compete too\n\nStart foundational work which will help you after 100 days - SEO   \n\\- Build backlinks  \n\\- Upload blogs  \n\\- Make free tools relevant to your ICP  \n\\- Make pSEO pages  \n\\- Boost your DR   \n\\- Launch on multiple platforms etc \n\nAlways keep listening to your customers, add updates, add features and keep sharing & marketing. \n\nFind WHY?  \nWhy are people buying  \nwhy are people not buying  \nwhy are people buying yours, not others  \nwhy are people buying your competitors tools, not yours  \nwhy can't people find you  \nhow did they find you  \netc\n\nFind answer to every why and keep making those better.\n\nLike when I launched my playbook yesterday, I did 9 pages extra update because of so many inputs from a single reddit post. That's how you listen, research and act fast. \n\n**Step 6.** KEEP DOING IT FOR 1000 times\n\nJust keep doing above things until you get 100 customers, in all cases if you daily find \"WHY?\" you will end up with 100 customers, maybe your product will be changed 100% but still your purpose was 100 customers. \n\n**Step 7.** Road to 1000 customers \n\n\\- Time to build your customer groups  \n\\- Start seasonal offers  \n\\- Make yearly plans for more runway  \n\\- Boost your SEO efforts  \n\\- Triple down on your sales channels, double down on your potential sales channels  \n\n\nWhen I saw X is giving me highest revenue per visitor for getmorebacklinks, I started engaging more, gave offers to post reviews, I made friends, took part in online campaigns. That's how you double down your primary sales channel. At same time I saw reddit and Linkedin - I never stopped marketing there. I kept on doing it. \n\nFrom yearly sales, start investing in A/B testing of Ads, yearly sales give runway of upto 10 months and this money should be used to scale. \n\nand that's how I did $10K, that's the easy, fast and tested way to do it. \n\nI hope all of this helped you. Keep me updated if it helped you, if you want to challenge me on any part, please do it, we will have healthy discussion. \n\nSorry for any grammar mistakes, After writing for 20-25 minutes, I saw that it got very long and I did fast check only. ",
        "subreddit": "SaaS",
        "author": "Getmorebacklinks",
        "score": 76,
        "num_comments": 15,
        "created_utc": 1757707993.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nfdj77/how_to_get_sales_when_trying_startup_for_the/",
        "fetched_at": "2025-09-13T16:11:21.966685"
      }
    ]
  }
}