{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-19T00:54:46.604855"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-19T00:54:39.082301"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-19T00:54:38.796143"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-19T00:54:38.796135"
      },
      {
        "videoId": "a3GqDaIw8pA",
        "title": "BOOKKEEPING BASICS: 7 Steps to Get You Started",
        "description": "New! Get my 2nd Edition Accounting Cheat Sheet Bundle → https://accountingstuff.com/shop Are you tired of struggling with ...",
        "channelTitle": "Accounting Stuff",
        "publishedAt": "2023-05-23T08:35:05Z",
        "url": "https://www.youtube.com/watch?v=a3GqDaIw8pA",
        "fetched_at": "2025-09-19T00:54:39.082305"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-19T00:54:38.796123"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-19T00:54:39.082299"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-19T00:54:39.082303"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-19T00:54:38.796139"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-19T00:54:39.082287"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-19T00:54:38.796141"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 455,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-19T00:54:45.603480"
      },
      {
        "id": "1nkal8g",
        "title": "Stopped sharing my projects with my wife after years of failed ideas",
        "selftext": "I’ve been working 12+ hours a day for the past 5 years, trying more than 10 different ideas.\nNone of them became “successful” yet, but I keep pushing because I really believe one day something will click.\n\nUntil recently, I used to share every project idea with my wife and ask for her thoughts.\nBut her reaction lately has been:\n\n“Let us breathe with your projects. We know none of them work.”\n\nIt honestly hurt, and I’ve stopped telling her what I’m working on.\nI still love her and I know she’s just tired of seeing me struggle, but I feel pretty lonely in this journey now.\n\nHas anyone else been through this?\nHow do you deal with a partner who’s lost faith in your projects",
        "subreddit": "Entrepreneur",
        "author": "Silver_Tip260",
        "score": 356,
        "num_comments": 230,
        "created_utc": 1758207528.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nkal8g/stopped_sharing_my_projects_with_my_wife_after/",
        "fetched_at": "2025-09-19T00:54:39.682462"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 157,
        "num_comments": 42,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-09-19T00:54:45.603491"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 149,
        "num_comments": 177,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-19T00:54:45.603528"
      },
      {
        "id": "1njtc4i",
        "title": "A Practical founder toolkit to Get Your First 100 Users for $0",
        "selftext": "Many of us have 2-3 great products, but struggle to promote it. Here’s a simple founder toolkit playbook to help you get your first 100 users without a marketing budget:\n\n**Launch even on Moon**\n\n* Launch on Product hunt\n* Post on Betalist\n* Launch on Peerlist\n* Share in \"Show HN\" on Hacker News\n* Launch on Uneed\n* Share in “Products” on Indie Hackers\n* Showcase on [r/S](https://www.reddit.com/r/SideProject/)aaS \n* Submit to Product Hunt\n* Launch on Microlaunch\n* [Get listed on 200+ directories](http://getmorebacklinks.org) like above ones \n\n**Build in Public on Twitter, Reddit, Linkedin, even on friends whatsapp group**\n\n* Show what you’re building with videos, screenshots and updates.\n* Post product updates, success and failures.\n* Ask for feedback on specific features, ask them to review and roast.\n* Share testimonials and case studies + learnings \n* Celebrate your wins and others wins \n* Follow 25-30 top accounts in your niche and engage with their posts\n\n**Become part of the Game**\n\n* Scan X, Linkedin and Reddit for relevant conversations, dont even leave facebook and discord.\n* Track competitor mentions, search for keywords, and intent words.\n* Track keywords related to the problem you solve, see google trends and searches.\n* Look for mentions of specific features\n* Get alerts for your product’s category\n* Contribute meaningfully, share your product and disclose your affiliation\n\n**Start SEO on day 0**\n\n* Write \\[competitor\\] alternative pages\n* Publish feature pages\n* Get listed on as many startup directories possible \n* Write \\[competitor\\] pricing pages\n* Create templates/examples galleries\n* Turn your FAQs into blog posts\n* Write \\[competitor\\] coupon/discount code pages\n\nAnd if you find this too vague and want something more actionable, well, that’s why I wrote complete [playbook](http://foundertoolkit.org) to go from 0 to $10K MRR. \n\n*Let's Build like MADMAN.. wohoo!*",
        "subreddit": "SaaS",
        "author": "Getmorebacklinks",
        "score": 139,
        "num_comments": 115,
        "created_utc": 1758153435.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1njtc4i/a_practical_founder_toolkit_to_get_your_first_100/",
        "fetched_at": "2025-09-19T00:54:41.301839"
      },
      {
        "id": "1njrbe4",
        "title": "Wearing MAGA apparel to investor meetings? I will not promote",
        "selftext": "I recently went to a startup demo day and a separate startup conference.  Both were in a red state.\n\nBoth aimed to connect startups with investors.  At both, a small number of people wore MAGA apparel, had a “thin blue line” flag and announced how Donald Trump Jr. had invested in their startups.\n\nIs this the norm for startup events outside the Bay Area and Northeast: vocal MAGA support, when meeting investors, is acceptable?",
        "subreddit": "startups",
        "author": "Big_Celery2725",
        "score": 127,
        "num_comments": 115,
        "created_utc": 1758148128.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1njrbe4/wearing_maga_apparel_to_investor_meetings_i_will/",
        "fetched_at": "2025-09-19T00:54:42.826545"
      },
      {
        "id": "1njw4yw",
        "title": "Just found out putting yard signs at the exit of the local high school parking lot works at getting employee leads",
        "selftext": "I hire helpers to do simple things like unskilled painting. I've learned high schoolers are better than \"adults\" for this sort of part-time work.\n\nAnyway, I put two signs saying the wage and how it's after-school and weekend work. Then I left my phone number (that I use for employees). I put these yard signs out about an hour before school let out. (Some seniors can get out early.)\n\nOne lead called/texted me right when school let out and two later in the day. I'm thinking about getting printed signs now... would look less unprofessional. And I could use them anywhere I move to...",
        "subreddit": "Entrepreneur",
        "author": "tooniceofguy99",
        "score": 120,
        "num_comments": 22,
        "created_utc": 1758161334.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1njw4yw/just_found_out_putting_yard_signs_at_the_exit_of/",
        "fetched_at": "2025-09-19T00:54:39.682479"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 113,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-19T00:54:45.603532"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 96,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-19T00:54:45.603513"
      },
      {
        "id": "1njuyvf",
        "title": "Products that shouldn’t sell… but did (looking at you, Labubu)",
        "selftext": "Every year, something random takes over. This time it’s Labubu; a collectible toy that went from niche to must-have, selling out everywhere and reselling for crazy prices online.... with a bit of a controversy of being evil/ a stunt to boost sales perhaps!!\n\nBut it’s not the first time we’ve seen something like this:\n\nFidget spinners suddenly in every schoolyard (i had one)\n\nStanley cups becoming a full-on status symbol (i have one)\n\nCrocs going from “ugly shoe” to fashion trend\n\nEven the Snuggie blanket with sleeves had its moment (thought of getting one)\n\n\nIt makes me wonder what’s next? And more importantly… why do these things catch fire in the first place?",
        "subreddit": "smallbusiness",
        "author": "Available-Shame8656",
        "score": 89,
        "num_comments": 49,
        "created_utc": 1758158028.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1njuyvf/products_that_shouldnt_sell_but_did_looking_at/",
        "fetched_at": "2025-09-19T00:54:44.220370"
      }
    ]
  }
}