{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-09T00:54:11.924467"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-09T00:54:02.887298"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-09T00:54:02.887300"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-09T00:54:02.532076"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-09T00:54:02.532081"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-09T00:54:02.532062"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-09T00:54:02.887294"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-09T00:54:02.887297"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-09T00:54:02.532078"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-09T00:54:02.887283"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-09T00:54:02.532080"
      }
    ],
    "reddit": [
      {
        "id": "1o0gkwp",
        "title": "Started a business to escape corporate BS, ended up creating different BS",
        "selftext": "left my corporate marketing job 18 months ago to start my own digital marketing consultancy. was so done with pointless meetings, office politics, having to ask permission to do basic shit. thought being my own boss would solve everything. and in some ways it has. no more commuting, no more pretending to look busy, no more corporate buzzword bingo.\n\nbut i've somehow created a whole new set of problems. now instead of one demanding boss i have 6 demanding clients. instead of office politics i have to deal with late payments and scope creep. instead of pointless meetings i have endless sales calls with people who want champagne results on a beer budget. plus the feast-or-famine cycle is fucking brutal. one month you're turning away work, the next month you're panicking about making rent.\n\ni don't want to go back to corporate. but entrepreneurship isn't the magical freedom solution everyone makes it out to be. it's just a different kind of stress. anyone else feel like they traded one set of problems for another? how do you make the business side sustainable without losing the reasons you started it in the first place?",
        "subreddit": "Entrepreneur",
        "author": "Organic_Yard9225",
        "score": 496,
        "num_comments": 163,
        "created_utc": 1759847874.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o0gkwp/started_a_business_to_escape_corporate_bs_ended/",
        "fetched_at": "2025-10-09T00:54:03.720965"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 460,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-09T00:54:10.923110"
      },
      {
        "id": "1o0fn5z",
        "title": "Would you fire a 3-year manager for stealing $10 in cleaning products?",
        "selftext": "We dont sell cleaning products. We just have them to clean equipment. This person has been with our small company for 3 years and they have really helped me build the business. However they cant make it a full week without calling in or being 20 minutes or more late. The attendance has been an ongoing issue. \n\nSomeone reported to me that the manager was playing a mobile game when I wasn't in the office. I checked the CCTV and sure enough, they did play a game for about 40 minutes on the clock. But when searching for the clip, I also saw them hide $10 worth of magic erasers in their purse!\n\nI think its time I pull the trigger and fire them? Its so hard when we have built so much.",
        "subreddit": "smallbusiness",
        "author": "Try_Harder7",
        "score": 413,
        "num_comments": 398,
        "created_utc": 1759845770.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o0fn5z/would_you_fire_a_3year_manager_for_stealing_10_in/",
        "fetched_at": "2025-10-09T00:54:09.057741"
      },
      {
        "id": "1o0qooh",
        "title": "You don't need a non technical founder",
        "selftext": "Sorry to bring up this eternal debate again, but I’m a technical founder with, I guess, decent communication skills, and I’ve been doing sales myself lately.  \nI just don’t understand, especially in the era of AI, why you would need a non technical founder.  \nI mean, no matter how AI evolves, you still need a deep understanding of the technical side of things. At scale, sure, you might need a sales machine but in the early days, it only slows you down.  \nAll the real intelligence comes strictly from understanding these things.  \nAnd when I say “technical,” I’m not talking about the vibecoder kind of technical.\n\n**EDIT: CANVAS INC FOR GTM & CLUELY FOR SALES CALLS**",
        "subreddit": "SaaS",
        "author": "maggieoutlaw",
        "score": 184,
        "num_comments": 77,
        "created_utc": 1759869848.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o0qooh/you_dont_need_a_non_technical_founder/",
        "fetched_at": "2025-10-09T00:54:05.533586"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 176,
        "num_comments": 46,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-09T00:54:10.923142"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 162,
        "num_comments": 52,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-09T00:54:10.923130"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 154,
        "num_comments": 180,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-09T00:54:10.923172"
      },
      {
        "id": "1o0cata",
        "title": "Co-founders don't get basic startup principles. I will not promote.",
        "selftext": "Early stage, close to first investment. I have startup experience and knowledge but other two do not. They are well-versed and great value in our business, but have the bulk of their career experience in public sector and contracting. I have to expend enormous energy in explaining and then convincing them of the value and importance of some basic principles.\n\nExamples:\n\n\\- One hour conversation about what vesting is and why we need it with their conclusion that it doesn't feel right to them and will get back after their own research.\n\n\\- No understanding of pre-money valuations hence their conclusion my (sector average) valuation is a damaging fantasy.\n\n\\- My growth targets feel too ruthless to them and that attempting this plan will sink our ship. I counter that this is what our investors will expect at a minimum.\n\nWe are in the EU so they feel I am using US-based examples which are not relevant here.\n\nAdvice?\n\n",
        "subreddit": "startups",
        "author": "kinletworkshop",
        "score": 104,
        "num_comments": 83,
        "created_utc": 1759837077.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1o0cata/cofounders_dont_get_basic_startup_principles_i/",
        "fetched_at": "2025-10-09T00:54:07.254889"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 99,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-10-09T00:54:10.923157"
      },
      {
        "id": "1o15199",
        "title": "What is your AI stack an entrepreneur in 2025?",
        "selftext": "Saw this in a different sub but more sense here! It feels like running a business in 2025 basically means managing a small team of AI tools. I’m curious- what’s in your current AI stack?\n\n  \nWhich tools are actually helping you run your business day-to-day (content, ops, sales, marketing, etc.), and which ones turned out to be just hype?",
        "subreddit": "Entrepreneur",
        "author": "Aurora_Evana",
        "score": 94,
        "num_comments": 78,
        "created_utc": 1759912695.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o15199/what_is_your_ai_stack_an_entrepreneur_in_2025/",
        "fetched_at": "2025-10-09T00:54:03.720941"
      }
    ]
  }
}