{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-02T16:17:39.104966"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-02T16:17:30.478930"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-02T16:17:30.192793"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-02T16:17:30.192796"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2025-12-02T16:17:30.478928"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-02T16:17:30.192751"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-02T16:17:30.478924"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-02T16:17:30.478926"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-12-02T16:17:30.192802"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-02T16:17:30.478911"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-02T16:17:30.192798"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 487,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-02T16:17:38.103482"
      },
      {
        "id": "1pbqs27",
        "title": "Advice from a 9-figure entrepreneur",
        "selftext": "I started my first business in 2010, and have gone from having about a thousand bucks in my bank account to a paper net worth in the low nine figures (though this will come down to high eight figures after taxes). Here's my advice FWIW:\n\n**1. Learn technical skills.** Unless you're an artist or a restauranteur or something like that, odds are that the majority of your work is going to be done on a computer. As such, you should master keyboard shortcuts, use multiple monitors, set up your workspace in an efficient way, learn basic coding skills (Javascript, HTML, and SQL are all you really need), know how to model things out in spreadsheets, etc. These skills have been instrumental to me in everything I've done as an entrepreneur, and without them there is absolutely no way I would have succeeded. One of my earliest memories of my first business was a friend asking me how I was making money (he was trying something similar and failing); I could see that a lot of the reason he was failing is that he couldn't handle any of the technical aspects of what he was doing himself (eg building a website), and so was paying for someone else do do a third-rate job of it. I said \"learn how to code\" and he responded with \"but that's too hard.\" Yes, learning new things is hard, and he also should have learned how to code. Which brings me to...\n\n**2. Suck it up and do the hard things.** The vast majority of people give up when they hit their first wall. Another huge chunk drop off after the second, third, or fourth. The people who succeed are the ones who suck it up and power through the shitty parts of entrepreneurship (and it's mostly shitty at the start). I learned this during the first year of my third business, and I'm learning it again now as I'm trying to get my philanthropic efforts off the ground: there is just so much stuff when you're starting out that's a pain in the ass, and there's no one to do it but you. If you can muster the mental fortitude to just make yourself do those things, you will separate yourself from 99% of the competition and massively increase your odds of success. As just one example: can you even *imagine* how difficult it must have been to sell books on the internet in 1993? Jeff Bezos must have literally run into thousands of pain-in-the-ass things, any one of which would have deterred a normal person, but he kept at it and now he's Jeff Bezos.\n\n**3. That which gets measured gets improved.** I have kept a side scrolling daily spreadsheet of my company's P&L every single day going back to 2010. If I determine that something is critical to my company's success, I carefully measure it over time, and take note of any initiative that moves the numbers in a positive or negative direction. Even if you're just starting out and there's not much to measure, measure it. Make it a habit. While it's possible to drown yourself in data overload, I think it's much more common for people to be deficient in their data gathering and analysis than to take it too far.\n\n**4. Practice good manners.** It's crazy to have to write this one out, but I can't tell you how many people I come across that don't do this. If someone emails you, respond quickly. If they help you, say thank you (in fact, I recommend signing off on all your emails with \"Thanks, \\[First Name\\]\"). If they ask for a favor that's easy for you to deliver, do the favor. Follow up with people after a good conversation. Remember to always speak to what the *other person* wants, not just what you want. (That's another head-scratcher: the number of people who will say \"Hey Chris, it would really help me if you do X and Y\" without even considering what I want or whether it's in my interest to do what they're asking.)\n\n**5. Be obsessed with your business.** I recently stepped away from my company and handed the reins over to the management team. One of the major differences I've noticed in how they do things vs how I did things is that I was *obsessed* with the business, and they're not (somewhat understandably, obviously, as they don't have my equity stake in it). When you're obsessed with your business, things don't catch you by surprise because you were already worried about them way before they happened. When you're obsessed with your business, you always have a dozen ideas ready to go whenever resources free up. When you're obsessed with your business, you become the ultimate expert at the company across a variety of topics, and can be an invaluable resource to employees / teammates. Get obsessed.",
        "subreddit": "Entrepreneur",
        "author": "chris-abovewealth",
        "score": 430,
        "num_comments": 128,
        "created_utc": 1764627628.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pbqs27/advice_from_a_9figure_entrepreneur/",
        "fetched_at": "2025-12-02T16:17:31.220775"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 427,
        "num_comments": 122,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-02T16:17:38.103499"
      },
      {
        "id": "1pbiiil",
        "title": "i swear entrepreneurship is just waking up every day and choosing delusion",
        "selftext": "idk who needs to hear this but i’m convinced like 80% of entrepreneurs are just running on pure delusion and caffeine.\n\nlike today i woke up fully convinced i’m gonna scale my business, dominate new markets, maybe even retire early  \nand then by noon i’m sitting on my floor eating cereal straight from the box wondering why nobody replies to my outreach 😭\n\nwhy does this stuff feel so simple in your head but turn into a whole greek tragedy when you try to do it in real life\n\nis this normal or am i just built wrong lol  \nwhat keeps u going when your brain is like pls stop but your soul is like nah we up next?\n\n",
        "subreddit": "Entrepreneur",
        "author": "Fulcilives1988",
        "score": 406,
        "num_comments": 100,
        "created_utc": 1764609213.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pbiiil/i_swear_entrepreneurship_is_just_waking_up_every/",
        "fetched_at": "2025-12-02T16:17:31.220782"
      },
      {
        "id": "1pbiht1",
        "title": "Discovered my biggest customer has been sharing their login with 14 people at their company. Do I say something?",
        "selftext": "My product has per-seat pricing. $29/user/month.\nMy biggest customer pays for 3 seats. $87/month. They've been with me for 11 months. Great relationship. Use the product heavily.\nYesterday I was checking usage analytics and noticed something weird. Their account had usage from 14 distinct IP addresses in the last month. Different cities. Usage patterns that don't make sense for 3 people.\nThey're sharing one login across their whole team.\nBy my pricing, they should be paying for 14 seats. $406/month. They're paying $87.\nThat's $319/month I'm losing. $3,828/year from a single customer.\nBut here's my dilemma:\nThey're my biggest customer by usage. They genuinely love the product. They've referred 2 other companies to me.\nIf I enforce the seat policy, they might churn entirely. I'd lose $87/month plus their goodwill plus future referrals.\nIf I don't enforce it, I'm subsidizing a customer who's technically violating terms. And if other customers find out, why would they pay full price?\nOptions I'm considering:\nSay nothing and hope they eventually upgrade voluntarily. (Unlikely but avoids conflict.)\nReach out diplomatically. \"Hey noticed some unusual login patterns, want to make sure security is good. Also here's a team plan that might fit better.\" Give them a path to compliance.\nEnforce strictly. \"Our records show X users, please upgrade or we'll need to restrict to licensed seats.\" Might lose them entirely.\nGrandfather them at current rate but lock it in. \"Your price stays the same but we're implementing device verification going forward.\"\nI genuinely don't know the right move here. The money matters but the relationship also matters.\nHow would you handle this?\n\n",
        "subreddit": "SaaS",
        "author": "Cold_Hall_5384",
        "score": 298,
        "num_comments": 202,
        "created_utc": 1764609168.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pbiht1/discovered_my_biggest_customer_has_been_sharing/",
        "fetched_at": "2025-12-02T16:17:32.963407"
      },
      {
        "id": "1pc5ix4",
        "title": "My friend got an ada demand letter and showed me the actual settlement agreement they wanted him to sign, this is insane!",
        "selftext": "My buddy runs a small shopify store, he got hit with an accessibility demand letter last month from some law firm. The initial demand was for $20k settlement plus legal fees, they sent over the actual settlement agreement template and the terms are wild beyond just the money.\nAgreement requires: bringing site into \"substantial compliance\" with wcag 2.2 level aa within the term of agreement, 24 month monitoring period where they can come back and check, if you breach any terms they can reopen the case, strict confidentiality clause so you can't even tell other business owners about the amount or terms.\nThe kicker is buried in section 4 about remediation, you have to make \"good faith efforts\" but there's no clear standard for what that means. So even after paying $20k+ and doing work, they could potentially argue you didn't try hard enough.\nI talked to a lawyer who said these agreements are designed to be vague so they can keep coming back, the confidentiality clause means most business owners can't even compare notes or warn each other.\nAnyone else seen agreements like this? Trying to figure out if these terms are standard or if this firm is extra aggressive.",
        "subreddit": "smallbusiness",
        "author": "Wtf_Sai_Official",
        "score": 255,
        "num_comments": 100,
        "created_utc": 1764672930.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pc5ix4/my_friend_got_an_ada_demand_letter_and_showed_me/",
        "fetched_at": "2025-12-02T16:17:36.210259"
      },
      {
        "id": "1pbgxum",
        "title": "Just curious: how do small businesses like coffee shops stay open in big cities like NYC?",
        "selftext": "I was recently in NYC and stopped into one of the many small coffee shops in Manhattan, pretty close to Chinatown. A tiny storefront, just two tables inside plus some display shelves, a small case for baked goods, an ordering/serving counter. It might have been 150 square feet or so inside the customer area plus some room out back for making drinks. Coffee was $4 or so, a latte was $5, a croissant was $4 or $5, banana bread was $3. Hours are 8 AM to 7 PM, seven days a week.\n\nAnyway, it got me wondering how businesses like this stay open. With all of the competition plus the low per-customer revenue, how does a little place like this stay afloat in a big city? I assume the rent must be thousands per month. Do they need to own the space? Am I just not thinking through the math and not realizing that multiple small purchases a day add up? Are they running on a loan they'll never re-pay?\n\nI think about this a lot with random stores in cities. Like a little boutique-type store that sells funky little gifts, candles, greeting cards, etc. How does a place like that stay open in a presumably-desirable storefront area in a big city? Are there really enough people stopping in to support it?\n\nI guess the answer is obviously \"yes\" since they are open, but it doesn't make sense to me...",
        "subreddit": "smallbusiness",
        "author": "ajt331840",
        "score": 135,
        "num_comments": 64,
        "created_utc": 1764605727.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pbgxum/just_curious_how_do_small_businesses_like_coffee/",
        "fetched_at": "2025-12-02T16:17:36.210267"
      },
      {
        "id": "1pbo8x1",
        "title": "Hired my first employee at $11K MRR. Biggest mistake I made.",
        "selftext": "Hit $11K MRR and felt like I was drowning. Hired a \"growth marketer\" at $65K salary plus benefits. Total cost: \\~$78K/year.\n\nThat's $6,500/month. More than half my MRR.\n\nWithin 3 months:\n\nBurned through $19,500 in salary\n\nThey generated about $800 in new MRR\n\nI spent 8-10 hours per week managing them instead of doing the work myself\n\nQuality of their output required so much editing it would've been faster to do it myself\n\nLet them go with 4 weeks severance. Felt terrible about it.\n\nWhat I learned:\n\nYour first hire should save you time on things you already know how to do, not discover new things.\n\nAt $11K MRR, you can't afford specialists. You need a generalist who can do 10 things at 70% quality.\n\nHire for constraint relief. I should've hired someone to handle support and ops, not growth.\n\nThe \"hire before you're ready\" advice assumes you have funding. Bootstrapped founders need to hire way later.\n\nNow at $23K MRR. Still no employees. Using contractors for specific projects instead.\n\nWhen did you make your first hire?\n\n",
        "subreddit": "SaaS",
        "author": "Crazy-Recording4800",
        "score": 127,
        "num_comments": 32,
        "created_utc": 1764621805.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pbo8x1/hired_my_first_employee_at_11k_mrr_biggest/",
        "fetched_at": "2025-12-02T16:17:32.963409"
      },
      {
        "id": "1pbns8h",
        "title": "Business Owners, are you hosting an employee holiday party this year?",
        "selftext": "In the past few years, it seems company holiday parties have become less popular. What is your experience?\n\nLong ago, I remember attending very nice employee holiday parties, with spouses/partners invited, great food, an open bar, or maybe two \"drink tickets,\" and people would dress up, etc. Is that over?\n\nI don't host an employee holiday party. The costs have gotten relatively expensive, and I don't know if employees want this or expect it anymore. That could be a change since Covid, not sure.\n\nI think many employees focus on \"cash compensation,\" so I have offered more fringe benefits, including an educational assistance plan (capped at $5250 per year, per employee), profit-sharing for retirement fund matching, fair wages, bonuses, service awards, de minimis fringe benefits, etc.\n\n**EDIT:** Thanks for sharing all of the perspectives and experiences. This was enlightening.",
        "subreddit": "smallbusiness",
        "author": "BlizzardBlind",
        "score": 95,
        "num_comments": 103,
        "created_utc": 1764620746.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pbns8h/business_owners_are_you_hosting_an_employee/",
        "fetched_at": "2025-12-02T16:17:36.210264"
      },
      {
        "id": "1pbiqk2",
        "title": "Trying to expand my business from abroad into the States. Any pointers?",
        "selftext": "Hey people,  \n  \nI run a business outside the States and I’m looking at getting things going in the States. I’ve done a bunch of ressearch, but most of what I find is super official and not very practical. I’m not really sure what the first move should be. I also don’t know how people usually handle stuff like banking or proof of funds when they’re overseas, or what actually makes you look legit when reaching out to brokers or potential partners.  \n  \nI’m not trying to raise money just trying not to look clueless when I start talking to people. If anyone here has made the jump into the U.S. market from abroad, or has dealt with folks doing it, I’d really appreciate any insight into what matters early on. Any tips help, thanks in advance.",
        "subreddit": "smallbusiness",
        "author": "Traditional_Pop_9039",
        "score": 89,
        "num_comments": 17,
        "created_utc": 1764609708.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pbiqk2/trying_to_expand_my_business_from_abroad_into_the/",
        "fetched_at": "2025-12-02T16:17:36.210277"
      }
    ]
  }
}