{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-24T01:01:39.412441"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-24T01:01:29.971302"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-11-24T01:01:29.971306"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-24T01:01:29.670270"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-24T01:01:29.670273"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-24T01:01:29.670257"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-24T01:01:29.971300"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-24T01:01:29.971304"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-24T01:01:29.670278"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-24T01:01:29.971290"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-24T01:01:29.670275"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 487,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-24T01:01:38.411066"
      },
      {
        "id": "1p3wziz",
        "title": "We've been paying a contractor 1.5k for 10 months after he stopped working for us",
        "selftext": "I was reconciling our books this weekend (because our finance person quit) and I noticed we’ve been sending monthly payments to a freelance designer who hasn’t delivered anything since January\n\nI messaged him asking if we hired him for something recently and we've forgotten because you've been receiving monthly payments and he said no because (based on his words) I finished that logo project in January. He assumed that we just wanted to keep him on retainer so he didn’t say anything  \nFirst of all retainer is CRAZY. He just kept getting paid because nobody turned off the recurring payment when the project ended!!!!  \nI checked with the team and everyone thought someone else was still using him for stuff. We’re 24 people like how does something like this even happen?\n\nApparently he’s been receiving 1.5k every month for 10 months and figured we knew what we were doing which honestly fair cuz that’s on us not him  \nThe worst part is he’s a nice guy and offered to pay some of it back but like legally that’s our fuckup not his. We just gave him $15k for nothing because nobody communicated...........\n\nHow do you deal with this if you don't have a proper financial team set up?",
        "subreddit": "smallbusiness",
        "author": "SadAlternative2422",
        "score": 431,
        "num_comments": 158,
        "created_utc": 1763827851.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p3wziz/weve_been_paying_a_contractor_15k_for_10_months/",
        "fetched_at": "2025-11-24T01:01:36.395936"
      },
      {
        "id": "1p4hy4s",
        "title": "Does anyone else feel like 'Mystery Boxes' are the only way to clear dead stock without looking desperate?",
        "selftext": "I'm sitting on about $15k of inventory from last season. I can't run a 70% off sale on the site because I'm terrified it will ruin our 'premium' image and piss off customers who paid full price. I've looked at liquidation sites but they all seem sketchy or require massive volume. Has anyone found a way to sell bulk inventory to exporters or off-price buyers without it ending up on eBay with your brand name all over it? Is 'burning it' actually a thing people do?",
        "subreddit": "smallbusiness",
        "author": "Late-Succotash-2816",
        "score": 295,
        "num_comments": 88,
        "created_utc": 1763887891.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p4hy4s/does_anyone_else_feel_like_mystery_boxes_are_the/",
        "fetched_at": "2025-11-24T01:01:36.395913"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 184,
        "num_comments": 134,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-24T01:01:38.411124"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 181,
        "num_comments": 35,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-24T01:01:38.411111"
      },
      {
        "id": "1p33oj5",
        "title": "Why can’t a company like Quora do better than new startups in the same space? Would you build “a new Quora” today? I will not promote",
        "selftext": "I remember using Quora a lot between 2014 and 2019 – it felt like *the* place for detailed, thoughtful answers. Now I barely see it referenced anywhere. Instead, there are lots of new Q&A / discussion-based startups appearing, and even older platforms like Reddit feel far more active, relevant, and alive.\n\nIt makes me wonder: what really happened to Quora as a product and company? Did the experience slowly get worse (bots, low-quality answers, clickbait, aggressive ads), or did user behavior simply shift toward faster, community-driven platforms and AI tools?\n\nFrom a startup point of view, I’m fascinated by how a small team can compete with – and sometimes beat – a big, established player. With fewer resources but more focus, a startup can ship faster, keep the UX clean, moderate better, and stay closer to what users want *right now*, not what worked 10 years ago.\n\nFor founders and PMs here:\n\n* If you were building in the “Quora space” today, what would you do differently?\n* What do you think Quora got wrong (or stopped doing right)?\n* Are Q&A platforms still a good problem space in 2025, or is that window mostly closed?\n\n(For clarity: I’m not promoting anything, just trying to understand the dynamics and learn from Quora’s trajectory.)",
        "subreddit": "startups",
        "author": "Shubham0420",
        "score": 79,
        "num_comments": 35,
        "created_utc": 1763743746.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p33oj5/why_cant_a_company_like_quora_do_better_than_new/",
        "fetched_at": "2025-11-24T01:01:34.622901"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 65,
        "num_comments": 42,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-24T01:01:38.411087"
      },
      {
        "id": "1p4kwj7",
        "title": "I raised $100K off a single deck as a solo founder",
        "selftext": "I’m a solo founder and somehow ended up getting a $100K commitment from a VC off one deck and a short meeting.  \nNo MVP, no traction, nothing fancy. Just a deck and… me. Honestly still a little surprised.\n\nFor context, I’ve been running a video/animation studio for about a decade.  \nSomething like 5,000 projects over the years.  \nSo most of my life has basically been explaining complex stuff with visuals and dealing with every type of client you can imagine.\n\nNow I’m working on a prompt-to-video tool that spits out full explainer videos from a single prompt.  \nIt feels like the natural evolution of the work I’ve been doing forever.\n\nThe interesting part is what I think actually made the VC take me seriously this early:\n\n**• I know the problem way too well.**  \nClients think they know what video they need, but after thousands of projects you start predicting their real pain points before they even mention them.  \nI think the VC saw that I wasn’t guessing - I’ve been solving the same problems manually for a decade.\n\n**• I understand the market because I lived in it.**  \nWhen you’ve quoted, negotiated, and delivered thousands of videos, you end up with a pretty realistic sense of who buys, when they buy, and where the money actually comes from.  \nVCs don’t need you to “research the market” when you’ve already been operating inside it for 10 years.\n\n**• I have direct access to customers.**  \nI don’t need to run ads or cold outreach to find people to validate ideas. I can DM a few founders or marketers and get unfiltered feedback in minutes.  \nInvestors love when you already have a built-in feedback loop because it means faster iteration and fewer wrong turns.\n\n**• I know the competition from the inside.**  \nNot from reading comparison charts… from literally competing with them for years.  \nThat gives you a much better sense of where the real gaps are versus what competitors say they offer.\n\n**• I’m actually a builder.**  \nI’ve been coding since I was a kid and running a studio forced me to develop operational discipline.  \nSo instead of “great idea but can you execute?” the meeting became “ok, he’ll actually build this stuff.”\n\nBasically, none of this felt forced.  \nThis is the kind of product I’d be building even if no one funded it, and I think the VC could feel that.  \nIt wasn’t a random idea I picked off a list - it was just the next logical step in a career I already lived, and I think that was the key.\n\nDon't try to force an idea. Focus on finding problems you already know inside and out, and VCs will appreciate that.\n\nCurious if anyone else here also raised early based mostly on a deck?",
        "subreddit": "SaaS",
        "author": "GuyMakesVideos",
        "score": 62,
        "num_comments": 36,
        "created_utc": 1763898814.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p4kwj7/i_raised_100k_off_a_single_deck_as_a_solo_founder/",
        "fetched_at": "2025-11-24T01:01:32.690907"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 49,
        "num_comments": 50,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-11-24T01:01:38.411091"
      },
      {
        "id": "1oz49vv",
        "title": "Promote your business, week of November 17, 2025",
        "selftext": "Post business promotion messages here including special offers especially if you cater to small business.  \n\n**Be considerate. Make your message concise.**    \n\n**Note:** To prevent your messages from being flagged by the autofilter, don't use shortened URLs.",
        "subreddit": "smallbusiness",
        "author": "Charice",
        "score": 47,
        "num_comments": 211,
        "created_utc": 1763345766.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oz49vv/promote_your_business_week_of_november_17_2025/",
        "fetched_at": "2025-11-24T01:01:36.395908"
      }
    ]
  }
}