{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-21T00:56:30.174500"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-21T00:56:21.689015"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-21T00:56:21.689017"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-10-21T00:56:21.227827"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-21T00:56:21.227822"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-21T00:56:21.227808"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-21T00:56:21.689011"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-21T00:56:21.689013"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-21T00:56:21.227824"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-21T00:56:21.689000"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-21T00:56:21.227826"
      }
    ],
    "reddit": [
      {
        "id": "1ob44d8",
        "title": "Sold my business",
        "selftext": "I recently sold my business after starting and owning it for 10 years. Walked away with 3m after tax personally and then 1.3m after tax in my holding company.  A lot with a VTB of 500k that is to be paid to me in 3 years. \n\nIt’s only been a couple months and I’m already kinda bored. My wife and I both worked in the business so we are both jobless now. We own our house and vehicles and no debt. Two young children. There’s nothing else we really need or want besides travelling a few times a year. \n\nWhat do we do next? I’m feeling kinda lost. I can’t really think of a passion I want to pursue. It’s a really weird place to be after working so hard for the past 10 years.",
        "subreddit": "Entrepreneur",
        "author": "justbeeingh0nest",
        "score": 492,
        "num_comments": 275,
        "created_utc": 1760915539.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ob44d8/sold_my_business/",
        "fetched_at": "2025-10-21T00:56:22.334934"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 465,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-21T00:56:29.173126"
      },
      {
        "id": "1oaoy2j",
        "title": "Just met with a 5-year old founder",
        "selftext": "Dropped out of kindergarten to move to SF\n\nYou may be shocked, but he is now building an AI startup\n\nTold me he gets fired up when his babysitter writes on board:  \n\"Let's get back to building\"\n\nIncredible",
        "subreddit": "Entrepreneur",
        "author": "Wild-Photo-717",
        "score": 292,
        "num_comments": 40,
        "created_utc": 1760878530.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oaoy2j/just_met_with_a_5year_old_founder/",
        "fetched_at": "2025-10-21T00:56:22.334981"
      },
      {
        "id": "1ob6lyi",
        "title": "How to refuse service for certain people without violating federal law?",
        "selftext": "We operate a horseback riding business. Obviously, this requires physical ability and makes people prone to injury as they are getting on/off horses. Over the past few years, we have had families bring elderly relatives - people in their 80s and 90s, some with very frail bones or broken hips. This is extremely dangerous as they cannot easily get on/off the horse. Some of them are so immobile they cannot even walk from their cars to our staging area let alone get on a horse.\n\nToday we had an elderly fall off the horse and smash her head open.\n\nI want to be able to legally refuse service to people in such a condition. Here is the problem, federal law (Age Discrimination Act of 1975) does not permit us to discriminate based on age or disability. So we are in a gray area here.\n\nI do not want elderly people who are physically immobile to use our service and if they show up I want to be able to legally deny them, but I do not want to violate federal discrimination laws (such as Age Discrimination Act of 1975) and get sued. Are there any out clauses in the law that we can use for denying service based on it being say \"a risk to that person's safety\" or something? Of course I don't know if we are subject to federal age discrimination laws as we are a private company and do not receive federal funding.\n\nDoes anyone know a way around this. I'm thinking if we make a 'safety and risk' policy for ALL customers instead of just elderly that would work. Any info would be appreciated.\n\n  \nWe do have liability waivers customers sign but I still do not want people getting injured.",
        "subreddit": "smallbusiness",
        "author": "Outrageous-Engine881",
        "score": 225,
        "num_comments": 141,
        "created_utc": 1760922403.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ob6lyi/how_to_refuse_service_for_certain_people_without/",
        "fetched_at": "2025-10-21T00:56:27.344740"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 175,
        "num_comments": 49,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-21T00:56:29.173173"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 166,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-21T00:56:29.173168"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 165,
        "num_comments": 114,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-21T00:56:29.173137"
      },
      {
        "id": "1obju1h",
        "title": "About to raise rates 50% on my biggest client. Either they pay or I'm free",
        "selftext": "Running a small account/bookeeping consultancy. One client pays $5k/month which makes up almost half of my revenue\n\nThey hav also made my life hell. Disorganized records and last minutes request plus urgent weekend text, constant stress. \n\nI've vented about them before, everyone around me ask me to fire them. I didnt, until now....\n\nThis week i am sending an email raising their price to $7.5k/month. If they agree, i will get paid for the chaos, if they leave, even better, i will get my sanity back\n\nEveryone I’ve talked to says I’m either brave or stupid. Probably both. i got about 4 months of savings to fall back on, so this is my line in the sand.\n\nAnyone here has similar experience? How did it go? Any advice before i send that email?",
        "subreddit": "Entrepreneur",
        "author": "Normal-Gear283",
        "score": 111,
        "num_comments": 64,
        "created_utc": 1760969085.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1obju1h/about_to_raise_rates_50_on_my_biggest_client/",
        "fetched_at": "2025-10-21T00:56:22.334932"
      },
      {
        "id": "1obk92v",
        "title": "I had to fire someone who wasn’t toxic, lazy, or bad, just... lost.",
        "selftext": "Have you ever had to end a collaboration with someone you genuinely liked working with?\n\nRecently, my business partner and I had to make that call with a freelance developer we both appreciated a lot. He wasn’t lazy or unskilled. At the beginning he was one of the most reliable people on the team. But over time something shifted. Tasks took longer, communication became distant, and it started to feel like he was working just to fill hours instead of driving things forward.\n\nIt wasn’t dramatic or toxic, just that slow fade where motivation disappears. We tried to talk things through, but nothing really changed. In the end, keeping him on didn’t feel fair to him or to us.\n\nWhat surprised me most was how heavy it felt afterward. I actually liked the guy, and I kept wondering if I could have done more to help him reconnect. The next day, I spoke with another developer who has been working with us for a while, consistent, reliable, never any drama. I took a moment to thank her for her work, and she seemed genuinely touched.\n\nIt made me realize how often we forget to appreciate the people who quietly do things right until something goes wrong somewhere else.\n\nHave you been through something similar in your business? How did you handle it on your side?",
        "subreddit": "smallbusiness",
        "author": "Due-Bet115",
        "score": 90,
        "num_comments": 20,
        "created_utc": 1760970170.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1obk92v/i_had_to_fire_someone_who_wasnt_toxic_lazy_or_bad/",
        "fetched_at": "2025-10-21T00:56:27.344734"
      },
      {
        "id": "1obl6uj",
        "title": "Today’s massive outage proves one thing the internet is way too centralized",
        "selftext": "Watching half the internet break today was wild. It’s not even an ISP issue it’s backbone level. When one major CDN or DNS provider sneezes the whole web catches a cold.\n\nThis outage is a real time reminder of how dependent we are on a handful of infrastructure giants.\n\nIt’s not just streaming or social media even work tools APIs authentication and IoT devices go down like dominoes.\n\nDo you think decentralization or more regional fail safes could actually prevent this or are we just too far gone into cloud dependency?",
        "subreddit": "smallbusiness",
        "author": "Reasonable_Roof5940",
        "score": 80,
        "num_comments": 14,
        "created_utc": 1760972628.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1obl6uj/todays_massive_outage_proves_one_thing_the/",
        "fetched_at": "2025-10-21T00:56:27.344736"
      }
    ]
  }
}