{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-02T16:13:56.016603"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-02T16:13:47.703972"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-02T16:13:47.703974"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-02T16:13:47.355004"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-02T16:13:47.355010"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-02T16:13:47.354991"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-02T16:13:47.703968"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-02T16:13:47.703971"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-02T16:13:47.355006"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-02T16:13:47.703957"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-02T16:13:47.355008"
      }
    ],
    "reddit": [
      {
        "id": "1nv5426",
        "title": "Spotify CEO shared how to build a $146B company from 0.",
        "selftext": "These points are summarized from Daniel Ek's podcast episode on Acquired FM.\n\nI’m applying 99% of these lessons in my own startup [Shipper.now](http://shipper.now/) (AI no-code app builder), which I’m building in public. Thought I’d share in case it’s useful to other founders here.\n\nCheers :)",
        "subreddit": "SaaS",
        "author": "chdavidd",
        "score": 1384,
        "num_comments": 73,
        "created_utc": 1759316477.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nv5426/spotify_ceo_shared_how_to_build_a_146b_company/",
        "fetched_at": "2025-10-02T16:13:50.212255"
      },
      {
        "id": "1nvzb12",
        "title": "My friend's \"artisan\" coffee shop is just a £99 Nespresso machine (making £15k/month)",
        "selftext": "So my mate opened what was supposed to be a bakery about 8 months ago. Decent pastries, cakes and stuff, nothing special and just about breaking even.\n\nThen she pivoted hard into the \"coffee shop\" vibe and renamed it something pretentious with \"& Co.\" at the end. She's charging £3.80 for a flat white and £4.20 for a cappuccino. Premium prices for the area.\n\nThe coffee is made with a Nespresso Vertuo Pop she got for £99 from Argos and pods that cost about 38p each when bought in bulk. No barista skills needed, just stick in a pod and press a button. She's making £3+ profit per cup after the pod cost.\n\nThe irony is she first saw this machine when she came to my house. I've had this machine for yonks and I know that if you stick with the safe options like Costa Rica, El Salvador, Colombia, Mexico and those kind of pods, you just can't go wrong and nobody gonna have a clue.\n\nThere's a proper £2k+ commercial espresso machine in the corner, the kind you'd expect in a specialty coffee shop. Customers can barely see it unless they're really looking or go out of their way to look behind the counter.\n\nShe bought it broken on purpose. Found it on Facebook Marketplace for dirt cheap and it's purely for aesthetics. It's never worked, it's literally just a prop.\n\nBehind that machine is the Nespresso machine doing all the actual work.\n\nFrom what she's told me she's selling 170+ cups a day on average. Rough maths says that's £500+ in daily coffee revenue alone (not counting pastries) which is approx \\~£15k a month just from coffee.\n\nThe customers seem to be raving about it on Google reviews.\n\nPart of me thinks this is genius cos she's created an environment people want to be in and they're happy to pay premium prices. She laughs it off saying \"restaurants mark up wine 300%, nobody bats an eye\".\n\nIs this just smart business? She's asking me to join her and double down.",
        "subreddit": "Entrepreneur",
        "author": "Y0gl3ts",
        "score": 939,
        "num_comments": 462,
        "created_utc": 1759398071.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nvzb12/my_friends_artisan_coffee_shop_is_just_a_99/",
        "fetched_at": "2025-10-02T16:13:48.425171"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 457,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-02T16:13:55.015245"
      },
      {
        "id": "1nuyaqr",
        "title": "Just closed a $50M+ acquisition (I will not promote)",
        "selftext": "Well Reddit… it’s been over 10 years of grinding, pivots, blood, sweat, and tears, but the journey finally took the turn we’d always been aiming for.\n\nWhen my partners and I first set out, this was the ultimate goal, and after a decade of ups and downs, we’ve actually accomplished what so many entrepreneurs dream about.\n\nBack then, we were just naive college kids who knew absolutely nothing about technology. If anything, I hope our story shows that *anyone* can figure it out and make it happen if they stick with it long enough.\n\nI thought about writing a long post with bullet points on all the lessons learned, and I can do that if people want, but this post was to spread encouragement that anyone can do this. I’ve been contributing to this subreddit for 10 years, and I’ve learned a ton from the experienced founders here (especially when I was starting out).\n\nFor anyone who says there aren’t real success stories here, that it’s all “wantrepreneurs”, remember: everyone has to start somewhere. A lot of us are here, lurking, learning, contributing, and quietly grinding away on our projects until one day the pieces finally click.\n\n\\*EDIT\\* Thank you all for the kind words. I wasn't really sure what to expect with this post, but since it's taking too long to reply to everyone. Thank you.",
        "subreddit": "startups",
        "author": "Millionaire_",
        "score": 414,
        "num_comments": 142,
        "created_utc": 1759291223.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nuyaqr/just_closed_a_50m_acquisition_i_will_not_promote/",
        "fetched_at": "2025-10-02T16:13:51.818543"
      },
      {
        "id": "1nv9hl2",
        "title": "Took me years, but I finally rolled past $480,000. Sharing here because IRL doesn’t quite get it.",
        "selftext": "I’ve been building a tiny, unsexy service business for a few years. No funding, no cofounder, no office. Just me figuring it out, messing it up, and trying again.\n\nThis week my dashboard rolled over the $480,000 mark in total revenue (I know it's a pretty specific milestone number but [4 & 8] are my favorite numbers, haha). It didn’t come fast. The first year I made $0-$500 for 9 months. I was SO CLOSE to quitting after a string of chargebacks. A contractor ghosted me LITERALLY mid project and I had to refund work I couldn’t afford to refund. I still take calls from a cheap desk in my second bathroom (that I never used and converted over into an office)...\n\nI know this isn’t “made it” / retirement money and I’m not trying to sell anything. I just needed to say it somewhere so people understand what it costs to get even this far. The late nights. The “is this stupid?” loop. The quiet wins nobody sees. I promise you it pays off no matter how much you don't get it\n\nIf you’re early: keep building those fundamental structure points.. If you’re further along: RESPECT!\n\n Today I’m just letting myself feel proud for a second, then it’s back to grind.\n\nNo links, no pitch, no \"click on my profile\" hidden motive BS.. \n\njust sharing a moment with folks who get it...\n\nEdit: Wow, I wasn’t expecting this much feedback haha. Appreciate everyone who took the time to comment. For anyone wondering how it started, my first few clients came from straight cold outreach emails and calls (my gf handled the emails while I handled the calls) until someone finally said yes. Nothing fancy, just persistence. And if your quality matches that persistence then most the time you can count word of mouth as a big source of your business. \n\nSIDENOTE: IF YOU'RE ABLE TO FIND DECENT QUALITY SALES REPRESENTATIVES WILLING TO WORK FOR COMMISSION.. it really paid off for me and can really help speed along that process. My mother always told me that one head is good but two heads is better, but I think ten heads is even better than that and so on and so forth ... Obviously it's not mandatory but in my case it really helped me cover more ground than I would have been able to, alone.",
        "subreddit": "Entrepreneur",
        "author": "Which_Junket3102",
        "score": 270,
        "num_comments": 67,
        "created_utc": 1759328363.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nv9hl2/took_me_years_but_i_finally_rolled_past_480000/",
        "fetched_at": "2025-10-02T16:13:48.425186"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 172,
        "num_comments": 45,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-02T16:13:55.015268"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 155,
        "num_comments": 49,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-02T16:13:55.015260"
      },
      {
        "id": "1nv6si7",
        "title": "Thinking about starting a small business but not sure where to begin",
        "selftext": "I’ve been sitting on the idea of starting something of my own for a while now but I honestly have no clue what the actual first step should be. Do you just start small and kind of figure it out along the way, or do you need to have a whole plan written out before you even try? I keep going in circles about it.  \nI don’t have a lot of money saved up, just a little extra from myprize that I’ve been putting aside. It’s not enough to go big, but it feels like enough to at least try something if I had a clear direction. I just hate the idea of letting it disappear into random bills or dumb purchases when I could maybe put it toward something that matters.  \nFor anyone here who’s already done it, how did you actually get started? Was it a side hustle that grew over time, or did you just jump straight in and make it work?",
        "subreddit": "smallbusiness",
        "author": "Purple_Low7688",
        "score": 153,
        "num_comments": 60,
        "created_utc": 1759321585.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nv6si7/thinking_about_starting_a_small_business_but_not/",
        "fetched_at": "2025-10-02T16:13:53.291906"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 151,
        "num_comments": 179,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-02T16:13:55.015300"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 115,
        "num_comments": 57,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-10-02T16:13:55.015305"
      }
    ]
  }
}