{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-06T08:16:20.601476"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-06T08:16:12.275705"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-06T08:16:12.275708"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-06T08:16:11.759040"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-06T08:16:11.759047"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-06T08:16:11.759023"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-06T08:16:12.275700"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-06T08:16:12.275703"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-06T08:16:11.759043"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-06T08:16:12.275687"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-06T08:16:11.759045"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 460,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-06T08:16:19.600860"
      },
      {
        "id": "1nyrujd",
        "title": "Wife wants to start a business, but is relying on me to start it",
        "selftext": "For context, I already run a business that I built from the ground up. I’m doing about $15k-30K/month in business revenue with roughly a 50-70% profit margin depending on the month.\n\nMy wife is a full-time student and works part time, but has seen the earning potential of my business first hand and would like to try her hand at running a business.\n\nPoint blank, she’s a hell of a lot smarter than I am but I’m willing to work 16 hour days, 365 days a year and do quite literally anything necessary to make my business successful. I’ve got two brain cells, a hell of a lot of grit, and healthy risk tolerance.\n\nMy wife is a great employee and straight A student. However, she has trouble starting new things and sticking to them unless there’s social pressure to do so. She’s also risk averse so some of the loans I’ve taken out for my business just about gave her a heart attack.\n\nShe wants me to help fund her business startup costs (which is only a few thousand so nothing I can’t stand to lose), make her a website, create marketing materials, and get leads coming in. I can do all of these things, but I’m worried that by doing so, she won’t learn about marketing or take ownership of the business.\n\nI want to be supportive of her and I’m going to fund the initiative regardless, but do you have any advice on how to navigate this situation so that she feels responsible for the business and takes ownership of it?",
        "subreddit": "Entrepreneur",
        "author": "TurkeySlurpee666",
        "score": 452,
        "num_comments": 323,
        "created_utc": 1759679583.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nyrujd/wife_wants_to_start_a_business_but_is_relying_on/",
        "fetched_at": "2025-10-06T08:16:12.971617"
      },
      {
        "id": "1nxsiwd",
        "title": "The company is dying, I will not promote",
        "selftext": "Joined a small company as a tech lead half a year before. There is a product that solves a real problem, there are contracts in the field. Found myself in a hot pan. The founders conflicted with the CTO, who built the company, then forced her out. New junior devs were hired, more financing was promised. After two months the salary stopped arriving. Founders conflicted, one of them left the company. Now the only remaining investor has cut out the money. The clients do not want to pay. I started looking for jobs but the market is dry. Just venting out.",
        "subreddit": "startups",
        "author": "Live-Conversation-49",
        "score": 242,
        "num_comments": 87,
        "created_utc": 1759580504.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nxsiwd/the_company_is_dying_i_will_not_promote/",
        "fetched_at": "2025-10-06T08:16:16.435288"
      },
      {
        "id": "1ny8jrh",
        "title": "Reasonable CEO salary",
        "selftext": "I run a small profitable business in the USA. This year our annual revenue should be between $7 and $9 million. I recognize that I am able to pay myself a reasonable salary before I leave the rest to distributions for the rest of my investors. For a profitable company making that much in an annual revenue what is considered a reasonable salary for a CEO? ",
        "subreddit": "smallbusiness",
        "author": "binhex225",
        "score": 207,
        "num_comments": 141,
        "created_utc": 1759619657.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ny8jrh/reasonable_ceo_salary/",
        "fetched_at": "2025-10-06T08:16:17.930463"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 170,
        "num_comments": 46,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-06T08:16:19.600889"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 159,
        "num_comments": 50,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-06T08:16:19.600880"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 151,
        "num_comments": 179,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-06T08:16:19.600923"
      },
      {
        "id": "1ny9a5o",
        "title": "The Myth of “Ideas Are Cheap” and How Founders Keep Losing What’s Priceless",
        "selftext": "Every time someone says, “Ideas are cheap, execution is everything,” I wince a little.\n\nBecause what they really mean is, “Your idea is cheap, until we execute it without you.”\n\nNot every idea is a billion-dollar spark, that is true. But the right one, at the right time, with the right intent, is equity in its purest form. And lately, that is what is being stripped from real founders.\n\nI have seen this too often.\nA founder pitches to investors, gets rejected, and six months later, the same concept surfaces from a portfolio company, repackaged with funding.\nNon-disclosure agreements are mocked. Validation is dismissed. “Execution” becomes the shield that justifies imitation.\n\nMeanwhile, pseudo-founders parade around with thin-air equity, pseudo-investors hunt safe vanity bets, and pseudo-VCs gamble other people’s money to climb prestige ladders.\n\nIt is not startups versus corporates anymore. It is authentic creation versus systemic mimicry.\n\nThose who actually build from scratch, with sleepless nights, borrowed laptops, and insane conviction, are not just executing. They are imagining.\n\nExecution is a skill.\nVision is a gift.\nBoth are currency. But one is disappearing from circulation.\n\nDo you think ideas are still undervalued, or have founders stopped defending them?",
        "subreddit": "Entrepreneur",
        "author": "N-Innov8",
        "score": 132,
        "num_comments": 102,
        "created_utc": 1759621667.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ny9a5o/the_myth_of_ideas_are_cheap_and_how_founders_keep/",
        "fetched_at": "2025-10-06T08:16:12.971656"
      },
      {
        "id": "1nysk7l",
        "title": "How to handle a bad experience with American Express Credit Cards and a warning for other small business owners",
        "selftext": "**Has anyone else gone through something like this with American Express?**  If so, I would love to know **how to deal with this issue**, I will be contacting them tomorrow (Monday) morning. If you have dealt with it, how did you resolve it?\n\nI’ve been with Amex for over 25 years. Between my business and personal cards, I’ve probably run somewhere between $30–50 million through them over that time. Never missed a payment. **Never had a problem. I have paid early EVERY month** on my Plum card to receive the cash back. My personal credit score is over 800.  My business has been more profitable every year it has been in existence.  There should be zero flags to show a problem.\n\nThen out of nowhere, this past Saturday evening around 6:45 PM, I get an email saying my available credit limits have been reduced on all six of my cards. I thought it had to be spam. Logged in and it was real. Every single card had its limit cut dramatically, some by as much as 90%.\n\nThat instantly made several cards show as “over limit” by tens of thousands of dollars, even though I hadn’t made a new charge. Just because Amex decided to lower the limit after the balance was already there.  No warning, no explanation. Just an email after hours on a weekend.\n\nNow I have personal cards showing a balance greater than the credit limit, which will negatively impact my credit score if the credit bureau happens to pull the data today.\n\nSo I called the number on the back of the card and got sent to a recording saying underwriting was closed until Monday morning. There was no way to get past that prompt once I put my card info in.  They sent the email ten minutes after they closed, so there was literally no way to talk to anyone. Perfect timing, right?\n\nNow imagine if I were traveling internationally or needed those cards to cover scheduled payments. Too bad. They just stop working. Some of mine already declined Sunday morning for pending charges, and of course Amex won’t be covering any fees or fallout from that.\n\nI tried the chat on their site, spent 15 minutes explaining everything, only to be told I needed to call a “special number” where someone could help me as a “long time valued customer.” I called it, and got the same voicemail saying to try again Monday.  Valued customer...right.\n\nSo here I am, 25 years of loyalty, perfect history, and six suddenly crippled accounts that I can’t even use because someone at Amex flipped a switch and didn’t think about what that does to small business owners who rely on those cards every day.\n\nIf this can happen to me, it can happen to any of you. And it raises real questions about how Amex handles risk, or maybe just their cash exposure, without giving long-time customers any warning or chance to prepare.\n\nFor small business owners, this is something to think about before making Amex your main line of credit. Because “member since 1998” apparently doesn’t mean much when their algorithm or someone working risk on a weekend decides to cut you off on a Saturday night.",
        "subreddit": "smallbusiness",
        "author": "mmurphey37",
        "score": 125,
        "num_comments": 27,
        "created_utc": 1759681216.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nysk7l/how_to_handle_a_bad_experience_with_american/",
        "fetched_at": "2025-10-06T08:16:17.930424"
      },
      {
        "id": "1nykd32",
        "title": "Build this and I'll 100% pay for it and very likely invest! This problem is driving me crazy!",
        "selftext": "Hey everyone,\n\nSo I'm a father of two. \nMy eldest is 10 and he's very interested in tech (coding, electrical engineering and 3D/game design). \n\nAll the best tutorials are on YouTube, so he uses it religiously. And YouTube kids is just to rubbish with no decent learning content for him. \n\nHere is the problem:\nHe's 10, so he still gravitates to watching brainrot shorts, incredibly stupid YouTubers and of course as it's full YouTube there is occasionally inappropriate content that get recommended (even with parental settings/controls). \n\nIf I had an app, specifically for tracking what what watched on his account with whitelist and black list options for channels and the ability to turn access to YT shorts on or off, I would easily pay a monthly sub for this. \n\nI also know this is a huge problem for parents and YouTube have no desire to make this themselves. \n\nPlus they can't, as I use my discretion to allow him to watch videos with occasional swearing etc if the content overall is educational (I see this as a fair trade off and also part of growing up). \nYouTube can't make controls that allow for that level of nuance. \n\nJust putting this out there. \n\nYouTube is a serious issues for us parents and far more detailed visibility on how there are navigating it and controls for us are really really needed. \nI would happily throw some Angel money at a decent MVP too if the vision, founder and understanding of the market is there. \n\nDo with that information as you will. ☺️\n\nEdit: to clarify, if someone is looking for a SaaS/extension idea with actual demand, please build this and if the MVP is good I'll sub, if it's good and you are a great founder I'll also invest and provide GTM mentoring. I'm not looking to hire a dev. I just want someone to build this and a decent revenue stream around it too. ",
        "subreddit": "SaaS",
        "author": "Optimal-Emotion3718",
        "score": 122,
        "num_comments": 160,
        "created_utc": 1759658885.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nykd32/build_this_and_ill_100_pay_for_it_and_very_likely/",
        "fetched_at": "2025-10-06T08:16:14.756856"
      }
    ]
  }
}