{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-30T16:14:06.015349"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-30T16:13:57.194357"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-30T16:13:56.912080"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-11-30T16:13:56.912087"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-30T16:13:56.912082"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-30T16:13:56.912067"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-30T16:13:57.194354"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-30T16:13:57.194362"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-30T16:13:57.194360"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-30T16:13:57.194342"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-30T16:13:56.912084"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 487,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-30T16:14:05.013954"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 423,
        "num_comments": 117,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-11-30T16:14:05.013969"
      },
      {
        "id": "1p9uk2q",
        "title": "I spent $1000 advertising on Reddit and have nothing to show for it",
        "selftext": "Basically the title. I absolutely failed to convert even one of the 5000 clicks (and >1m views of the ad) I got into anything - even a deeper click, not to mention a $1 of revenue, despite experimenting with a dozen different variants of copy for my landing page and having one epiphany after another (and a few moments of deep despair).\n\nI even had someone (just one person, luckily) point out in a random sub how annoying my ads were, so most of you probably saw them (the noir styled comics) once or twice.\n\nI apologize for the annoyance if you felt it\n\nAnyway, I'm shutting this down and abandoning this path, but before I do maybe I can answer a few questions - if you want to pursue a similar path and avoid my mistakes.\n\nEdit:\n\nRIP my inbox, etc.. I love you guys, you are awesome! The feedback I got was so good that the current version of the ad plus landing page is doing very well - about 6% clicks on the CTA.\n\nI've got a gazillion notifications to go through and I'll try to respond to everyone, but if I can't, I will at least *read* everything. I really appreciate the attention this got and I'll try to do a write up on my actual learnings here - the biggest ones are about being humble and asking for help.\n\n🙏",
        "subreddit": "Entrepreneur",
        "author": "zoozla",
        "score": 196,
        "num_comments": 183,
        "created_utc": 1764437298.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p9uk2q/i_spent_1000_advertising_on_reddit_and_have/",
        "fetched_at": "2025-11-30T16:13:57.839496"
      },
      {
        "id": "1pa6rpz",
        "title": "I’m 22, had a small travel agency that made me around 70k, then I randomly ended up on a Hass avocado farm in Kenya… bought land in Ethiopia… and now I’m kinda stuck on what to do next",
        "selftext": "I’m 22 and honestly I’ve always been good with saving and money stuff. I started this small travel agency a couple years back, nothing crazy, but it somehow worked and I made like 70k over time. As I started making money I also started traveling a lot, just seeing the world, learning stuff… one of those trips was to Kenya.Someone I met there took me to this Hass avocado farm. I swear I didn’t even care about farming before but something about that place stuck with me. The trees, the export thing, the whole operation… don’t know why but it hit me.\nBefore that I was just doing the travel agency thing, but then the whole model started getting copied everywhere and abused. Margins dropped, everything felt off, so I shut it down before it ate everything I worked for.When I got back home I kept reading about Hass avocados nonstop. Like for two years. Everything from seedlings to climate stuff to yields and prices. Deep rabbit hole.Then I found some land in Ethiopia that fit everything I learned and I bought it. Honestly that moment felt wild, like “damn… this is mine.”And now I’m kinda just sitting here thinking, ok… what’s the actual next move?\nIt’s weird going from a travel agency to avocado farming. Didn’t expect life to go this direction at all.Anyone else ever make a complete switch like this?How do you know if you’re moving smart or just chasing something because it felt right in the moment?\n\nAny advice would be appreciated",
        "subreddit": "smallbusiness",
        "author": "Professor1602",
        "score": 99,
        "num_comments": 76,
        "created_utc": 1764469553.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pa6rpz/im_22_had_a_small_travel_agency_that_made_me/",
        "fetched_at": "2025-11-30T16:14:03.317257"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 73,
        "num_comments": 52,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-30T16:14:05.013993"
      },
      {
        "id": "1p9sh4c",
        "title": "Our finance guy is too nice and people are walking over him with late expense submissions",
        "selftext": "We have a 7 day policy for submitting expenses but nobody follows it and our finance manager is too polite to actually enforce it. He'll send these really friendly reminder emails asking if it's possible for them to expense it but everyone ignores them. When I say them I'm talking about my coworkers\n\nLast week he was trying to close the books for October and there were still 3 people who hadn't submitted anything. He spent like 2 hours tracking people down in slack asking about random charges from weeks ago that nobody remembers. The day after I had lunch with him and he looked pretty sad and he (I didn't brought it up) brought up how it's super hard to deal with the expenses in our company since nobody is responsible\n\nThe worst part is he's genuinely a great guy and I feel terrible watching people take advantage of how nice he is. He'll never push back or enforce consequences so everyone knows they can just submit whenever and he'll deal with it\n\nI know there's nothing from my side that I can do about this but I just want to know if I can propose something to him in order to fix this. I'm also planning to talk to some of our coworkers and ask them to be more responsible because they're literally adults WITH KIDS who are doing this. Unbelievable!!  \nHappy late Thanksgiving btw \\^ ",
        "subreddit": "smallbusiness",
        "author": "Massive-Long5511",
        "score": 70,
        "num_comments": 44,
        "created_utc": 1764432182.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p9sh4c/our_finance_guy_is_too_nice_and_people_are/",
        "fetched_at": "2025-11-30T16:14:03.317275"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 57,
        "num_comments": 51,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-11-30T16:14:05.013997"
      },
      {
        "id": "1p94kaz",
        "title": "The Startup \"Sprint\" Lie: If everything is a priority is anything actually important? [I will not promote]",
        "selftext": "The modern startup runs on the concept of the eternal sprint. But biologically, a sprint is a short burst followed by rest. We are observing teams running a marathon at a sprint pace, fueled by caffeine and equity that might be worthless. When \"crunch time\" becomes \"standard operating procedure,\" is it still passion, or is it just exploitation branded as culture?",
        "subreddit": "startups",
        "author": "Interesting-Scale-63",
        "score": 45,
        "num_comments": 18,
        "created_utc": 1764360090.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p94kaz/the_startup_sprint_lie_if_everything_is_a/",
        "fetched_at": "2025-11-30T16:14:01.865047"
      },
      {
        "id": "1p5rw6m",
        "title": "graphic design client has asked me to trace over an AI image a whole month into the project.",
        "selftext": "So for context i’m (24f) a fairly new freelance graphic designer and illustrator who’s had a handful of clients so far. The client was referred to me through a friend and wanted some branding work done for a food business she’s launching. I have been regularly updating her showing her my work progress and illustration. She’s expressed to me that she’s pretty satisfied so far and asked for a few reasonable tweaks over the course of the project. After checking in with her today, it’s as if she’s done a 180 and is now telling me to essentially trace the AI reference she showed to me at the beginning of the project. To clarify she stated from the beginning that she liked my illustration style and graphic design work and was only showing me an AI reference image to visualise what she’s unable to create herself.  As someone who specialises in illustration I am quite against using AI generated drawings. So it feels like a slap in the face and a waste of my time to have her say she likes my work so far, when clearly she must’ve been lying or apprehensive about it all along and just wanted slightly customised AI art. I’m quite hurt and i don’t know how i should move forward. Any thoughts?",
        "subreddit": "freelance",
        "author": "disposablegay",
        "score": 45,
        "num_comments": 35,
        "created_utc": 1764015466.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p5rw6m/graphic_design_client_has_asked_me_to_trace_over/",
        "fetched_at": "2025-11-30T16:14:05.013971"
      },
      {
        "id": "1p5dccw",
        "title": "I used to refresh my inbox like something would magically change. Spoiler: nothing changed.",
        "selftext": "So… quick story.\n\nFor way too long, I genuinely thought I’d get clients just because I was “good at what I do.”  \nI kept learning new tools, improving my work, fixing tiny details nobody even asked for.\n\nMeanwhile:  \nNo messages.  \nNo leads.  \nNo “Hey, can we talk?”\n\nJust silence.\n\nIt got embarrassing because I’d open my inbox every morning like some sort of ritual… as if overnight the universe would send clients my way.\n\nEventually, after weeks of this, something clicked and it was honestly uncomfortable to admit:\n\n**It’s not that clients were ignoring me…**  \n**It’s that they didn’t even know I existed.**\n\nThat one hit hard.\n\nSo I finally tried outreach.\n\nThe first messages I sent were awful.  \nToo formal.  \nToo “professional.”  \nI sounded like an AI pretending to be a LinkedIn coach.\n\nPeople ignored me — and honestly, I would’ve ignored me too.\n\nBut then I stopped trying to sound smart and started sounding normal.\n\nLike:\n\n“Hey, I saw what you’re working on — looks cool. If you ever need help with X, let me know.”\n\nThat’s it. Nothing fancy.\n\nAnd weirdly… people replied.\n\nNot a lot.  \nNot instantly.  \nBut enough to prove outreach isn’t begging — it’s just saying “hey, I noticed.”\n\nOne thing that helped (not gonna pretend otherwise) is using AI to help me personalize messages faster. Not spam. Personalized. Like referencing something specific from their content, website, or niche.\n\nNow I’m not drowning in clients or anything.  \nBut my inbox isn’t empty anymore.  \nThere are conversations — and conversations create clients.\n\nSo if you’re stuck in that phase where you’re getting better, learning more, improving yourself — but not actually talking to potential clients…\n\nTry sending a message or two.\n\nEven if it feels weird.  \nEven if no one replies at first.  \nEven if your brain screams “not ready.”\n\nYou don’t get clients by waiting. You get clients by starting conversations.",
        "subreddit": "freelance",
        "author": "Sea_Vanilla_7402",
        "score": 43,
        "num_comments": 13,
        "created_utc": 1763979147.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p5dccw/i_used_to_refresh_my_inbox_like_something_would/",
        "fetched_at": "2025-11-30T16:14:05.013975"
      }
    ]
  }
}