{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-24T08:18:41.166583"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-24T08:18:32.028679"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-24T08:18:31.631976"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-24T08:18:31.631979"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-24T08:18:31.631957"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-24T08:18:32.028676"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-24T08:18:32.028685"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-24T08:18:32.028682"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-24T08:18:31.631986"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-24T08:18:32.028664"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-24T08:18:31.631981"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 480,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-24T08:18:40.165214"
      },
      {
        "id": "1p4hy4s",
        "title": "Does anyone else feel like 'Mystery Boxes' are the only way to clear dead stock without looking desperate?",
        "selftext": "I'm sitting on about $15k of inventory from last season. I can't run a 70% off sale on the site because I'm terrified it will ruin our 'premium' image and piss off customers who paid full price. I've looked at liquidation sites but they all seem sketchy or require massive volume. Has anyone found a way to sell bulk inventory to exporters or off-price buyers without it ending up on eBay with your brand name all over it? Is 'burning it' actually a thing people do?",
        "subreddit": "smallbusiness",
        "author": "Late-Succotash-2816",
        "score": 374,
        "num_comments": 93,
        "created_utc": 1763887891.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p4hy4s/does_anyone_else_feel_like_mystery_boxes_are_the/",
        "fetched_at": "2025-11-24T08:18:38.250412"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 182,
        "num_comments": 35,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-24T08:18:40.165261"
      },
      {
        "id": "1p33oj5",
        "title": "Why can’t a company like Quora do better than new startups in the same space? Would you build “a new Quora” today? I will not promote",
        "selftext": "I remember using Quora a lot between 2014 and 2019 – it felt like *the* place for detailed, thoughtful answers. Now I barely see it referenced anywhere. Instead, there are lots of new Q&A / discussion-based startups appearing, and even older platforms like Reddit feel far more active, relevant, and alive.\n\nIt makes me wonder: what really happened to Quora as a product and company? Did the experience slowly get worse (bots, low-quality answers, clickbait, aggressive ads), or did user behavior simply shift toward faster, community-driven platforms and AI tools?\n\nFrom a startup point of view, I’m fascinated by how a small team can compete with – and sometimes beat – a big, established player. With fewer resources but more focus, a startup can ship faster, keep the UX clean, moderate better, and stay closer to what users want *right now*, not what worked 10 years ago.\n\nFor founders and PMs here:\n\n* If you were building in the “Quora space” today, what would you do differently?\n* What do you think Quora got wrong (or stopped doing right)?\n* Are Q&A platforms still a good problem space in 2025, or is that window mostly closed?\n\n(For clarity: I’m not promoting anything, just trying to understand the dynamics and learn from Quora’s trajectory.)",
        "subreddit": "startups",
        "author": "Shubham0420",
        "score": 80,
        "num_comments": 36,
        "created_utc": 1763743746.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p33oj5/why_cant_a_company_like_quora_do_better_than_new/",
        "fetched_at": "2025-11-24T08:18:36.396614"
      },
      {
        "id": "1p4kwj7",
        "title": "I raised $100K off a single deck as a solo founder",
        "selftext": "I’m a solo founder and somehow ended up getting a $100K commitment from a VC off one deck and a short meeting.  \nNo MVP, no traction, nothing fancy. Just a deck and… me. Honestly still a little surprised.\n\nFor context, I’ve been running a video/animation studio for about a decade.  \nSomething like 5,000 projects over the years.  \nSo most of my life has basically been explaining complex stuff with visuals and dealing with every type of client you can imagine.\n\nNow I’m working on a prompt-to-video tool that spits out full explainer videos from a single prompt.  \nIt feels like the natural evolution of the work I’ve been doing forever.\n\nThe interesting part is what I think actually made the VC take me seriously this early:\n\n**• I know the problem way too well.**  \nClients think they know what video they need, but after thousands of projects you start predicting their real pain points before they even mention them.  \nI think the VC saw that I wasn’t guessing - I’ve been solving the same problems manually for a decade.\n\n**• I understand the market because I lived in it.**  \nWhen you’ve quoted, negotiated, and delivered thousands of videos, you end up with a pretty realistic sense of who buys, when they buy, and where the money actually comes from.  \nVCs don’t need you to “research the market” when you’ve already been operating inside it for 10 years.\n\n**• I have direct access to customers.**  \nI don’t need to run ads or cold outreach to find people to validate ideas. I can DM a few founders or marketers and get unfiltered feedback in minutes.  \nInvestors love when you already have a built-in feedback loop because it means faster iteration and fewer wrong turns.\n\n**• I know the competition from the inside.**  \nNot from reading comparison charts… from literally competing with them for years.  \nThat gives you a much better sense of where the real gaps are versus what competitors say they offer.\n\n**• I’m actually a builder.**  \nI’ve been coding since I was a kid and running a studio forced me to develop operational discipline.  \nSo instead of “great idea but can you execute?” the meeting became “ok, he’ll actually build this stuff.”\n\nBasically, none of this felt forced.  \nThis is the kind of product I’d be building even if no one funded it, and I think the VC could feel that.  \nIt wasn’t a random idea I picked off a list - it was just the next logical step in a career I already lived, and I think that was the key.\n\nDon't try to force an idea. Focus on finding problems you already know inside and out, and VCs will appreciate that.\n\nCurious if anyone else here also raised early based mostly on a deck?",
        "subreddit": "SaaS",
        "author": "GuyMakesVideos",
        "score": 79,
        "num_comments": 42,
        "created_utc": 1763898814.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p4kwj7/i_raised_100k_off_a_single_deck_as_a_solo_founder/",
        "fetched_at": "2025-11-24T08:18:34.666304"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 63,
        "num_comments": 42,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-24T08:18:40.165237"
      },
      {
        "id": "1p4lnwa",
        "title": "Quit my construction job for a startup that failed. Now I'm more lost than ever",
        "selftext": "Earlier this year I left construction to work for a small startup. They sold me on equity, growth potential, all that stuff. I took a massive pay cut because I genuinely believed in it.\n\nSpent the last few months learning everything - cold email, LinkedIn outreach automations, n8n automations , lead gen. I was actually pretty good at it. Booked them a ton of calls. \n\nBut they ran out of money and couldn't keep me on. So that's that.\n\nAlso broke up with my girlfriend during all this. So now I'm single, broke, sitting on all these skills I don't really know what to do with.\n\nMy old construction job would probably take me back. Good money, stable work. But honestly the thought of going back feels like I failed. Like I wasted all this time learning stuff that doesn't matter.\n\nEveryone says \"just freelance\" or \"offer your services\" but like... I have no clients, no real portfolio, no clue where to start.\n\nBeen thinking about doing free work or super cheap work just to get case studies and actually talk to people. But idk if that's the move or if it just makes me look desperate.\n\nThe frustrating part is I can build websites fast now, set up email campaigns that work, automate outreach - all this stuff that should be useful. But none of it matters if I don't have anyone to actually do it for.\n\nHas anyone been through something like this? Like a career change that just feels completely stuck? How did you figure it out?",
        "subreddit": "smallbusiness",
        "author": "Spare_Worldliness_64",
        "score": 61,
        "num_comments": 93,
        "created_utc": 1763901320.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p4lnwa/quit_my_construction_job_for_a_startup_that/",
        "fetched_at": "2025-11-24T08:18:38.250420"
      },
      {
        "id": "1p4vwzt",
        "title": "Marketing your SaaS from 0 to 5k MRR: What actually worked after 12 months",
        "selftext": "There are good engineers and founders with super great products but stuck at marketing.\n\nHere is a quick, short list of things you can do to kick off your marketing.\n\nContext: I just hit 5k MRR after 12 months with a developer tools SaaS. Not huge numbers, but enough to share what actually worked versus what I wasted time on.\n\nBefore we start, here are some heads up.\n\na. All I am about to tell is my experience and what worked for me.\n\nb. B2C is easy to scale compared to B2B.\n\nc. Don't try to make anything viral. It's not in your control.\n\nd. Be willing to spend some money on ads.\n\ne. Get ready to be embarrassed and look stupid. It's part of the game.\n\n### Step 1: Setting stage\n\nFind where your audience hangs out. This is very important for B2B products. Ask simple, common questions related to your niche/product to find out where they are. 6/10, you will land back here on Reddit. Check FB, LinkedIn, X, and other forums.\n\nOnce you find out, ask questions, leave comments, and see how engaging the hangout space really is. Don't sell. Remember you are here to test the waters before fishing.\n\nExample:\n\nOn Reddit, I went to r/Entrepreneur, r/SideProject, and r/indiehackers to see how engaging the community is and ask closely related questions like \"How do you validate your SaaS ideas?\" or \"What tools do you use for market research?\" Remember, don't sell. You are just gathering information.\n\nOn X, get X premium (it increases your reach) and use #buildinpublic and #indiehacker tags. Record a screen recording of how your product works and post it on X. Don't bother asking questions, just show.\n\n### Step 2: Social Proofing is the best way to get initial traction.\n\nGet your co-founder, wife, girlfriend, bf, your cat, or anyone who will back you to comment, upvote, share, or do and get that first 10 upvotes and 3 to 5 comments. People engage with engaged content.\n\nHere is what I did when I wanted to validate my idea on niche subreddits. The first 10 upvotes and a few comments were from me, my friends, and my brother. Then, it quickly gained traction, and people started engaging.\n\nShare a mockup, design, screenshot, or video of your product in action to get some social proof and engagement.\n\nAssess the engagement and traction.\n\nEvaluate the engagement. See how many comments and upvotes you get.\n\nYou will get some good thrashing and downvotes. That's fine.\n\nGo aggressive. Remember that aggression and spamming are neighbours. Share in as many channels as possible (Reddit, X, FB groups, LinkedIn groups, etc.).\n\nIf you do these right, you will have two things:\n\nGeneral impression about your product\n\nWhere people engage the most. This is what we want for the next stage.\n\nIf you fail, it's best to keep looking until you find the right place. (This is especially true if you are B2B.)\n\nFor the next step, you will need to spend some money.\n\n### Step 3: Paid ads.\n\nIf anyone tells you you can't scale using paid ads, they didn't do it right.\n\nShilling out on Google Ads and FB ads is not the way.\n\nSetting up tracking:\n\nWhen I take over an ad account, there is usually no tracking setup. Ads work not because of your product (it helps) but because of your tracking, which sends data to algorithms to find the right audience. If not server side tracking, at least GTM tracking should be in place.\n\nChoosing the right ad platform:\n\nThis is very important. This is where you use the knowledge you gathered in step 1. Choose the platform where your audience is. Find what your competitors are doing, their channels, etc.\n\nCreating ads:\n\nThis is the last important thing. A working ad is an equation. Good product, Good targeting, and good creatives = Good results. It's okay if any of these values are low, but you have to make sure none are 0.\n\nImage ads very rarely work. I have had some really work, but they are the exceptions. What works most of the time is a video ad. Go see some ads and see how they are made. You can check out the ad library to see what your competitors are doing.\n\nPay some influencer to make a video for you.\n\nAd budget:\n\nYou will need to spend at least $1500 in my opinion. Some argue you will need more, some argue less. From my experience, you will need to spend at least $1500 to get a good idea of your ads, audience, and results. Google and Reddit give ad credits. Use it.\n\nClosely monitor your ads. I strongly recommend finding someone who can do this for you, someone who knows what they are doing. Trust me, these channels are designed to make you spend money. This is why many people fail and say paid ads don't work.\n\nSetup tracking:\n\nSetup Hotjar so you can see how people use your product.\n\nSetup GA4 so you can see how people are coming to your site.\n\nBe super proactive and have your product ready.\n\nWhen we launched Reddit ads, we got 200+ signups in a week. I was overwhelmed with support tickets and emails, and I was not prepared for it. The product had some bugs under load, and I had to pause ads and fix things.\n\nRespond to emails and comments. Comments on FB, Reddit ads, X, etc.\n\nNote: while running ads on Reddit, disable comments.\n\n### Step 4: The thing nobody talks about (market research before building)\n\nThis is where I saved the most time and money. Before spending 6 months building features nobody wanted, I spent time actually understanding what problems people had.\n\nI built monitoring systems to track conversations across multiple subreddits. Not just reading posts manually, but actually tracking keywords, pain points, and what solutions people were asking for. This gave me a constant stream of validation data.\n\nFor example, I noticed developers kept complaining about spending weeks on boilerplate code for auth, payments, and database setup. So I prioritized building that into the platform first. That feature alone converted better than anything else.\n\nThe ROI on doing proper market research upfront is insane. You avoid building things nobody wants, and when you do launch, you already know the exact language your customers use to describe their problems.\n\n### Results after 12 months:\n\n5k MRR\n\n85% of users came from Reddit (organic posts and ads)\n\n35% came from X and ProductHunt\n\nAverage customer acquisition cost: $45\n\nChurn rate: 15% monthly (working on this)\n\n### What I would do differently:\n\nStart paid ads earlier. I waited 6 months and wasted time on organic only.\n\nSet up proper tracking from day one. I lost data from my first 100 users.\n\nBuild an email list from week one. I started too late.\n\nSpend more time in communities before launching. I rushed my first posts.\n\n### Tools that helped:\n\nHotjar for user behavior\n\nGA4 for analytics\n\nReddit ads with tight targeting\n\nX premium for reach\n\nThese are the basics. This post is already long. Feel free to ask questions or DM me if you want tailored ideas for your product.\n\nI built [my saas](https://bigideasdb.com) using this exact approach. It helps developers validate ideas faster through Reddit market research and comes with boilerplate code to ship faster.\n\nI hope this helps.",
        "subreddit": "SaaS",
        "author": "Important_Word_4026",
        "score": 60,
        "num_comments": 8,
        "created_utc": 1763926995.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p4vwzt/marketing_your_saas_from_0_to_5k_mrr_what/",
        "fetched_at": "2025-11-24T08:18:34.666293"
      },
      {
        "id": "1p4yo0a",
        "title": "Just hit $520 in revenue with 280 users! 🎉",
        "selftext": "Quick stats:\n\n* $520 total revenue (yes it's not $52k)\n* 280 users (58 paying users + 222 free users just trying out)\n* Still working hard to get organic traffic.\n* Fixed four bugs and one minor Quality-of-life feature that paying users requested\n\nNot much, but seeing people actually pay for what I built feels amazing.\n\nHere's the project if you want to check it out: [Vexly](https://vexly.app/)\n\nHow's everyone else doing?",
        "subreddit": "SaaS",
        "author": "Bubbly_Lack6366",
        "score": 53,
        "num_comments": 85,
        "created_utc": 1763933663.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p4yo0a/just_hit_520_in_revenue_with_280_users/",
        "fetched_at": "2025-11-24T08:18:34.666291"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 48,
        "num_comments": 50,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-11-24T08:18:40.165241"
      }
    ]
  }
}