{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-22T00:55:13.822844"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-22T00:55:04.944470"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-22T00:55:04.617165"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-22T00:55:04.617167"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-22T00:55:04.617150"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-22T00:55:04.944468"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-22T00:55:04.944475"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-22T00:55:04.944473"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-22T00:55:04.617172"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-22T00:55:04.944455"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-22T00:55:04.617169"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 486,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-22T00:55:12.821481"
      },
      {
        "id": "1p2ru91",
        "title": "TIL there’s a secretive 20-person VC firm that quietly backed SpaceX, Neuralink, xAI, and even the Twitter/X acquisition and they’ve beaten the S&P 500 for a decade.",
        "selftext": "I went down a rabbit hole on a firm called Vy Capital, and the deeper you look, the more surprising it gets. They operate with almost no visibility in the tech world, yet they’ve become one of Elon Musk’s biggest financial backers.\n\nWhat shocked me first was how small they are. \n\nVy runs with only four core investors and roughly twenty people across California, London and Dubai. Even with a team that small, they **manage around fifteen billion dollars and have delivered about twenty-eight per cent annual returns for ten years.** \n\nThat level of performance usually comes from giant firms, not a group this small.\n\nThe second surprising thing is how concentrated they are. Instead of spraying money across dozens of startups, they built their entire identity around backing Musk early and sticking with him for the long haul.\n\nSome of their biggest moves include:\n\n* Investing in SpaceX when it was valued at $15B (it’s now close to $400B) \n* Putting $700M into the Twitter acquisition \n* Taking large positions in Neuralink and xAI\n\nThere are estimates that more than half of Vy’s portfolio is now tied to companies Musk runs.\n\nThe final thing that stood out is how they think about building a firm. They aren’t trying to scale into a giant institution. They actually told their LPs recently that they won’t raise outside money anymore. After compounding billions, they want to invest their own capital instead, which is extremely rare in venture.\n\nAnd they’re not only focused on the US. They backed companies like Zomato and Urban Company in India, along with firms like Upgrade, Cerebras and Coalition.\n\nWhen you put it all together, Vy feels less like a traditional VC fund and more like a tight, high-trust investment group built around long-term conviction instead of chasing trends. Small team, deep focus, long holding periods and quiet execution.\n\nPretty unusual in today’s tech investment world.",
        "subreddit": "Entrepreneur",
        "author": "Product_guy21",
        "score": 441,
        "num_comments": 94,
        "created_utc": 1763708009.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p2ru91/til_theres_a_secretive_20person_vc_firm_that/",
        "fetched_at": "2025-11-22T00:55:05.739294"
      },
      {
        "id": "1p3cdwi",
        "title": "Being a entrepreneur - designing a site myself with control or finding trusted designers?",
        "selftext": "I started freelancing as a photographer in Austin last month and realized having a proper site is way more important than I thought since some of the commercial artists I know have websites. Word of mouth isn't cutting it for me . Spent hours googling \"small business designers” (forgot to include WEB , smh).. but reviews are all over the place it seems. Did anyone else have this problem when they were first getting set up? How did you finally decide which one to use?\n\nmaestrosites looks interesting but its trustpilot barely has any reviews. How do small business owners typically decide which web designer to use?",
        "subreddit": "Entrepreneur",
        "author": "BrainPuzzled9987",
        "score": 433,
        "num_comments": 10,
        "created_utc": 1763764060.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p3cdwi/being_a_entrepreneur_designing_a_site_myself_with/",
        "fetched_at": "2025-11-22T00:55:05.739292"
      },
      {
        "id": "1p2fl29",
        "title": "Finally hit $1mil ARR 🥳 I have no one to celebrate with. I will not promote.",
        "selftext": "It took me 10 years running my IT managed services business (8 employees) to finally hit this milestone. I avoid talking about business financials with friends or family as I don’t want to come across as bragging. I thought I’d share it here with the community though as a major milestone. If I could give 1 piece of advice: Luck is where persistence meets opportunity. Keep going and make adjustments along the way. Happy to answer questions if you have any. ",
        "subreddit": "Entrepreneur",
        "author": "CaptainPottyPants",
        "score": 294,
        "num_comments": 109,
        "created_utc": 1763673863.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p2fl29/finally_hit_1mil_arr_i_have_no_one_to_celebrate/",
        "fetched_at": "2025-11-22T00:55:05.739312"
      },
      {
        "id": "1p31e3z",
        "title": "Lost a client worth 30% of my revenue, then spotted him on Reddit DIY-ing the project",
        "selftext": "I run a small performance design studio and things are usually steady enough. Over the summer I picked up this new client who ended up becoming a pretty big part of my revenue. We were working on the branding stuff for his new business, the early stage bits, figuring out the look and feel and how he wanted the whole thing to show up.\n\nThen bad luck hit. I got slammed with this severe liver inflammation thing. The doctor told me to stay in bed for 2–3 weeks and cut my workload down so I could actually rest. I was upfront with my client about it, and he was super cool. I even managed to send small updates here and there so the project didn’t stall completely..\n\nBut after a point he just stopped replying. No “hey I need a break,” no “I’m rethinking things,” nothing. Two weeks go by. Nothing. I figured he was busy, but after the third week of being left on read, it hit me that the guy I thought was a long-term partner had just ghosted me without a word .\n\nFast forward to last week, I was scrolling through a business subreddit and saw a familiar brand name on my feed. It was him. He was asking for advice on his DIY branding and positioning assets he generated using some online tool. The stuff he posted was nothing like what he first told me he wanted. It honestly felt like he’d gone in the opposite direction overnight.\n\nTurns out some clients don’t tell you what’s bothering them. They’d rather ask the internet than have a simple five minute conversation.\n\nHas anyone else dealt with something like this or am I just catching weird luck lately ?",
        "subreddit": "smallbusiness",
        "author": "ikushch",
        "score": 289,
        "num_comments": 106,
        "created_utc": 1763738495.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p31e3z/lost_a_client_worth_30_of_my_revenue_then_spotted/",
        "fetched_at": "2025-11-22T00:55:11.112754"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 188,
        "num_comments": 133,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-22T00:55:12.821566"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 183,
        "num_comments": 35,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-22T00:55:12.821552"
      },
      {
        "id": "1p2cwu2",
        "title": "Am I paying too much for bookkeeping? $1000/month",
        "selftext": "We recently hired someone which we meet once a moth with & is helping us with the following:\n\n* Monthly bookkeeping \n* Reconciliation of bank and credit card statements \n* Preparation of monthly, quarterly, and annual financial statements \n* Coordination with your tax preparer, attorney, and/or insurance providers \n* Monthly financial strategy calls, including as needed guidance as new challenges arise \n\nIs $1000/month a decent deal or am I overpaying?\n\n",
        "subreddit": "smallbusiness",
        "author": "joeynev",
        "score": 151,
        "num_comments": 257,
        "created_utc": 1763667763.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p2cwu2/am_i_paying_too_much_for_bookkeeping_1000month/",
        "fetched_at": "2025-11-22T00:55:11.112787"
      },
      {
        "id": "1p2tcdk",
        "title": "In 2026, speed is the only moat left.",
        "selftext": "I am writing this because I believe the past few days represent another massive \"GPT moment.\"\n\nBetween the releases of Gemini 3, Nanobanana Pro, Antigravity, and Apple Mini Apps, the landscape has shifted. This isn't just fragmented tech news; it provides a clear direction for the market.\n\nFor the past two years, founders have leveraged AI models in two ways:\n\n1. **Thin Wrappers:** Often criticized, but undeniably successful when coupled with strong distribution.\n2. **Fat Wrappers:** Companies that handle end-to-end workflows, merging AI with human loop operations.\n\nHowever, looking ahead to 2026, I predict the term \"wrapper\" will become irrelevant. In a world where everything is a wrapper, the competitive advantage shifts entirely.\n\n**The new metric is speed.**\n\nThe question is no longer what you are building, but how fast you can ship it. With releases like Apple's Mini Apps, the ability to iterate is the only thing that matters. You must iterate until you find the right fit at the right time.",
        "subreddit": "SaaS",
        "author": "littitkit",
        "score": 126,
        "num_comments": 63,
        "created_utc": 1763713795.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p2tcdk/in_2026_speed_is_the_only_moat_left/",
        "fetched_at": "2025-11-22T00:55:07.502721"
      },
      {
        "id": "1p34f00",
        "title": "Competitor hired our best engineer. He quit after 3 months and asked for his old job back.",
        "selftext": "They offered him $40K more. I couldn't match it. He left. Hurt badly. He knew our entire system. Built half of our core features.\n\n3 months later: email. \"Any chance I could come back?\"\n\nTurns out the competitor is a mess:\n\n15-person eng team, but no clear roadmap\n\nMeetings about meetings\n\nEvery PR needs 4 approvals\n\nMicromanagement from a non-technical CEO\n\nHe said, \"I took the money but hated the work. I miss actually building things.\"\n\nI brought him back. Matched his new salary. We can afford it now.\n\nSometimes losing people is temporary. If your company culture is actually good, people figure it out.\n\nHas anyone else had someone leave and come back? Did you take them back?",
        "subreddit": "SaaS",
        "author": "AdSecret5838",
        "score": 88,
        "num_comments": 63,
        "created_utc": 1763745401.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p34f00/competitor_hired_our_best_engineer_he_quit_after/",
        "fetched_at": "2025-11-22T00:55:07.502716"
      }
    ]
  }
}