{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-17T08:18:46.987900"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-17T08:18:37.715581"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-11-17T08:18:37.715584"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-11-17T08:18:37.488946"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-17T08:18:37.488934"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-17T08:18:37.488917"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-17T08:18:37.715578"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-17T08:18:37.715582"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-17T08:18:37.488941"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-17T08:18:37.715567"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-17T08:18:37.488938"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 477,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-17T08:18:45.986470"
      },
      {
        "id": "1oyat5y",
        "title": "Photographers using my property. Am I crazy for finding this uncool?",
        "selftext": "\nSo I live on the coast in New England and about 5 years ago I bought a small fish house. Its a touristy area and we sell fresh fish to tourists/locals. Its right on the water with a long dock and very beautiful\n\nWord has been getting around and last summer we started noticing people hanging around that weren't customers. One of our employees pointed out a camera. That's when we noticed a photographer and a couple were using our private dock for a photo shoot. I didn't really think anything of it.\n\nIt kept happening but what bothered me was it seemed like the photographers were being underhanded. They never asked for permission and would even pretend to be paying customers. They would pretend to look at things and then head out back. \n\nThen more photographers started coming. We had entire families dressed up for a shoot. Apparently word got out how pretty this place was for family pictures.\n\nI said something to one of the photographers and got an earful about how it's a public business that anyone  can access. \n\nWhat are your thoughts on this? I dont want to be a hard ass but we aren't a huge operation and it's annoying as fuck to have all these extra people around not buying anything.",
        "subreddit": "smallbusiness",
        "author": "Comfortable_Dish5217",
        "score": 418,
        "num_comments": 243,
        "created_utc": 1763262387.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oyat5y/photographers_using_my_property_am_i_crazy_for/",
        "fetched_at": "2025-11-17T08:18:44.128651"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 184,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-17T08:18:45.986515"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 179,
        "num_comments": 34,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-17T08:18:45.986496"
      },
      {
        "id": "1oyg9re",
        "title": "We automated everything except the chaos",
        "selftext": "We’re 233 people across four countries. Payroll runs itself. Analytics too. Even onboarding emails. Everything’s automated except the part that touches real hardware.\n\nWhen someone joins, chaos starts. IT requests specs and procurement orders, HR fills out forms, and finance waits for invoices. When someone leaves, it’s worse. Laptops vanish, sit unopened, or never come back.\n\nAnd somehow I’m the one asking on Slack if anyone’s seen a MacBook from two months ago. I’m the CEO. I’m not supposed to be chasing laptops. How do you fix that?\n\n",
        "subreddit": "Entrepreneur",
        "author": "Apprehensive_Pay6141",
        "score": 109,
        "num_comments": 38,
        "created_utc": 1763280954.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oyg9re/we_automated_everything_except_the_chaos/",
        "fetched_at": "2025-11-17T08:18:38.395099"
      },
      {
        "id": "1oyu1ee",
        "title": "Just got laid off from a sales job. Feel quiet good actually.",
        "selftext": "I applied for a sales job for the sake of getting pay stubs to process papers for my wife.\n\nI got laid fired the 2nd week and now I was thinking of just fully committing to my business and getting it registered. I make 5 digits monthly from the two gigs and Im scaling them up to this day. The problem is the process for getting it registered is so quiet complicated. \n\nIts basically under the table and i have no proof of income coming from it. Cause I sell products in fb marketplace or through friends and network. I have coding background aswell. And i want to try something new. Got fired yesterday but im going to be celebrating tonight for reaching $500k earnings from my gigs. Im the only one who knows this and i just want to share it with strangers here in reddit.\n\nI cant share it with family or friends cause I feel like its wrong, its going to change my life and attitude for the worse because of pressure of trying to maintain my successful image , but at the same time i want to share my success or to brag maybe? Reddit became kind off my therapy and therapist.\n\nToday is a good day. I enjoyed the ferry ride and the scenery. Im gonna be trading some motherboards for PSUs and SSDs and once i come back home, im gonna say sorry to my wife and come clean. Have a good day fellas! \n\n",
        "subreddit": "Entrepreneur",
        "author": "papatender",
        "score": 62,
        "num_comments": 16,
        "created_utc": 1763319781.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oyu1ee/just_got_laid_off_from_a_sales_job_feel_quiet/",
        "fetched_at": "2025-11-17T08:18:38.395095"
      },
      {
        "id": "1oyjmjk",
        "title": "How I send 3,200+ cold emails per day (96,000+ per month) and still get replies in 2025",
        "selftext": "Most people think cold email is dead. They say it doesn’t work anymore, everything lands in spam, nobody replies. That’s completely false.\n\nIf you understand that you’re talking to humans, not inboxes, it still works incredibly well.\n\n96,000 emails means 96,000 people. If you spam them, you’ll get ignored. If you provide value, you’ll get conversations.\n\nHere’s exactly how I send 96K+ emails a month and what actually matters.  \n(If you don't like to read, I explain all the above in a video here : [https://youtu.be/dVeXUNverVs](https://youtu.be/dVeXUNverVs)\n\n1. Know your ICP Most people mess this up. They scrape random contacts from Apollo or Sales Navigator without filtering by country, language, or job relevance. If you write in English, target the US or UK. If not, always write in the native language of your audience. Relevance matters way more than volume.\n2. Set up your sending infrastructure To send cold emails at scale, you’ll need multiple domains and inboxes. With one domain, you can safely create 3 email addresses. Each can send about 30 emails per day, so roughly 90 per domain per day. If you want to send 3,000+ emails per day, you’ll need quite a few domains. I currently manage 170 inboxes. Warm them up for 15 days before sending anything. You can use a warm-up tool or buy pre-warmed inboxes. The warm-up process means your inboxes send and receive emails automatically for two weeks until they look “real” to email providers.\n3. Understand what your sending tool really does A cold email tool doesn’t send the emails itself. It just orchestrates the sending through your connected Gmail or Outlook inboxes. So when people say “this tool has better deliverability,” that’s mostly nonsense. Deliverability depends on your domains, setup, and content, not the platform. Also, never use your main domain, always use realistic addresses, and keep your domain reputation clean.\n4. Have a real offer that converts If your offer sucks, no amount of emails will fix that. You can have perfect targeting, perfect copy, and still get zero replies if nobody wants what you sell. Your product or service has to solve a real pain point.\n5. Build a simple, effective email sequence I use a 3-step flow. First email: ask for a demo or short call. Second email: share a free resource or guide. Third email: ask an open-ended question about their business. Keep it conversational and human. No salesy tone, no links, no tracking, text-based emails only.\n6. Get clean, verified leads You can scrape or buy databases, but always verify emails. Use a debouncer to avoid bounces or you’ll burn your domains fast. Duplicates are dangerous too. One month I realized a lead had received 8 of my emails from different lists. That’s how you end up in spam.\n7. Respond fast and personally Reply to every response within 12 hours, manually. Don’t use AI or templates. Even people who say no today can become clients later. I always add them on LinkedIn because they’re active people worth keeping in your network.\n8. Keep testing and monitoring deliverability Don’t track opens or clicks, it kills deliverability. Avoid spam words. If your emails start landing in spam, stop everything. Rewrite your sequence from scratch and restart clean.\n9. The biggest challenge is finding enough leads At 100K emails per month, your bottleneck isn’t sending, it’s data. You’ll need to constantly scrape, enrich, and clean new leads. The quality of your list is everything.\n\nThat’s it. This is the exact process I follow every month. It works, but only if you respect the fundamentals: real humans, real value, real offer.\n\nGood luck, and if you want the full breakdown with examples and setup details, I explain everything in my video as well.\n\nCheers !",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 62,
        "num_comments": 43,
        "created_utc": 1763293243.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1oyjmjk/how_i_send_3200_cold_emails_per_day_96000_per/",
        "fetched_at": "2025-11-17T08:18:40.273817"
      },
      {
        "id": "1o40fm7",
        "title": "As someone who works from home, how do you socialise? or meet new people/make friends?",
        "selftext": "I am working from home, a 27F. Honestly it gets boring and i dont have any friends in here in my hometown. I have lived in hostel since 15 and hence havent made any friends here.\n\nMy hometown is also not a lively place with meetups or activities happening, so it just becomes difficult for me.\n\nAny other way to socialise? maybe any online ways? Please suggest.\n\nUpvote1Downvote1Go to comments  \n",
        "subreddit": "freelance",
        "author": "This-Brief6214",
        "score": 62,
        "num_comments": 64,
        "created_utc": 1760201179.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o40fm7/as_someone_who_works_from_home_how_do_you/",
        "fetched_at": "2025-11-17T08:18:45.986531"
      },
      {
        "id": "1oyvw56",
        "title": "My AI saas failed after 7 months of work",
        "selftext": "I had an idea for an AI SaaS after I saw that about 70 million people search monthly for my topic. I built the product. I worked hard on design, user experience, and fine-tuning the model. I made a marketing plan and launched.\n\nResult at first: zero visitors, completely normal.\n\nI kept going. I worked on SEO. I made four TikTok reels per day, but my target users were not there. I switched to Instagram. I got more engagement, but still no real results.\n\nI tried Google Ads. The first ad campaign was banned. I opened a second account, fixed everything that could cause a ban, and it got banned again. I tried a third account and did not take it very seriously. That one was approved🙂. Still, the campaign did not bring the right users (not a serious campaign and low budget).\n\nI also tried social media campaigns. I posted AI videos, human videos, and memes... I used every tip I found online. The max views I got on a reel were 10k. Most comments were GIFs or random things.\n\nI worked on backlinks. I made a list of 100 sites where I could publish. I wrote many posts and blogs and shared them. Nothing moved. I tried X with four followers, so you can guess the result :)\n\nRight now I have about 100 registered users and around 3k visitors in total. I have zero revenue. I make updates every day to improve the model and SEO, and UX. Friends, volunteers, and testers tried it and gave positive feedback. It works for them. The problem seems to be visibility and finding the right users who are willing to pay.\n\nI am not writing this to discourage anyone from starting an AI SaaS. I am sharing the reality. Not every AI product makes millions of dollars in the first month. Sometimes you fail, and u need money or a strong base of followers or a community.\n\nI am not stopping. I will keep improving the site until it makes its first dollar. If it does not, I will move on when I find a better idea.",
        "subreddit": "SaaS",
        "author": "Ok-Snow-2462",
        "score": 57,
        "num_comments": 182,
        "created_utc": 1763324119.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1oyvw56/my_ai_saas_failed_after_7_months_of_work/",
        "fetched_at": "2025-11-17T08:18:40.273804"
      },
      {
        "id": "1oxokz2",
        "title": "What is your opinion on Peter Thiel's 7 investor questions in 2025? I will not promote",
        "selftext": "I think many of them still apply a lot to modern startups. Do you use these when thinking about startup ideas?  \nOr what are some other questions one should ask themselves?\n\nJust to summarize:\n\n* **The Engineering Question**: Can you create breakthrough technology instead of incremental improvements? This emphasizes developing something that's at least 10 times better than existing solutions to achieve true innovation.\n* **The Timing Question**: Is now the right time to start your business? Timing is crucial—being too early or too late can doom even great ideas, so assess why the present moment is ideal.\n* **The Monopoly Question**: Are you starting with a big share of a small market? Aim to dominate a niche first rather than competing in a large, crowded market from the outset.\n* **The People Question**: Do you have the right team? Success depends on assembling a capable, aligned group of people who can execute the vision effectively.\n* **The Distribution Question**: Do you have a way to not just create but also deliver your product? Even the best product fails without a strong sales and distribution strategy.\n* **The Durability Question**: Will your market position be defensible 10 to 20 years into the future? Consider barriers like network effects, proprietary tech, or branding that protect against competition long-term.\n* **The Secret Question**: Have you identified a unique opportunity that others don't see? Great companies are built on insights or \"secrets\" about the world that are hard to spot but true.",
        "subreddit": "startups",
        "author": "vire00",
        "score": 57,
        "num_comments": 40,
        "created_utc": 1763203115.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oxokz2/what_is_your_opinion_on_peter_thiels_7_investor/",
        "fetched_at": "2025-11-17T08:18:42.451844"
      }
    ]
  }
}