{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-26T08:17:53.052900"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-26T08:17:44.145567"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-12-26T08:17:44.145563"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-26T08:17:43.953191"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-26T08:17:43.953206"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-26T08:17:43.953204"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-26T08:17:44.145560"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-26T08:17:44.145565"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-12-26T08:17:43.953211"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-26T08:17:44.145548"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-26T08:17:43.953209"
      }
    ],
    "reddit": [
      {
        "id": "1puxm4i",
        "title": "My biggest competitor reached out to acquire me. The conversation taught me more about my business than 3 years of running it.",
        "selftext": "Got an email a few months ago. The CEO of my biggest competitor wanted to chat. Assumed it was a trick or a scouting mission. Took the call anyway out of curiosity. They wanted to buy me. Real offer. Real number. Not life-changing money but meaningful. I didn't take it. But the process of considering it taught me a ton. They asked questions I'd never asked myself. What percentage of customers actually use the core feature? What's the real competitive moat? How replaceable am I personally to the business? What would break if I disappeared? What assets transfer versus what's just me? Had to actually find the answers. Some were uncomfortable. The moat I thought existed basically didn't. Turns out competitors could rebuild my product in 3-4 months. The thing I thought was defensible was just a head start. My personal involvement was more central than I'd admitted. Relationships I had with key customers, knowledge in my head, reputation I'd built. The business without me was worth a lot less than I assumed. But I also discovered strengths I'd undersold. Customer retention was higher than I realized. A segment I thought was small was actually growing fast. The word of mouth in a specific niche was stronger than any marketing I'd done. The acquisition didn't happen but the clarity was worth more than the offer. Highly recommend pretending someone wants to buy you and asking yourself the hard questions. You'll learn a lot. What would you discover if someone tried to acquire you?",
        "subreddit": "SaaS",
        "author": "FlatGovernment6743",
        "score": 928,
        "num_comments": 100,
        "created_utc": 1766611133.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1puxm4i/my_biggest_competitor_reached_out_to_acquire_me/",
        "fetched_at": "2025-12-26T08:17:46.877230"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 490,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-26T08:17:52.051485"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 445,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-26T08:17:52.051527"
      },
      {
        "id": "1pv4kgk",
        "title": "A \"mentor\" was using me. Took 18 months to realize I was just deal flow for his fund.",
        "selftext": "Met this guy at a conference. Successful founder. Exited twice. Now angel investing. Offered to mentor me. I was flattered and grateful.\nFor 18 months I had monthly calls with him. Shared everything. My metrics, my struggles, my roadmap, my customer insights, my competitive analysis. He gave advice. Seemed helpful. I thought I was lucky to have access to someone with his experience.\nThen I noticed something. Every few months he'd ask if I knew other founders in my space. Said he wanted to \"help them too.\" I'd make introductions feeling good about connecting people.\nA founder I'd introduced him to reached out one day. Asked why I hadn't mentioned my mentor was an investor in their competitor. I had no idea what she was talking about.\nDid some digging. Over those 18 months he'd invested in three companies in my space. All introduced to him by me or discovered through our conversations. He had a complete map of my market, my weaknesses, where I was headed, what I was worried about. And he'd used it to inform his investments in my competitors.\nI felt sick. Every conversation replayed in my head. Every time I'd been open about a struggle, I was probably giving him information that helped him evaluate companies that would compete with me.\nWhen I confronted him he didn't even deny it. Just said \"that's how the game works\" and seemed confused why I was upset.\nMaybe I'm naive. Maybe this is normal. But I trusted someone who was extracting value while pretending to give it.\nNow I'm much more careful about mentors who are also investors. The incentives aren't always aligned.\nAnyone else been burned by a mentor?\n",
        "subreddit": "SaaS",
        "author": "Bulky-Economy-6746",
        "score": 224,
        "num_comments": 69,
        "created_utc": 1766634515.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pv4kgk/a_mentor_was_using_me_took_18_months_to_realize_i/",
        "fetched_at": "2025-12-26T08:17:46.877236"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 162,
        "num_comments": 39,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2025-12-26T08:17:52.051506"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 149,
        "num_comments": 62,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2025-12-26T08:17:52.051504"
      },
      {
        "id": "1pvx3tl",
        "title": "Hit 1M ARR yesterday- everyone is lying to you",
        "selftext": "Hey everyone, this post is going to trigger a lot of folks.\n\nI joined reddit 4 years back started following these different saas startups threads hoping to get some value. \n\nI started following all the constant advice - Build in public, Post about your startup on reddit, cold messaging. Everyone is lying here and they know it.\n\nI wasted 3 FUCKING YEARS of my life building businesses out of taking these suggestions and made $740 in 3 years. Then last year I met a founder backed by a16z who is running a 7M ARR company today. His advice changed everything for me.\n\nAnd I am going to share it because IT IS NO DAMN SECRET! Everyone outside of reddit who has ever built a real business knows these things!!!!\n\n1. Don't fucking re-invent the wheel. Just fucking copy what already is selling in market.\n\n2. Your product features mean shit if no one has ever looked at your product \n\n3. Don't waste your time doing product hunt launches and all the other retarded sites to launch your product. Its a trophy that no one gives a shit about.\n\n\nNow coming to the real deal\n\n1. Homepage matters much more than your actual website. Clear CTAs creating urgency and solving one and only one problem no confusion should be there. Best AI to make home page - \"Figma Make\" dont waste your time finding anything else. I have tested all of them for months. \n\nExample of homepage title \"Get 10x leads from X\"\n\n2. Never do cold emailing, IT NEVER works. Do linkedin outreach much much higher chances of working. Best and cheapest tool - \"linkedHelper\"\n\n3. Stop trying to build your audience and go VIRAL on linkedin twitter X or whatever fucking platform. If you want to build a company 20 years later then sure go ahead\n\n4. Just fucking run Ads, whatever 5k USD you were going to waste in the next 6 months fucking around with ZERO results put all that money and run FUCKING Ads.\n\n5. Unless really irrelevant, for most businesses ONLY run META ads. If your saas is complex and mostly for enterprises etc then run google search ads.\n\n6. META has fucked the platform and now static ads dont work you need only UGC. And please dont ever try AI UGC all those tools out there will generate you ZERO clicks from AI video ads.\n\n7. Get atleast 50-60 UGC pieces from real ugc creators. cheapest website to get UGC - bulba.app\n\n8. Take the UGC and run ads on those. dont EVER try to run ada yourself. Just hire some freelancer from india/philippines from upwork but with really good rating and past work. Don't fall into any agency trap. Always independent. They will do it even for $500.\n\n9. If you product is in $20-50/month range your flow should be signup -> 1 week free trial (with card) -> conversion.\nIf its $100+ then signup -> book demo -> 1 conversion. Only offer free trial for people who ask for that on the call. \n\n10. Then track conversion and drop rates in each stage and try to optimise to finally get a better ROAS.\n\n\nTHATS IT! and people who have done it know that this is how you build a business. And they are mostly not on reddit!\n\nBYE!",
        "subreddit": "SaaS",
        "author": "Any_Database1735",
        "score": 137,
        "num_comments": 82,
        "created_utc": 1766728824.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pvx3tl/hit_1m_arr_yesterday_everyone_is_lying_to_you/",
        "fetched_at": "2025-12-26T08:17:46.877224"
      },
      {
        "id": "1pvgpc5",
        "title": "What business were you part of or saw first hand that made an absolute killing ?",
        "selftext": "I early in my career was part of a tire recycling business, they would charge tire shops and dealerships to pick up their tires $1-$2 each. The company would when extract all the metal from the tires sell that and the rubber too every tire was leaving  a $3-4 profit. We would process 85,000 tires a month. Owner was in a car accident and was not able to keep working so it all closed down, they guy that bought him out now processed 3 million tires last year.",
        "subreddit": "smallbusiness",
        "author": "Stablegeniousatwork",
        "score": 124,
        "num_comments": 66,
        "created_utc": 1766679567.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pvgpc5/what_business_were_you_part_of_or_saw_first_hand/",
        "fetched_at": "2025-12-26T08:17:50.126244"
      },
      {
        "id": "1pvfehq",
        "title": "Why So Many Young People Feel Lost in a World That Never Stops Pushing",
        "selftext": "If you are in your late teens or early twenties, chances are you have felt it: a quiet but persistent sense that life is slipping by without real direction. You have ambitions like achieving financial freedom, building a family one day, giving back through charity, or simply having deep, reliable friendships. But somehow, the drive to make those things happen fades quickly. Motivation comes in waves, and the only time you feel truly alive and excited is during short escapes that leave you emptier afterward. You know you should get serious, start building habits, and chase what matters, but purpose feels out of reach. You are not alone in this. Millions of young people today wrestle with the same emptiness, and there is a clear reason why it has become so common.\n\nSomething fundamental changed around the early 2000s. Before that time, most people discovered their interests through living. You would go out into the world, experience something directly, feel a spark of curiosity, and then actively seek out more information using whatever tools existed. Schools, conversations with mentors, libraries, trial and error. Your path felt self-directed because it grew naturally from your own encounters and choices. You ended up where you were because you chose to go there.\n\nToday the flow runs in the opposite direction. Information floods toward you constantly through phones and screens, carefully selected and pushed by algorithms, companies, and hidden agendas. Interests are handed to you ready-made instead of discovered through experience. Attention gets captured before you even decide what you care about. Over time, this reverses the natural order: curated content shapes your desires, pulls your focus outward, and leaves you in a life that often feels like it belongs to someone else. The constant noise drowns out your own voice, making it hard to know what you truly want or why anything matters.\n\nThis reversal explains the widespread feeling of being stuck. When everything competes for your attention, nothing feels worth giving it to. Quick dopamine hits from scrolling, gaming, or other escapes become the only reliable source of excitement because they are designed to deliver instant reward. Meanwhile, the slower rewards of building skills, relationships, or long-term goals feel distant and uncertain. Purpose requires space, reflection, and ownership, but the modern environment leaves little room for any of those.\n\nThe way out starts with reclaiming control, one small step at a time. Begin by creating quiet moments each day to listen to yourself. Ask basic questions: What activities absorb me completely? What kind of person do I respect and want to become? Write the answers down honestly. This simple habit cuts through the external chatter and helps you reconnect with your inner direction.\n\nFrom there, pick one small action that moves you toward a goal you care about and do it daily. Ten minutes of reading about money management if financial freedom matters to you. A short walk or workout if you want to feel stronger. Consistency builds momentum far better than occasional bursts of effort. When distractions pull you away, notice it without harsh judgment and gently return to what you chose.\n\nSeek real-world connections that support growth. Join groups, clubs, or online communities built around shared interests. Show up as yourself, contribute, and listen. Authentic friendships and mentors appear when you engage steadily over time, not when you chase quick bonds.\n\nIf excitement only shows up in unhealthy ways right now, experiment with healthier sources. Try physical challenges, creative outlets, volunteering, or time in nature. These activities can awaken the same energy in sustainable forms.\n\nHelpful starting points include books such as Atomic Habits by James Clear for building reliable routines, or Man's Search for Meaning by Viktor Frankl for understanding purpose in difficult seasons. Free courses on platforms like Coursera or Khan Academy let you explore skills without pressure. Mindfulness apps can train your mind to stay present amid the noise.\n\nProgress will feel slow at first, and that is normal. Be patient as you rebuild the habit of directing your own life. By stepping away from endless feeds and toward deliberate choices, you create space for genuine meaning to emerge. Many have walked this path before you and found their way forward. You can too. The life you actually want is still within reach, waiting for you to start choosing it.",
        "subreddit": "Entrepreneur",
        "author": "PracticalStoicUS",
        "score": 109,
        "num_comments": 26,
        "created_utc": 1766675766.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pvfehq/why_so_many_young_people_feel_lost_in_a_world/",
        "fetched_at": "2025-12-26T08:17:44.897060"
      },
      {
        "id": "1pvg5a4",
        "title": "Struggling with bulk buying",
        "selftext": "I've been trying to scale my reselling business and decided to start bulk buying some electronics accessories to get better margins. I figured it'd be easier than hunting thrift stores every weekend. Half the sellers dont even have accurate inventory counts. I placed an order for 50 phone cases last month and the guy messages me 3 days later saying he only has 38 left. Then I had to wait another week for a partial refund because apparently thats just how it works. Second issue is quality control is basically nonexistent when buying in bulk. I ordered what was supposed to be brand new chargers and when I got them half had scratches and looked like returns.  Theres no way to see all the variants side by side or check all the product photos in one view so Im literally opening like 15 tabs trying to figure out which supplier has the best deal. Sometimes items are already sold out by the time I decide and I cant even buy directly through any kind of bulk ordering system, its just regular checkout which is annoying when youre trying to move fast. Would love to hear if anyone cracked this.",
        "subreddit": "Entrepreneur",
        "author": "Fit_Phrase_8491",
        "score": 100,
        "num_comments": 17,
        "created_utc": 1766677986.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pvg5a4/struggling_with_bulk_buying/",
        "fetched_at": "2025-12-26T08:17:44.897058"
      }
    ]
  }
}