{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-16T08:16:41.935932"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-16T08:16:34.454905"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-16T08:16:34.111152"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-16T08:16:34.111144"
      },
      {
        "videoId": "itpCtsopKTI",
        "title": "Bookkeeping Basics for Small Business Owners (free template!)",
        "description": "Start using Melio for FREE at https://go.melio.com/gillian You can download the Google Sheets template I'm using in this video ...",
        "channelTitle": "Gillian Perkins",
        "publishedAt": "2023-08-01T15:00:40Z",
        "url": "https://www.youtube.com/watch?v=itpCtsopKTI",
        "fetched_at": "2025-09-16T08:16:34.454908"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-16T08:16:34.111134"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-16T08:16:34.454903"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-16T08:16:34.454906"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-16T08:16:34.111149"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-16T08:16:34.454892"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-16T08:16:34.111150"
      }
    ],
    "reddit": [
      {
        "id": "1ngzfhh",
        "title": "I recently sold my company for $600K. AMA!",
        "selftext": "If my post inspires a single person to pursue their idea, then my work here is done. AMA!\n\nI started a logistics compliance SaaS business & sold it to one of my clients. I made 2-300K during the course of the 5 years I ran the business, and then the $600K from the sale.\n\nWill not promote!",
        "subreddit": "Entrepreneur",
        "author": "globetrotter_001",
        "score": 624,
        "num_comments": 169,
        "created_utc": 1757875824.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ngzfhh/i_recently_sold_my_company_for_600k_ama/",
        "fetched_at": "2025-09-16T08:16:34.905220"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 451,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-16T08:16:40.934522"
      },
      {
        "id": "1nhuihz",
        "title": "My app makes $00k/mo and I haven’t told my family",
        "selftext": "Hi guys, 2 months ago I launched [crapboard.com](https://crapboard.com)\n\nfocused on bad ideas that I had been working really hard on.\n\nIt started out with me just being annoyed by social media so I created a solution I thought was worse\n\nIt got a bit of traction but nothing huge, around 1 months in it was doing $0k/mo. I talked to my family about it and they were supportive of course but as you can imagine not super impressed. You know how it is.\n\nAnyway, I’ve been grinding for another 1 months now and have made some bad product decisions, ignored feedback from customers, and shaped up my marketing. I don’t know what happened this summer but I got busy as heck and now I just closed August at $00k/mo. It’s kinda hitting me now that I’m actually making really bad money and I haven’t told my family or anyone.\n\nI was waiting for this moment for months and now that it’s finally here I don’t know if it’s even time yet…\n\nShould I tell them? How much do you share with your friends and family?",
        "subreddit": "SaaS",
        "author": "streetmeat4cheap",
        "score": 193,
        "num_comments": 65,
        "created_utc": 1757962267.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nhuihz/my_app_makes_00kmo_and_i_havent_told_my_family/",
        "fetched_at": "2025-09-16T08:16:36.775831"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 149,
        "num_comments": 176,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-16T08:16:40.934583"
      },
      {
        "id": "1nhjd35",
        "title": "Pitch ur startup in 1 line",
        "selftext": "Yo, let’s make this fun. Drop your idea in the comments and try to keep it to one line max. Everyone else can rate it, roast it, or drop feedback. Keeps it clean, keeps it spicy. (don’t directly sponsor your product since you will be banned)\n\nI’ll go first:  \nTikTok-style 2–3 min swipeable lessons for life skills like confidence, focus, relationships. Micro-courses that feel bingeable but make u smarter instead of addicted.\n\nYour turn 👇 \\[edit: do upvote also, if you are commenting and promoting, when i told not to\\]",
        "subreddit": "SaaS",
        "author": "mindsnackapp",
        "score": 135,
        "num_comments": 394,
        "created_utc": 1757936103.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nhjd35/pitch_ur_startup_in_1_line/",
        "fetched_at": "2025-09-16T08:16:36.775855"
      },
      {
        "id": "1nhin7z",
        "title": "For small business owners: what’s been your most surprising ROI from a “tiny” change?",
        "selftext": "I’ve noticed again and again that some of the highest ROI changes in small businesses don’t come from big marketing campaigns or huge investments, but from small details that compound.\n\nExample 1: A local coffee shop started writing each customer’s name with a short note on their loyalty card. It cost them a few seconds and a pen, but they told me repeat visits went up so much that it became part of their brand identity. People literally posted their cards on Instagram.\n\nExample 2: An ecommerce shop I worked with stopped giving the same blanket 10% discount to everyone. Instead, they adjusted discounts based on product margins. High-margin products got 15% off, low-margin ones got nothing. Profit margins went up and recovery rates improved at the same time, which was the opposite of what they expected.\n\nExample 3: A small home services business added a simple follow-up SMS for every missed call: “Sorry we missed you, how can we help?” It felt boring at first, but within a month they’d booked dozens of jobs they were previously losing because no one bothered to leave voicemails.\n\nNone of these required new staff, fancy tools, or ad spend. Just small tweaks that made a big difference.\n\nI’m curious to hear from this community.   \nAs a small business owner, what’s the smallest change you’ve made that had the biggest impact on your revenue, retention, or day-to-day operations?",
        "subreddit": "smallbusiness",
        "author": "LionAny6818",
        "score": 128,
        "num_comments": 62,
        "created_utc": 1757933776.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nhin7z/for_small_business_owners_whats_been_your_most/",
        "fetched_at": "2025-09-16T08:16:39.549004"
      },
      {
        "id": "1nhq8bf",
        "title": "Am I just bad at this or is founder life actually impossible??  \"i will not promote\"",
        "selftext": "i'm about 18 months into my startup and i feel like i'm drowning every single day. i genuinely can't keep up with all the random shit that needs to get done. my typical day: answer slack messages, put out fires, realize i forgot to invoice someone from last month, deal with a customer complaint, try to work on actual product development for maybe 30 mins before another crisis hits. by the end of the day i'm fried and i haven't accomplished anything that actually moves the business forward.\n\nthe weird part is i LOVE the vision. i love building something new and solving big problems. but 90% of my time is spent on administrative bullshit. i see other founders posting about their wins on twitter and linkedin and i'm over here like... how tf do you people have time to even think strategically?? am i just terrible at this or is everyone else faking it til they make it too?? thinking about hiring help but also feels like admitting defeat. shouldn't i be able to handle this myself?",
        "subreddit": "startups",
        "author": "Lettil96",
        "score": 118,
        "num_comments": 50,
        "created_utc": 1757952858.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nhq8bf/am_i_just_bad_at_this_or_is_founder_life_actually/",
        "fetched_at": "2025-09-16T08:16:38.197619"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 114,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-16T08:16:40.934587"
      },
      {
        "id": "1nhjhwn",
        "title": "In less than 72 hours, I managed to rank at the very top of ChatGPT results for my niche.",
        "selftext": "And I didn’t need complicated funnels, backlinks, or ads, just a simple Reddit post.\n\nMost marketers are still focused on Google SEO…\n\n But they’re overlooking a massive traffic source that’s right in front of us:\n\nAI-generated answers.\n\nWith 180M+ people asking ChatGPT questions every day, getting your content referenced by LLMs is the new frontier.\n\nI put together a Reddit strategy that makes your posts show up consistently in AI outputs.\n\nHere’s what I break down inside the guide:\n\n\\- The post format that boosts LLM visibility\n\n\\- A posting rhythm that maximizes indexing\n\n\\- The subreddits where ChatGPT pulls the most content\n\n\\- Why old-school SEO tactics don’t translate to LLM rankings\n\nBy applying this system, I was able to:\n\n\n\n\\- Reach the #1 spot for my main keyword in 3 days for my SAAS GojiberryAI\n\n\\- Capture ongoing traffic straight from AI responses\n\n\\- Outpace competitors pouring money into traditional SEO\n\nHere is the guide : [https://www.notion.so/The-Reddit-LLM-SEO-Framework-26ab9abcbe3f80e19060e679e317e5df?source=copy\\_link](https://www.notion.so/The-Reddit-LLM-SEO-Framework-26ab9abcbe3f80e19060e679e317e5df?source=copy_link) \n\nCheers ",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 104,
        "num_comments": 40,
        "created_utc": 1757936518.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nhjhwn/in_less_than_72_hours_i_managed_to_rank_at_the/",
        "fetched_at": "2025-09-16T08:16:36.775859"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 97,
        "num_comments": 58,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-16T08:16:40.934567"
      }
    ]
  }
}