{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-05T08:13:42.475416"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-05T08:13:33.405922"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-05T08:13:33.405924"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-05T08:13:33.153727"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-05T08:13:33.153732"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-05T08:13:33.153713"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-05T08:13:33.405917"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-05T08:13:33.405919"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-05T08:13:33.153729"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-05T08:13:33.405905"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-05T08:13:33.153731"
      }
    ],
    "reddit": [
      {
        "id": "1nx6kxx",
        "title": "My SaaS was used for p*rn and now it makes $3k/month",
        "selftext": "Hey everyone!\n\nAbout 1 year ago I launched [my app](https://usevoicy.com/) as a chrome extension on the Chrome Web Store.  \nIt quickly reached 1k free users within a month, and the usage was through the roof.\n\nI use the WhisperAPI and my costs went from 0 to $5-10 dollars per day. This wasn't sustainable for me of course, so I decided to monetize.  \nI wanted to know the ICP and the perfect use-cases, so I implemented a system that lets me know on which websites my app is being used.\n\n(I can't read any transcripts or see which user uses which website)\n\nTurns out - it was mostly used on AI girlfriend chats and weird websites where men are scammed by fake women.\n\nI originally built the app to help people who struggle with typing. Turns out if you're talking to your AI girlfriend, you only have 1 hand to type. FAIR ENOUGH HONESTLY\n\nSo I monetized it, and guess what - I only got signups from people using it for work and serious writing.\n\nAfter I introduced limits the p\\*rn usage dropped hard too.\n\nI posted this on reddit a while ago and people told me I should lean into it. But I decided not to do it.\n\nI blocked ALL scammy websites where people are being tricked, but I left the AI girlfriend pages available. I just didn't do anything about it.\n\nInstead, I focused on my paying users and their specific needs. They wanted to use my tool in Microsoft Word, ChatGPT, Google Docs, etc. So I created a landing page for each of these use-cases.  \nIf you go on my website you can see I have about 20 specific landing pages.\n\nSEO kicked in within weeks and started ramping up proper sales.  \nI also leaned in harder into the disability use case and offer 20% off for everyone who struggles with typing.  \nThis has been WAY more fulfilling than helping people c\\*m.\n\nNow I just closed my best month with [$3k in revenue](https://x.com/BuildingWaves/status/1973302398031368333) and a set of users who are really my perfect customer profile.\n\nNo lesson in here, but thought it would be fun to share!\n\n  \nEdit: Added [proof](https://x.com/BuildingWaves/status/1973302398031368333) because people were getting angry at me. ",
        "subreddit": "SaaS",
        "author": "Kghaffari_Waves",
        "score": 914,
        "num_comments": 144,
        "created_utc": 1759514872.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nx6kxx/my_saas_was_used_for_prn_and_now_it_makes_3kmonth/",
        "fetched_at": "2025-10-05T08:13:36.279540"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 462,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-05T08:13:41.473990"
      },
      {
        "id": "1nwkp7n",
        "title": "How I attracted 3 VCs in 6 hours while developing my startup, which I will not promote",
        "selftext": "I arrived in SF three days ago and wanted to test a build in public experiment. Like really in public, in a cafe. I sat at Blue Bottle from 7am to 1pm with a sign on my laptop that read “coffee on me for valuable feedback.” It worked, people smiled, and I met a lot of interesting folks, including investors and founders. I have a post from this morning with an image of how it looked, I can share if you ask for it, I cannot attach it here. This is what I learned:\n\n**Timeline:**\n\n* 7:00 to 9:00 quiet time, a few good chats\n* around 9:00 biggest rush, I could not keep up with follow-ups and quick demos\n* 10:45 to 12:15 dead time\n* 12:15 to 13:00 rush again\n* left at 13:00 when the battery died\n\n**Numbers:**\n\n* 121 people looked at the sign, only the ones I noticed and counted. Possibly it was 2 to 3 times higher.\n* 17 conversations, about 25 people total since some came in pairs\n* 14 new LinkedIn and Twitter connections\n* 3 VCs connections\n* 3 founder connections\n* 0 coffees bought by me\n\n**Conversion**\n\n17 conversations out of 121 sign views, about 14 percent. I likely missed many glances, if real views were closer to twice that, call it around 7 to 8 percent. Also, it helps if you notice and start the conversation first, then people approach you. I think 3 VCs is very good number. will see how it goes from here.\n\nWhat it felt like in practice, I was sitting on the other side of the register, facing it, so many people ordered first, then while they waited for their coffee, they noticed the sign and maybe we talked. Lots of mobile pickup, many did not stop. Sign placement was not ideal, you had to turn from the deck to see it, but it was still the best seat I could get. Net result, it was a very productive time, even though actual coding was tough during the rush. If you try this, please buy something from the cafe, and if you stay long, consider buying more than once. I asked the staff if the sign was okay, and they said it was totally fine, so big thanks to this cafe.\n\nNow I am at home to keep building my startup. Good luck to anyone building or fundraising out there!\n\n\n\nWhat else should I try next time?",
        "subreddit": "startups",
        "author": "_s0uthpaw_",
        "score": 361,
        "num_comments": 107,
        "created_utc": 1759450994.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nwkp7n/how_i_attracted_3_vcs_in_6_hours_while_developing/",
        "fetched_at": "2025-10-05T08:13:38.064469"
      },
      {
        "id": "1nxsiwd",
        "title": "The company is dying, I will not promote",
        "selftext": "Joined a small company as a tech lead half a year before. There is a product that solves a real problem, there are contracts in the field. Found myself in a hot pan. The founders conflicted with the CTO, who built the company, then forced her out. New junior devs were hired, more financing was promised. After two months the salary stopped arriving. Founders conflicted, one of them left the company. Now the only remaining investor has cut out the money. The clients do not want to pay. I started looking for jobs but the market is dry. Just venting out.",
        "subreddit": "startups",
        "author": "Live-Conversation-49",
        "score": 214,
        "num_comments": 81,
        "created_utc": 1759580504.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nxsiwd/the_company_is_dying_i_will_not_promote/",
        "fetched_at": "2025-10-05T08:13:38.064425"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 171,
        "num_comments": 46,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-05T08:13:41.474022"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 159,
        "num_comments": 50,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-05T08:13:41.474012"
      },
      {
        "id": "1nxs1dk",
        "title": "Sick of banks/credit unions treating me like dirt for being self employed.",
        "selftext": "Why do lending institutions look down upon the self employed? \n\nSure, I guess if you make $500,000/yr, different ball of wax. I'm talking about sole props that take home 40-100k a year.\n\nThe consensus among them seems to be that being self employed is somehow \"riskier\" than being employed.\n\nBut even if you have been in business 10 years and have proven successful, you are still seen as risky.\n\nThe other thing that irritates me is they all want to go off your tax returns and not your bank statements.\n\nA lot of things are legally written off. Mileage, cost of goods, you name it. Some of these are expenses, some aren't.\n\nIf regularly employed folks were allowed to deduct their meals, mileage, cell phone bill, work uniforms, etc then their income would appear lower as well.  \n\nBut they still only look at adjusted gross income or AGI. \n\nEven if you made $70,000 and only had $20,000 in actual expenses, but legally wrote off another $30k in deductions (just an example), your AGI is only $20,000 which isn't very much.\n\nIf you took home $70k working for a company, but spent $20k on travel expenses, mileage, meals, cell phone, internet, uniforms, work shoes, tools, you name it, the bank STILL only looks at that $70k figure.\n\nHow on earth is that fair? \n\n\n\n\n\n\n\n\n\n\n\n",
        "subreddit": "smallbusiness",
        "author": "ToshPointNo",
        "score": 152,
        "num_comments": 126,
        "created_utc": 1759579069.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nxs1dk/sick_of_bankscredit_unions_treating_me_like_dirt/",
        "fetched_at": "2025-10-05T08:13:39.676114"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 151,
        "num_comments": 179,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-05T08:13:41.474059"
      },
      {
        "id": "1nxt90x",
        "title": "After building 17+ MVPs, here's the tech stack we use for 90% of projects",
        "selftext": "**After building 17+ MVPs, here's the tech stack we use for 90% of projects:** \n\n(And why most founders are overthinking it) \n\n**The Boring Stack That Makes Money:**\n\n* Frontend: Next.js \n* Backend: Supabase \n* Payments: Stripe \n* Hosting: Vercel \n* Email: Resend \n* Analytics: PostHog\n\nCost: $86/month \n\nSetup time: 2 hours \n\nScales to: Millions \n\n**What we DON'T use for MVPs:** \n\n❌ Microservices (you're not Netflix)   \n❌ Kubernetes (you have 10 users, not 10 million)   \n❌ Redis (PostgreSQL is fast enough)   \n❌ React Native (PWA works fine)   \n❌ TypeScript (controversial: JS for speed, TS for scale)   \n\n\n**Real client results with this \"basic\" stack:** \n\nJake Thompson (3D Omega):\n\n1,000+ businesses 5,000+ artists $32K MRR Still on the $86/month stack\n\nEmily Parker:\n\n40% conversion rate 3x faster than previous build 94% customer satisfaction Zero scaling issues\n\n  \n**The expensive lesson:** \n\n\\- We had a client who insisted on \"enterprise architecture.\"   \n\\- Microservices. GraphQL. The works.   \n\\- 8 months. $100K. Never launched. \n\nTheir competitor used our boring stack.   \n\\- 6 weeks. $3.5K. Now at $50K MRR. \n\n  \n**Your tech stack doesn't matter if you have no users.** \n\nInstagram scaled to 1 billion on 13 engineers.   \nWhatsApp supported 900 million users with 50 engineers.   \n  \nYou're not Instagram. Use boring technology.   \n  \n**The One Rule:** Can you explain your stack in 30 seconds? If not, it's too complex for an MVP.   \n  \n**Our stack explanation:** \"Next.js for the app, Supabase for data, Stripe for payments. Done.\"   \n  \nThat's it. That's the stack generating millions in client revenue.   \n  \nStop debating React vs Vue.   \nStop optimizing for problems you don't have.   \nStop architecting for scale you haven't earned.   \n  \nShip something people pay for.   \nThen worry about the tech.   \n  \nWhat part of your stack could you delete today?",
        "subreddit": "SaaS",
        "author": "d_sourav155",
        "score": 136,
        "num_comments": 89,
        "created_utc": 1759582518.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nxt90x/after_building_17_mvps_heres_the_tech_stack_we/",
        "fetched_at": "2025-10-05T08:13:36.279513"
      },
      {
        "id": "1ny4skt",
        "title": "Our competitor’s CEO just signed up on our website💀",
        "selftext": "So we’re sitting there, going through our new signups and sending out early-bird discounts like usual.\nThen my boss said \n\n“Hey… check this email out\n\nAt first, it looked like a totally normal signup.\nBut the email was kinda… suspicious something like jojoperson123@gmail.com.\n\nAnd here’s the best part: the fake email actually had a display picture. 💀\n\nWe both laughed, but then I noticed the face looked oddly familiar.\nSo I zoom in.\nThen I Google the name.\n\nAnd yep turns out it’s the CEO of one of our biggest competitors.\nLike, an actual well-known company.\n\nMy boss and I just stared at the screen in silence for a good ten seconds.\nBro didn’t even try to go full undercover just vibes, curiosity, and a fake Gmail.\n\nAt this point, we’re not even mad. We’re flattered.\nIf even our biggest competitor’s CEO is curious enough to sneak in…\nyeah, I think it’s safe to say we’re building something pretty damn good 😎\n\nStartup life: one day you’re fixing bugs, the next you’re onboarding your rival’s CEO.",
        "subreddit": "SaaS",
        "author": "Zealousideal_Self678",
        "score": 131,
        "num_comments": 61,
        "created_utc": 1759610182.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ny4skt/our_competitors_ceo_just_signed_up_on_our_website/",
        "fetched_at": "2025-10-05T08:13:36.279507"
      }
    ]
  }
}