{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-27T08:18:25.358820"
  },
  "data": {
    "youtube": [
      {
        "videoId": "Q1tCEvqakUo",
        "title": "Fastest Editing Workflow in DaVinci Resolve! - Perfect for Tutorials and How To Vids!",
        "description": "Get the FREE practice media here: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2025-10-14T14:00:41Z",
        "url": "https://www.youtube.com/watch?v=Q1tCEvqakUo",
        "fetched_at": "2025-11-27T08:18:15.778987"
      },
      {
        "videoId": "_XySZQrHPCE",
        "title": "Steal This Easy Vlog Editing Workflow, It&#39;ll Simplify Everything",
        "description": "Get 2 extra months free on an annual plan from Motion Array https://geni.us/tEEoIY 🎞️ New to video editing? Learn the ...",
        "channelTitle": "Tamara Gabriel",
        "publishedAt": "2025-07-18T11:18:22Z",
        "url": "https://www.youtube.com/watch?v=_XySZQrHPCE",
        "fetched_at": "2025-11-27T08:18:15.779000"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-27T08:18:16.202697"
      },
      {
        "videoId": "mjiT0g3mYgw",
        "title": "9 Editing Tips To Save HOURS in DaVinci Resolve!",
        "description": "9 Editing Tips in DaVinci Resolve you probably didn't know! In this DaVinci Resolve tutorial, I'm going to show you 9 powerful ...",
        "channelTitle": "Sightseeing Stan",
        "publishedAt": "2025-05-26T14:01:15Z",
        "url": "https://www.youtube.com/watch?v=mjiT0g3mYgw",
        "fetched_at": "2025-11-27T08:18:15.778993"
      },
      {
        "videoId": "NIf8S185ONk",
        "title": "The iPad Pro is Ready for Video Editing",
        "description": "using the iPad Pro and speed editor with Davinci Resolve to edit and color grade an entire video for YouTube. iPad Pro M4 13” ...",
        "channelTitle": "Tommirock",
        "publishedAt": "2025-05-16T22:50:24Z",
        "url": "https://www.youtube.com/watch?v=NIf8S185ONk",
        "fetched_at": "2025-11-27T08:18:15.779006"
      },
      {
        "videoId": "8MQfZTjbvPw",
        "title": "🔥 This FREE plugin will change your video editing workflow FOREVER!",
        "description": "Say hello to Premiere Composer, packed with transitions, sound effects, and motion graphics #videoeditingtips #premierepro ...",
        "channelTitle": "Sebastien Jefferies",
        "publishedAt": "2025-04-15T17:21:05Z",
        "url": "https://www.youtube.com/watch?v=8MQfZTjbvPw",
        "fetched_at": "2025-11-27T08:18:15.779002"
      },
      {
        "videoId": "6SadD5fbneQ",
        "title": "My Editing Workflow (End to End for a Simple Video)",
        "description": "Quite a few people have asked me to describe my end-to-end workflow for editing videos; here it is (for the simplest kind of video ...",
        "channelTitle": "Atomic Shrimp",
        "publishedAt": "2025-03-01T08:00:04Z",
        "url": "https://www.youtube.com/watch?v=6SadD5fbneQ",
        "fetched_at": "2025-11-27T08:18:15.778982"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-27T08:18:15.778964"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-11-27T08:18:15.778972"
      },
      {
        "videoId": "QIJPxeI--QQ",
        "title": "Effective Editing Workflow that can save you hours! Davinci Resolve Beginner Tips",
        "description": "Download the HeartSupport Media files here: https://www.groundcontrol.film/heartsupport And you can download my Keyboard ...",
        "channelTitle": "MrAlexTech",
        "publishedAt": "2024-05-27T22:41:51Z",
        "url": "https://www.youtube.com/watch?v=QIJPxeI--QQ",
        "fetched_at": "2025-11-27T08:18:15.778991"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 489,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-27T08:18:24.357442"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 213,
        "num_comments": 74,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-11-27T08:18:24.357452"
      },
      {
        "id": "1p7ij2q",
        "title": "I just hired my uber driver",
        "selftext": "About a month ago, I got a ride from a bright and starry-eyed 20s-something who had just moved to my city. He left his family behind, some 1,500 miles away - said he wanted to make it and seek out opportunity.\n\nWe got to chatting, told him a bit of my backstory selling across FAANG, some startups, and now being a founder. Turns out he has a background in sales and is hungry for knowledge + experience. I've been wanting to mentor a seller since I never had one myself (apart from the books I read), and this is the first time someone has actually taken me up on the offer. It's crazy considering how many people say they want to make it but don't take any initiative.\n\nI'm giving him a chance in hopes that grit and sheer determination outperform pedigree (we typically recruit from Ivy League and technical universities). I've always held the hypothesis that many people have the drive to better their lives, but not everyone has the opportunity. Now we get to test it. Anecdotally there seem to be three core elements to success in entry-level B2B; the \"Want\"; the intelligence filter; and the execution filter.\n\nI've hired him on as a BDR on a 6 month contract. By my calculations, if he's even 60% as good as I am at setting appointments, both the company and he will have positive financial outcomes.\n\nI look forward to updating the group as this progresses, and I hope this serves as a gentle reminder to take a chance on the underdog.\n\nHappy U.S. Thanksgiving to those that observe.",
        "subreddit": "Entrepreneur",
        "author": "WAp0w",
        "score": 160,
        "num_comments": 29,
        "created_utc": 1764188843.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p7ij2q/i_just_hired_my_uber_driver/",
        "fetched_at": "2025-11-27T08:18:17.158674"
      },
      {
        "id": "1p7irop",
        "title": "Who actually does business with those random texts and phone calls we all get “you’ve been approved for $256,000 for your business”",
        "selftext": "Part of me really wants to mess around with some of them just to see how far along they will go or if it’s just a scam to get my ACH information. I don’t know how the hell I got on a business owner phone list but I get at least three or four texts a day and probably another two or three voicemails every day about business funding for my business. If they reach me, I try to tell him I don’t have a business I never have and I don’t know why they have my information, but it doesn’t reduce the number of calls I get. I wonder if they actually do any business and find people desperate enough for these kinds of Loans?\n\nOne I got a text for approval of a random number like $276,500.  I responded with, “gosh sorry I only need $260,000” and INSTANTLY got a call from a dude based in US that didn’t sound overly scammy.  I listened to his spiel then told him I had zero interest doing business with someone who cold texts me, and to stop calling and texting me",
        "subreddit": "smallbusiness",
        "author": "bluegrass__dude",
        "score": 124,
        "num_comments": 47,
        "created_utc": 1764189420.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p7irop/who_actually_does_business_with_those_random/",
        "fetched_at": "2025-11-27T08:18:22.496910"
      },
      {
        "id": "1p736ef",
        "title": "What automation blew your mind recently as an entrepreneur?",
        "selftext": "I saw this in a different sub reddit but made more sense for entrepreneurs. So asking it here! AI has been creeping into every corner of business, but every now and then there’s a workflow or automation that feels next-level! Something thats way smarter, faster  or more effective than you expected. \n\nSo I'm curious, what AI-powered marketing automation recently blew your mind?",
        "subreddit": "Entrepreneur",
        "author": "Sure_Marsupial_4309",
        "score": 94,
        "num_comments": 68,
        "created_utc": 1764148235.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p736ef/what_automation_blew_your_mind_recently_as_an/",
        "fetched_at": "2025-11-27T08:18:17.158703"
      },
      {
        "id": "1p74o3j",
        "title": "Quit my construction job for a startup that failed. Now I'm more lost than ever",
        "selftext": "Earlier this year I left construction to work for a small startup. They sold me on equity, growth potential, all that stuff. I took a massive pay cut because I genuinely believed in it.\n\nSpent the last few months learning everything - cold email, LinkedIn outreach automations, n8n automations , lead gen. I was actually pretty good at it too. Booked them 20-30 calls every month.\n\nBut they ran out of money and couldn't keep me on. So that's that.\n\nAlso broke up with my girlfriend during all this. So now I'm single, broke, sitting on all these skills I don't really know what to do with.\n\nMy old construction job would probably take me back. Good money, stable work. But honestly the thought of going back feels like I failed. Like I wasted all this time learning stuff that doesn't matter.\n\nEveryone says \"just freelance\" or \"offer your services\" but like... I have no clients, no real portfolio, no clue where to start.\n\nBeen thinking about doing free work or super cheap work just to get case studies and actually talk to people. But idk if that's the move or if it just makes me look desperate.\n\nThe frustrating part is I can build websites fast now, set up email campaigns that work, automate outreach - all this stuff that should be useful. But none of it matters if I don't have anyone to actually do it for.\n\nHas anyone been through something like this? Like a career change that just feels completely stuck? How did you figure it out?",
        "subreddit": "Entrepreneur",
        "author": "Spare_Worldliness_64",
        "score": 78,
        "num_comments": 79,
        "created_utc": 1764153945.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p74o3j/quit_my_construction_job_for_a_startup_that/",
        "fetched_at": "2025-11-27T08:18:17.158701"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 72,
        "num_comments": 49,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-27T08:18:24.357476"
      },
      {
        "id": "1p7gfpv",
        "title": "The hidden cost of bootstrapping: Dealing with fragile egos and fake seniors (I fired 4 in a row)",
        "selftext": "I need to vent and get some advice because I feel like I'm losing my mind with hiring.\n\nI'm a technical founder bootstrapping my own SaaS. I'm paying out of pocket and hiring remotely in Latam. I offer a very competitive salary for the region (about 3-4x the local minimum wage). It’s enough to live very comfortably here.\n\nBut the work ethic I'm seeing is absolute trash. I've had to fire 4 developers in a row, and it's not even about the code half the time, it's the attitude. It feels like walking on eggshells.\n\nHere is my recent streak:\n\n1. The Ghost: Disappeared for 3 days. No message, nothing. Came back and acted like everything was normal.\n2. The Over-Engineer: Took 10 days to build a reusable table component. He over-engineered it to death, and it didn't even work. When I told him it was broken and took too long, he got offended because I \"didn't value his craft.\"\n3. The Delicate One: I simply asked him \"how is the task going?\" mid-week. He quit immediately because he felt \"too much pressure.\" Asking for a status update is toxic pressure now?\n4. The Gamer: The final straw. He was billing me for \"complex bug fixes.\" I checked Discord and saw he had been playing Red Dead Redemption 2 for hours during work time. When I called him out, he didn't apologize. He called ME unprofessional for checking and quit.\n\nAnd just to be clear: Yes, I do technical tests and interviews. But with AI now, it is extremely easy to simulate skills or fake a take-home test. As a solo founder, I simply don't have the bandwidth to spend 10+ hours deep-vetting or micromanaging every single applicant to ensure they are real.\n\nHow are you guys managing this? I feel like I'm dealing with a generation that wants Silicon Valley perks but crumbles the second you ask for accountability or deadlines.\n\nI'm tired of being a babysitter instead of a CTO. How do you filter these people out effectively?",
        "subreddit": "SaaS",
        "author": "edinsonjohender",
        "score": 58,
        "num_comments": 136,
        "created_utc": 1764184002.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p7gfpv/the_hidden_cost_of_bootstrapping_dealing_with/",
        "fetched_at": "2025-11-27T08:18:18.981236"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 55,
        "num_comments": 51,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-11-27T08:18:24.357479"
      },
      {
        "id": "1p7ie98",
        "title": "Building in dark for 7 months, finally launched my product and I cant regret it more",
        "selftext": "For the past seven months, I’ve been building an AI vibe website builder similar to Lovable but specifically tailored for landing pages. I’ve spent a tremendous amount of time fine-tuning every detail to create a flawless product.\n\nI was expecting a strong response on launch day, but reality hit me hard when I didn’t receive a single sign up.  \nI ve invested so much time and effort into this project that seeing it fall has been really painful.\n\nI’m committed to doing whatever it takes to make this product successful.\n\nI would greatly appreciate any feedback from experts here that could help me understand what I might be doing wrong and how I should move forward.  \nThank you in advance.",
        "subreddit": "SaaS",
        "author": "aecs71",
        "score": 50,
        "num_comments": 54,
        "created_utc": 1764188541.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p7ie98/building_in_dark_for_7_months_finally_launched_my/",
        "fetched_at": "2025-11-27T08:18:18.981233"
      }
    ]
  }
}