{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-16T08:17:23.337279"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-16T08:17:14.592854"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-16T08:17:14.592857"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-16T08:17:14.355798"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-16T08:17:14.355788"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-16T08:17:14.592849"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-16T08:17:14.592852"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-10-16T08:17:14.355803"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-16T08:17:14.355800"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-16T08:17:14.592837"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-16T08:17:14.355802"
      }
    ],
    "reddit": [
      {
        "id": "1o7deey",
        "title": "Started offering a \"throwaway\" service to keep customers happy and now it makes more than my actual business",
        "selftext": "I need some perspective here: I run a small landscaping company, been doing it for about 4 years now. Standard stuff like lawn maintenance, seasonal cleanups, mulching, the usual.\n\nAbout 8 months ago I had this one client who kept asking if I could pressure wash their driveway while I was already there doing their yard. I said sure whatever, charged them like $75 extra just to not deal with scheduling another visit. Took me maybe 30 mins.\n\nWord got around I guess because then other clients started asking. I figured why not, easy add on right? Fast forward to now and I'm getting calls specifically for pressure washing. Like people don't even want the landscaping part anymore they just want their driveways, decks, house siding done.\n\nDid the math last week and the pressure washing stuff brought in almost double what the landscaping did last month. I've got some money saved up from the busy season so I could buy better equipment and actually pivot to this full time but it feels weird abandoning what I started with?\n\nAnyone else deal with something like this where a side thing accidentally became the main thing? Do I just roll with it or am I overthinking this",
        "subreddit": "smallbusiness",
        "author": "young_wealth",
        "score": 1029,
        "num_comments": 162,
        "created_utc": 1760540467.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o7deey/started_offering_a_throwaway_service_to_keep/",
        "fetched_at": "2025-10-16T08:17:20.512313"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 467,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-16T08:17:22.335897"
      },
      {
        "id": "1o76440",
        "title": "Vercel CEO shared how to build a $9.3B company from 0.",
        "selftext": "These points are summarized from Guillermo Rauch of Vercel's podcasts and interviews.\n\nI’m applying 99% of these lessons in my own startup [Shipper.now](http://shipper.now/) (AI no-code app builder), which I’m building in public. Thought I’d share in case it’s useful to other founders here.\n\nCheers :)",
        "subreddit": "SaaS",
        "author": "chdavidd",
        "score": 272,
        "num_comments": 27,
        "created_utc": 1760519625.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o76440/vercel_ceo_shared_how_to_build_a_93b_company_from/",
        "fetched_at": "2025-10-16T08:17:17.248765"
      },
      {
        "id": "1o7stn7",
        "title": "Tai Lopez YouTube Account Deleted.",
        "selftext": "Amid the SEC lawsuit. It appears Tai Lopez has taken down his official YouTube channel. However, his Instagram, X, and website are still up. I wonder why he only terminated YouTube. Or maybe YouTube deleted it.",
        "subreddit": "Entrepreneur",
        "author": "Wallebrothers75",
        "score": 195,
        "num_comments": 73,
        "created_utc": 1760576725.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o7stn7/tai_lopez_youtube_account_deleted/",
        "fetched_at": "2025-10-16T08:17:15.435447"
      },
      {
        "id": "1o7cdl5",
        "title": "Nobody talks about how lonely the early grind phase actually is",
        "selftext": "Everyone shows the highlight reels \"built my business from scratch!\" “six figures by 25!”  \nNo one mentions how quiet it gets in between. It’s 2AM, the house is silent, and you’re tweaking a landing page that no one’s going to see for weeks. You start questioning everything. Last week I was deep in that spiral and ended up jumping on a stream just to hear people talk about literally anything else. Random chatter, dumb jokes it pulled me out of my own head for a while.  \nI love building, but yeah, it’s lonely as hell sometimes. How do you stay sane during the grind?",
        "subreddit": "Entrepreneur",
        "author": "BrashMortality",
        "score": 180,
        "num_comments": 78,
        "created_utc": 1760538161.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o7cdl5/nobody_talks_about_how_lonely_the_early_grind/",
        "fetched_at": "2025-10-16T08:17:15.435449"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 177,
        "num_comments": 48,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-16T08:17:22.335940"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 166,
        "num_comments": 57,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-16T08:17:22.335935"
      },
      {
        "id": "1o7n22l",
        "title": "open ai isn't killing any 'actual' startup \"i will not promote\"",
        "selftext": "i keep seeing founders say their startup died because openai launched something similar. it’s driving me insane. how is your product so fragile that a single openai update wipes you out? this new generation of founders feels completely disconnected from reality. did everyone just forget what actually makes a product work: user experience, economies of scale, vertical focus, distribution, and everything else? feels like something’s seriously broken in the market right now or is it just me?",
        "subreddit": "startups",
        "author": "The-GTM-engineer",
        "score": 108,
        "num_comments": 22,
        "created_utc": 1760561991.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1o7n22l/open_ai_isnt_killing_any_actual_startup_i_will/",
        "fetched_at": "2025-10-16T08:17:18.960563"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 101,
        "num_comments": 61,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-10-16T08:17:22.335957"
      },
      {
        "id": "1o75r0z",
        "title": "What are your favorite automation tools helping you as entrepreneur in 2025?",
        "selftext": "Feels like every week there’s a new automation tool launching- from content creation to lead tracking to full-blown marketing workflows.\n\nBut I’m curious about real-world use: what tools are actually saving you time or money this year?",
        "subreddit": "Entrepreneur",
        "author": "impetuouschestnut",
        "score": 96,
        "num_comments": 65,
        "created_utc": 1760518200.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o75r0z/what_are_your_favorite_automation_tools_helping/",
        "fetched_at": "2025-10-16T08:17:15.435469"
      }
    ]
  }
}