{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-27T16:15:11.968772"
  },
  "data": {
    "youtube": [
      {
        "videoId": "Q1tCEvqakUo",
        "title": "Fastest Editing Workflow in DaVinci Resolve! - Perfect for Tutorials and How To Vids!",
        "description": "Get the FREE practice media here: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2025-10-14T14:00:41Z",
        "url": "https://www.youtube.com/watch?v=Q1tCEvqakUo",
        "fetched_at": "2025-11-27T16:15:03.121804"
      },
      {
        "videoId": "24TFLVCceiQ",
        "title": "The Only BOOKKEEPING Tutorial You Need 2025 | For Beginners",
        "description": "Bookkeeping for beginners (2025) explained in under a minute, then a complete step-by-step tutorial. This is a 2 hour free course ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2025-10-02T18:18:19Z",
        "url": "https://www.youtube.com/watch?v=24TFLVCceiQ",
        "fetched_at": "2025-11-27T16:15:03.515174"
      },
      {
        "videoId": "_XySZQrHPCE",
        "title": "Steal This Easy Vlog Editing Workflow, It&#39;ll Simplify Everything",
        "description": "Get 2 extra months free on an annual plan from Motion Array https://geni.us/tEEoIY 🎞️ New to video editing? Learn the ...",
        "channelTitle": "Tamara Gabriel",
        "publishedAt": "2025-07-18T11:18:22Z",
        "url": "https://www.youtube.com/watch?v=_XySZQrHPCE",
        "fetched_at": "2025-11-27T16:15:03.121818"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-27T16:15:03.515159"
      },
      {
        "videoId": "mjiT0g3mYgw",
        "title": "9 Editing Tips To Save HOURS in DaVinci Resolve!",
        "description": "9 Editing Tips in DaVinci Resolve you probably didn't know! In this DaVinci Resolve tutorial, I'm going to show you 9 powerful ...",
        "channelTitle": "Sightseeing Stan",
        "publishedAt": "2025-05-26T14:01:15Z",
        "url": "https://www.youtube.com/watch?v=mjiT0g3mYgw",
        "fetched_at": "2025-11-27T16:15:03.121812"
      },
      {
        "videoId": "NIf8S185ONk",
        "title": "The iPad Pro is Ready for Video Editing",
        "description": "using the iPad Pro and speed editor with Davinci Resolve to edit and color grade an entire video for YouTube. iPad Pro M4 13” ...",
        "channelTitle": "Tommirock",
        "publishedAt": "2025-05-16T22:50:24Z",
        "url": "https://www.youtube.com/watch?v=NIf8S185ONk",
        "fetched_at": "2025-11-27T16:15:03.121832"
      },
      {
        "videoId": "q_UPVaJL5WA",
        "title": "The Truth About STARTING a Bookkeeping Business in 2025",
        "description": "Ready to pick one niche, get unstuck and get clients to ogrow your business faster? Grab the Profit Booster 1000 Niches PDF + ...",
        "channelTitle": "The Bookkeeping Shop",
        "publishedAt": "2025-05-14T17:30:24Z",
        "url": "https://www.youtube.com/watch?v=q_UPVaJL5WA",
        "fetched_at": "2025-11-27T16:15:03.515179"
      },
      {
        "videoId": "JEAkQLMxqtw",
        "title": "How to Set Up Your Books as a New Business Owner",
        "description": "Bookkeeping doesn't have to be scary—and getting it right from day one can save you major headaches down the road. In this ...",
        "channelTitle": "Mark J Kohler",
        "publishedAt": "2025-04-29T21:54:58Z",
        "url": "https://www.youtube.com/watch?v=JEAkQLMxqtw",
        "fetched_at": "2025-11-27T16:15:03.515172"
      },
      {
        "videoId": "8MQfZTjbvPw",
        "title": "🔥 This FREE plugin will change your video editing workflow FOREVER!",
        "description": "Say hello to Premiere Composer, packed with transitions, sound effects, and motion graphics #videoeditingtips #premierepro ...",
        "channelTitle": "Sebastien Jefferies",
        "publishedAt": "2025-04-15T17:21:05Z",
        "url": "https://www.youtube.com/watch?v=8MQfZTjbvPw",
        "fetched_at": "2025-11-27T16:15:03.121822"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-11-27T16:15:03.515169"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 488,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-27T16:15:10.967424"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 241,
        "num_comments": 80,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-11-27T16:15:10.967435"
      },
      {
        "id": "1p7ij2q",
        "title": "I just hired my uber driver",
        "selftext": "About a month ago, I got a ride from a bright and starry-eyed 20s-something who had just moved to my city. He left his family behind, some 1,500 miles away - said he wanted to make it and seek out opportunity.\n\nWe got to chatting, told him a bit of my backstory selling across FAANG, some startups, and now being a founder. Turns out he has a background in sales and is hungry for knowledge + experience. I've been wanting to mentor a seller since I never had one myself (apart from the books I read), and this is the first time someone has actually taken me up on the offer. It's crazy considering how many people say they want to make it but don't take any initiative.\n\nI'm giving him a chance in hopes that grit and sheer determination outperform pedigree (we typically recruit from Ivy League and technical universities). I've always held the hypothesis that many people have the drive to better their lives, but not everyone has the opportunity. Now we get to test it. Anecdotally there seem to be three core elements to success in entry-level B2B; the \"Want\"; the intelligence filter; and the execution filter.\n\nI've hired him on as a BDR on a 6 month contract. By my calculations, if he's even 60% as good as I am at setting appointments, both the company and he will have positive financial outcomes.\n\nI look forward to updating the group as this progresses, and I hope this serves as a gentle reminder to take a chance on the underdog.\n\nHappy U.S. Thanksgiving to those that observe.",
        "subreddit": "Entrepreneur",
        "author": "WAp0w",
        "score": 219,
        "num_comments": 36,
        "created_utc": 1764188843.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p7ij2q/i_just_hired_my_uber_driver/",
        "fetched_at": "2025-11-27T16:15:04.286275"
      },
      {
        "id": "1p7skdk",
        "title": "For those of you who grew up poor but became rich. How did you actually do it?",
        "selftext": "I’m 18 and grew up without much money, and I’ve always wanted to invent something or start some type of business. The hard part is that almost every market looks either overcrowded or completely dead. I’m also income-restricted right now, I don’t have a high-paying job, and I’m honestly not great at saving (I’m working on that though).\n\nSomething else worth mentioning! \nI work in a pretty wealthy area, so I deal with rich customers every day. I see the lifestyle up close. The cars, the casual spending, the confidence, but I don’t know how they got there. And it makes me wonder what their starting point looked like.\n\nSo I want to ask the people here who actually lived it. If you grew up poor and became rich, what did you specifically do to get there?\nWhat steps did you take, what choices mattered most, and how did you break out of the cycle when you didn’t have money, connections, or a safety net?\n\nI’m not looking for generic answers like “just work hard.” I mean the real, practical path you took. Especially during those early years when you were broke and everything felt impossible.\n\nThanks to anyone willing to share. I really appreciate it.",
        "subreddit": "Entrepreneur",
        "author": "Exotic-Call-4906",
        "score": 169,
        "num_comments": 92,
        "created_utc": 1764216489.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p7skdk/for_those_of_you_who_grew_up_poor_but_became_rich/",
        "fetched_at": "2025-11-27T16:15:04.286267"
      },
      {
        "id": "1p7irop",
        "title": "Who actually does business with those random texts and phone calls we all get “you’ve been approved for $256,000 for your business”",
        "selftext": "Part of me really wants to mess around with some of them just to see how far along they will go or if it’s just a scam to get my ACH information. I don’t know how the hell I got on a business owner phone list but I get at least three or four texts a day and probably another two or three voicemails every day about business funding for my business. If they reach me, I try to tell him I don’t have a business I never have and I don’t know why they have my information, but it doesn’t reduce the number of calls I get. I wonder if they actually do any business and find people desperate enough for these kinds of Loans?\n\nOne I got a text for approval of a random number like $276,500.  I responded with, “gosh sorry I only need $260,000” and INSTANTLY got a call from a dude based in US that didn’t sound overly scammy.  I listened to his spiel then told him I had zero interest doing business with someone who cold texts me, and to stop calling and texting me",
        "subreddit": "smallbusiness",
        "author": "bluegrass__dude",
        "score": 151,
        "num_comments": 54,
        "created_utc": 1764189420.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p7irop/who_actually_does_business_with_those_random/",
        "fetched_at": "2025-11-27T16:15:09.191665"
      },
      {
        "id": "1p7vmr2",
        "title": "Why everyone here is acting like they are multi millionaires…",
        "selftext": "Whenever I read something on here like comments, “advices”. Everyone is acting like they have some crazy successful businesses and generates them millions of dollars in profit every year. Is it true or is it the same concept that all men on reddit are 6’2” stud and have 8 inches?  \n\nIt seems like they all don’t have any issues with their businesses, just being here to judge people, all the advices here I see is “why didn’t you just do the right thing?” \n\nSometimes I forgot this is “small” business subreddit when I read things on here. Feels like you all should be on millionaire subreddit not here. ",
        "subreddit": "smallbusiness",
        "author": "No_Dirt_8834",
        "score": 94,
        "num_comments": 95,
        "created_utc": 1764226710.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p7vmr2/why_everyone_here_is_acting_like_they_are_multi/",
        "fetched_at": "2025-11-27T16:15:09.191663"
      },
      {
        "id": "1p7yuy8",
        "title": "How I hijack \"Engagement Farming\" posts on LinkedIn to generate leads",
        "selftext": "You have likely seen those engagement farming posts on LinkedIn where the author asks everyone to comment a specific keyword to get a resource. The problem is that the author is often just looking for engagement and never actually sends the promised book or answer.\n\nI found a way to take advantage of these posts to extract leads and get crazy results in my outreach.   \n  \nStep 1: Find a post with tons of engagement in your niche. If the author isn’t replying to comments, that’s a good sign, go for it.  \n  \nStep 2: Extract everyone who liked or commented. You can do it with a tool.   \n  \nStep 3: Send them a LinkedIn message and an email saying: “I saw you commented on a post to receive a resource about (topic). Did you get it?”  \n  \nThey’ll say no, and then you simply send them your own guide.  \n  \nI started doing this a few days ago and I’ve never seen better results in cold outreach.  \n  \nGood luck, and go get them!\n\nI made a video showing exactly how to do this [https://www.youtube.com/watch?v=0cmJH8nCeeM](https://www.youtube.com/watch?v=0cmJH8nCeeM)",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 85,
        "num_comments": 20,
        "created_utc": 1764238939.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p7yuy8/how_i_hijack_engagement_farming_posts_on_linkedin/",
        "fetched_at": "2025-11-27T16:15:06.109195"
      },
      {
        "id": "1p7gfpv",
        "title": "The hidden cost of bootstrapping: Dealing with fragile egos and fake seniors (I fired 4 in a row)",
        "selftext": "I need to vent and get some advice because I feel like I'm losing my mind with hiring.\n\nI'm a technical founder bootstrapping my own SaaS. I'm paying out of pocket and hiring remotely in Latam. I offer a very competitive salary for the region (about 3-4x the local minimum wage). It’s enough to live very comfortably here.\n\nBut the work ethic I'm seeing is absolute trash. I've had to fire 4 developers in a row, and it's not even about the code half the time, it's the attitude. It feels like walking on eggshells.\n\nHere is my recent streak:\n\n1. The Ghost: Disappeared for 3 days. No message, nothing. Came back and acted like everything was normal.\n2. The Over-Engineer: Took 10 days to build a reusable table component. He over-engineered it to death, and it didn't even work. When I told him it was broken and took too long, he got offended because I \"didn't value his craft.\"\n3. The Delicate One: I simply asked him \"how is the task going?\" mid-week. He quit immediately because he felt \"too much pressure.\" Asking for a status update is toxic pressure now?\n4. The Gamer: The final straw. He was billing me for \"complex bug fixes.\" I checked Discord and saw he had been playing Red Dead Redemption 2 for hours during work time. When I called him out, he didn't apologize. He called ME unprofessional for checking and quit.\n\nAnd just to be clear: Yes, I do technical tests and interviews. But with AI now, it is extremely easy to simulate skills or fake a take-home test. As a solo founder, I simply don't have the bandwidth to spend 10+ hours deep-vetting or micromanaging every single applicant to ensure they are real.\n\nHow are you guys managing this? I feel like I'm dealing with a generation that wants Silicon Valley perks but crumbles the second you ask for accountability or deadlines.\n\nI'm tired of being a babysitter instead of a CTO. How do you filter these people out effectively?",
        "subreddit": "SaaS",
        "author": "edinsonjohender",
        "score": 77,
        "num_comments": 149,
        "created_utc": 1764184002.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p7gfpv/the_hidden_cost_of_bootstrapping_dealing_with/",
        "fetched_at": "2025-11-27T16:15:06.109217"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 70,
        "num_comments": 49,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-27T16:15:10.967456"
      },
      {
        "id": "1p7ie98",
        "title": "Building in dark for 7 months, finally launched my product and I cant regret it more",
        "selftext": "For the past seven months, I’ve been building an AI vibe website builder similar to Lovable but specifically tailored for landing pages. I’ve spent a tremendous amount of time fine-tuning every detail to create a flawless product.\n\nI was expecting a strong response on launch day, but reality hit me hard when I didn’t receive a single sign up.  \nI ve invested so much time and effort into this project that seeing it fall has been really painful.\n\nI’m committed to doing whatever it takes to make this product successful.\n\nI would greatly appreciate any feedback from experts here that could help me understand what I might be doing wrong and how I should move forward.  \nThank you in advance.",
        "subreddit": "SaaS",
        "author": "aecs71",
        "score": 64,
        "num_comments": 69,
        "created_utc": 1764188541.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p7ie98/building_in_dark_for_7_months_finally_launched_my/",
        "fetched_at": "2025-11-27T16:15:06.109215"
      }
    ]
  }
}