{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-10T08:16:34.645025"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-10T08:16:26.258632"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-10T08:16:26.258634"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-10T08:16:25.968003"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-10T08:16:25.967992"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-10T08:16:26.258629"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-10T08:16:26.258631"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-10-10T08:16:25.968011"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-10T08:16:25.968006"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-10T08:16:26.258621"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-10T08:16:25.968009"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 457,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-10T08:16:33.643797"
      },
      {
        "id": "1o2blbe",
        "title": "My “crazy” idea worked. Now they’re calling it teamwork.",
        "selftext": "So a while ago I pitched this “crazy” idea at work like what if we just start seeding our product on LinkedIn? nothing big, just testing quietly, seeing reactions, and then building from there\n\neveryone brushed it off\ntoo risky, not scalable, and apparently I’m too “junior” to handle it lol\nso I just stayed quiet\n\nthen I went ahead and did it anyway\nstarted small, posted here and there, talked to people, tested a few things\nand within a week, boom traffic went up, people started noticing, actual results\n\nsuddenly my boss is super interested\nwait, who did this?\n\nand now it’s all we did this our strategy worked, great teamwork\n\nsame idea, same plan, same execution\nexcept now everyone’s taking the credit\n\nfunny how last week I was the junior one with risky ideas\nand this week it’s all “we really nailed it together” ",
        "subreddit": "Entrepreneur",
        "author": "Zealousideal_Self678",
        "score": 302,
        "num_comments": 56,
        "created_utc": 1760029525.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o2blbe/my_crazy_idea_worked_now_theyre_calling_it/",
        "fetched_at": "2025-10-10T08:16:26.964664"
      },
      {
        "id": "1o1oidn",
        "title": "I disappointed an aspiring entrepreneur by telling the truth",
        "selftext": "I met an aspiring entrepreneur from my community who is currently working in a 9-5 job and he wants to quit and go all in. He wanted to listen to my experience and my take on starting a business. The first thing I told him is that it is so difficult. His face changed immediately May be he was expecting some delightful words. He might have had a rosy picture that running a business is all jolly good. \n\nHe said I can find investors, there is a 3 PhD holders team, R&D IP and what not. There is this one client who may pay for the product if they can build it spending 800k$. So on paper it’s just words and promises. I told him that a business should run not because there is funding, or employees are working hard, or there is a trend you can surf on. A business runs when there are customers who are willing to pay for what you sell. Simple. And that part is the hardest in an economically turbulent world. And when revenue doesn’t flow in, everything else becomes tough. I await invoices as small as 2000$ which were not paid by clients for months. I told him that you will be choked every month with no light at the end of the tunnel. May be I should have just lied to him it’s going to be awesome. May be I should have said more nice things but I had very few nice things to say. How would you describe your journey to an aspiring entrepreneur? Roses or thorns? Or a mix of both?",
        "subreddit": "Entrepreneur",
        "author": "richy_vinr",
        "score": 296,
        "num_comments": 111,
        "created_utc": 1759960369.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o1oidn/i_disappointed_an_aspiring_entrepreneur_by/",
        "fetched_at": "2025-10-10T08:16:26.964702"
      },
      {
        "id": "1o20r4t",
        "title": "If this crashes again I’m throwing my computer out the window",
        "selftext": "Spent the past 2 days building my app on Lovable. Everything was going well; my frontend was done, backend was working. I was RIGHT about to push the code but then my codebase froze, crashed, and now I can’t even load my project.\n\nThis isn’t the first time either. Replit was lagging like crazy last week too.\n\nWhy does every “AI builder” break the second you start relying on it? I just want to build my app without worrying about whether it's gonna crash every 5 seconds. ",
        "subreddit": "SaaS",
        "author": "CatoKnox",
        "score": 179,
        "num_comments": 37,
        "created_utc": 1759999570.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o20r4t/if_this_crashes_again_im_throwing_my_computer_out/",
        "fetched_at": "2025-10-10T08:16:28.672668"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 175,
        "num_comments": 47,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-10T08:16:33.643820"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 164,
        "num_comments": 54,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-10T08:16:33.643812"
      },
      {
        "id": "1o1x2wf",
        "title": "Growth almost broke my company faster than failure ever did",
        "selftext": "Everyone dreams of scaling up but nobody tells you how messy it really is. The bigger we get the more time I spend buried in payroll errors, onboarding nightmares and paperwork that never ends.\n\nI thought more jobs would mean more freedom but instead I’m chained to admin hell. Some days I wonder if staying small would’ve been smarter.\n\nHow do you scale without losing your mind to the back office side of things?\n\n",
        "subreddit": "Entrepreneur",
        "author": "Deeceness",
        "score": 151,
        "num_comments": 55,
        "created_utc": 1759985325.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o1x2wf/growth_almost_broke_my_company_faster_than/",
        "fetched_at": "2025-10-10T08:16:26.964692"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 149,
        "num_comments": 180,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-10T08:16:33.643852"
      },
      {
        "id": "1o24xwu",
        "title": "What's the catch with those cheap hotels for sale in Italy?",
        "selftext": "I came across several very cheap hotels for sale in Italy and I’m seriously considering pulling the trigger. These hotels aren’t in great shape, but they’re far from ruins... they’re fully operational and listed on Booking.\n\nSome prices are wild (for example, found this one with [50 rooms for €450,000](https://www.buythathotel.com/listing/scenic-hotel-for-sale-in-tabiano-terme)). Of course, they’re not in top locations like Lake Como or the Amalfi Coast, but... it’s still Italy, with its culture, great food.\n\nAll the ones I’ve looked at are run by elderly owners who just want to retire. They have zero tech or marketing skills and haven’t invested much in the properties over the past decade.\n\nSo I figured that with some alternative concepts, like coliving, it would be nearly impossible not to make money (or at least be able to sell in a few years for a profit). Bureaucracy will probably be an issue, but that’s the case everywhere in Southern Europe.\n\nSo what’s the catch?",
        "subreddit": "smallbusiness",
        "author": "faborioo",
        "score": 115,
        "num_comments": 111,
        "created_utc": 1760013922.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o24xwu/whats_the_catch_with_those_cheap_hotels_for_sale/",
        "fetched_at": "2025-10-10T08:16:31.922112"
      },
      {
        "id": "1o2em6x",
        "title": "Client scolded me for keeping him in the \"To\" field",
        "selftext": "I offer marketing services as a small self-employed hustle. I’m not looking to expand or hire staff, so over time I’ve learned to let go of clients who bring more stress than they’re worth.\n\nMy longest-serving client has started acting oddly and being unprofessional with one of our vendors, which is making me think it’s time to part ways. One incident that stands out happened two weeks ago when he scolded me for leaving him in the “To” field of an email.\n\nHere’s what happened:\nHe sent an email to a vendor, addressed to them with me on cc. I wanted to add some extra info for the vendor, so I hit reply all. In doing so, my client ended up in the “To” field and the vendor in “cc.” Later that week, he actually scolded me for it on a call.\n\nI was surprised because I can’t see how that would have had any practical effect. The vendor still got the message and replied to it. I get that it’s a small etiquette thing, but to me it feels like a non-issue.\n\nNow he’s also started raising his voice at the vendor on calls, accusing them of being unprofessional when I honestly think they weren’t. I’m leaning toward ending the relationship, but I’d like to sanity-check myself first.\n\nWas I really out of line with that email, or is this just another sign that the client is being unreasonable?",
        "subreddit": "smallbusiness",
        "author": "hopium_od",
        "score": 99,
        "num_comments": 60,
        "created_utc": 1760036403.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o2em6x/client_scolded_me_for_keeping_him_in_the_to_field/",
        "fetched_at": "2025-10-10T08:16:31.922101"
      }
    ]
  }
}