{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-01T01:09:50.801569"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-01T01:09:41.983342"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-01T01:09:41.675727"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-01T01:09:41.675735"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-01T01:09:41.675729"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-01T01:09:41.675716"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-01T01:09:41.983340"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-01T01:09:41.983346"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-01T01:09:41.983344"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-01T01:09:41.983331"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-01T01:09:41.675731"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 485,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-01T01:09:49.800210"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 426,
        "num_comments": 118,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-01T01:09:49.800223"
      },
      {
        "id": "1p9uk2q",
        "title": "I spent $1000 advertising on Reddit and have nothing to show for it",
        "selftext": "Basically the title. I absolutely failed to convert even one of the 5000 clicks (and >1m views of the ad) I got into anything - even a deeper click, not to mention a $1 of revenue, despite experimenting with a dozen different variants of copy for my landing page and having one epiphany after another (and a few moments of deep despair).\n\nI even had someone (just one person, luckily) point out in a random sub how annoying my ads were, so most of you probably saw them (the noir styled comics) once or twice.\n\nI apologize for the annoyance if you felt it\n\nAnyway, I'm shutting this down and abandoning this path, but before I do maybe I can answer a few questions - if you want to pursue a similar path and avoid my mistakes.\n\nEdit:\n\nRIP my inbox, etc.. I love you guys, you are awesome! The feedback I got was so good that the current version of the ad plus landing page is doing very well - about 6% clicks on the CTA.\n\nI've got a gazillion notifications to go through and I'll try to respond to everyone, but if I can't, I will at least *read* everything. I really appreciate the attention this got and I'll try to do a write up on my actual learnings here - the biggest ones are about being humble and asking for help.\n\n🙏",
        "subreddit": "Entrepreneur",
        "author": "zoozla",
        "score": 226,
        "num_comments": 197,
        "created_utc": 1764437298.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p9uk2q/i_spent_1000_advertising_on_reddit_and_have/",
        "fetched_at": "2025-12-01T01:09:42.774109"
      },
      {
        "id": "1pa6rpz",
        "title": "I’m 22, had a small travel agency that made me around 70k, then I randomly ended up on a Hass avocado farm in Kenya… bought land in Ethiopia… and now I’m kinda stuck on what to do next",
        "selftext": "I’m 22 and honestly I’ve always been good with saving and money stuff. I started this small travel agency a couple years back, nothing crazy, but it somehow worked and I made like 70k over time. As I started making money I also started traveling a lot, just seeing the world, learning stuff… one of those trips was to Kenya.Someone I met there took me to this Hass avocado farm. I swear I didn’t even care about farming before but something about that place stuck with me. The trees, the export thing, the whole operation… don’t know why but it hit me.\nBefore that I was just doing the travel agency thing, but then the whole model started getting copied everywhere and abused. Margins dropped, everything felt off, so I shut it down before it ate everything I worked for.When I got back home I kept reading about Hass avocados nonstop. Like for two years. Everything from seedlings to climate stuff to yields and prices. Deep rabbit hole.Then I found some land in Ethiopia that fit everything I learned and I bought it. Honestly that moment felt wild, like “damn… this is mine.”And now I’m kinda just sitting here thinking, ok… what’s the actual next move?\nIt’s weird going from a travel agency to avocado farming. Didn’t expect life to go this direction at all.Anyone else ever make a complete switch like this?How do you know if you’re moving smart or just chasing something because it felt right in the moment?\n\nAny advice would be appreciated",
        "subreddit": "smallbusiness",
        "author": "Professor1602",
        "score": 121,
        "num_comments": 88,
        "created_utc": 1764469553.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pa6rpz/im_22_had_a_small_travel_agency_that_made_me/",
        "fetched_at": "2025-12-01T01:09:47.931530"
      },
      {
        "id": "1pav2cx",
        "title": "The CEO keeps asking me why our IT costs are so high and I don't know how to explain that software costs money",
        "selftext": "I'm the sole IT person at a 50 person company  \n  \nOur CEO is extremely old school who came up in manufacturing and I think he fundamentally doesn't understand how modern business software works. Every month he looks at our expenses and sees stuff like Slack, Zoom, Salesforce, AWS, etc and asks me why we're \"wasting money on all these subscriptions\" He also doesn't understand the difference between one time costs and subscriptions. Like he keeps bringing up how \"back in the day you just bought Microsoft Office once and that was it\" and I've tried to explain that saas models are just how enterprise software works now but he thinks it's all a scam lol   \n  \nThe worst part is he'll approve a $30k purchase for new office furniture without blinking but then grill me about why we're spending $2k/month on tools that literally allow people to do their jobs. I tried to break down what each service costs per user per month and show him it's like $50/person for ALL of our software and he still thinks that its high I'm at the point where   \nI'm considering just building a massive spreadsheet that shows what would happen if we downgraded\n\n\n\n",
        "subreddit": "SaaS",
        "author": "Bright-Economics5939",
        "score": 98,
        "num_comments": 67,
        "created_utc": 1764540663.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pav2cx/the_ceo_keeps_asking_me_why_our_it_costs_are_so/",
        "fetched_at": "2025-12-01T01:09:44.366851"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 75,
        "num_comments": 52,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-01T01:09:49.800250"
      },
      {
        "id": "1pap1h4",
        "title": "Feeling stuck at 10k$/month...",
        "selftext": "Hi!\n\nI own a software development business. No employees and a steady flow of clients. I make 10k$/month, whatever the month, it doesn't really change much to be honest. With time, I realized that I pretty much created my own job but with different bosses. Not really any expenses, 100% profit.\n\nHowever... I am feeling a bit stuck. I would love to add another 7k$/month so I can get to the 200K$/year sweet spot for me. \n\nI don't know what my next step should be. I don't want employees, but I would like to create an app of a business; basically, exactly what I do for my clients. \n\nI have a few ideas, but time is not really what I have the most of and I don't want to spend 10 hours per week on a losing idea...\n\nWhat would you do in my situation to get that extra money, ideally, not linked to my time spent working?",
        "subreddit": "Entrepreneur",
        "author": "AsteroidSnowsuit",
        "score": 63,
        "num_comments": 88,
        "created_utc": 1764526172.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pap1h4/feeling_stuck_at_10kmonth/",
        "fetched_at": "2025-12-01T01:09:42.774048"
      },
      {
        "id": "1panndq",
        "title": "My designer submitted 2 days of work last week that she didn't work. Should I just pay it?",
        "selftext": "I have a small business with 1 engineer and 1 designer. My designer has been slacking. She hasn't been giving me her time, so I moved her from a fixed rate contract to an hourly contract, telling her it's because of tax reasons. She didn't work the next 2 days, but stayed clocked in, while keeping her computer active with low activity.\n\nI then confronted her the next day during the review. I told her I know she's not giving me her best, and that she did all the work in 1 hour before the review. She told me she was sketching to get ideas those days. I interrupted and told her to stop. I told her that I think we both know if I asked her to show me sketches for those days, she wouldn't be able to show me anything. I told her I think she's a brilliant designer, but we need to hit reset on our relationship, because she's using her brilliance in order to try and get away without working. She's been giving me better work since, but she submitted 2 days where she clearly did nothing.\n\nPart of me is a bit upset, and I'm having to resist the urge to go through hour by hour and pick out all the times she's not doing any work for me. Should I just pay the 2 days of work she didn't do anything, or should I set a precedent of she doesn't work, she can't submit the hour.\n\nReplacing her would be a huge hassle.",
        "subreddit": "smallbusiness",
        "author": "Lost_Fox__",
        "score": 61,
        "num_comments": 122,
        "created_utc": 1764522943.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1panndq/my_designer_submitted_2_days_of_work_last_week/",
        "fetched_at": "2025-12-01T01:09:47.931521"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 53,
        "num_comments": 51,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-12-01T01:09:49.800254"
      },
      {
        "id": "1patros",
        "title": "Why do I still feel broke even though the business is doing well?",
        "selftext": "I started my agency about 18 months ago and we're doing pretty well. We just hit 40k MRR last month but I cannot shake the scarcity mindset and it's starting to affect how we operate. Like I'm talking about obsessing over every single expense to an unhealthy degree.\n\nLast week my business partner wanted to upgrade our project management software to a plan that costs an extra $200/month and I literally spent two hours building a case for why we didn't need it (fun factwe definitely need it) I just couldn't handle the idea of adding another recurring cost. She was pretty mad at me and I fully understand here I just don't know the reason behind me being like this\n\nI grew up pretty broke and bootstrapped this thing on like 3k and now even though we're profitable and growing I still operate like we're one expense away from shutting down. I review our business checking account basically every day. I still use a personal card for a bunch of business expenses because I feel guilty putting them on the company card even though that makes no sense whatsoever\n\nMy partner thinks I should talk to a therapist about it which honestly might not be a bad idea but I'm also super curious if anyone else deals with this? Like at what revenue point did you stop feeling like every dollar going out was a personal attack? Or does it never go away?\n\nThe ironic thing is I'm probably COSTING us money by being so cheap since we're definitely underinvesting in tools and people because I'm too anxious about everything? Anyone has any tips on how to improve with the way I'm dealing with everything? Thank you",
        "subreddit": "smallbusiness",
        "author": "Loose-Finding-4806",
        "score": 51,
        "num_comments": 22,
        "created_utc": 1764537477.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1patros/why_do_i_still_feel_broke_even_though_the/",
        "fetched_at": "2025-12-01T01:09:47.931516"
      }
    ]
  }
}