{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-18T08:15:25.479872"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-18T08:15:18.165376"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-18T08:15:17.816660"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-18T08:15:17.816652"
      },
      {
        "videoId": "a3GqDaIw8pA",
        "title": "BOOKKEEPING BASICS: 7 Steps to Get You Started",
        "description": "New! Get my 2nd Edition Accounting Cheat Sheet Bundle → https://accountingstuff.com/shop Are you tired of struggling with ...",
        "channelTitle": "Accounting Stuff",
        "publishedAt": "2023-05-23T08:35:05Z",
        "url": "https://www.youtube.com/watch?v=a3GqDaIw8pA",
        "fetched_at": "2025-09-18T08:15:18.165379"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-18T08:15:17.816641"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-18T08:15:18.165373"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-18T08:15:18.165377"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-18T08:15:17.816657"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-18T08:15:18.165363"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-18T08:15:17.816659"
      }
    ],
    "reddit": [
      {
        "id": "1nj421k",
        "title": "This is fucking too hard.",
        "selftext": "I thought Entrepreneurship will be somewhat okay, yes, I'm expecting it to be hard, but fuck it's HARD. \n\nI wanted to start a business to escape being an employee and earn \"freedom\" and what I got is fucking sleepless nights, panic attacks, isolation, budget I cannot spend for some travel to live life (reinvesting it to business), failures, fatigue, and loneliness.\n\nInstead of freedom, what I got is fucking headache, and no time for myself. Being available at all times(except sleeping), and fucking I can't even have clarity on what to do next. FUCK.\n\nI wished that it wasn't this hard, but yep, I gotta continue, consistency matters most. It's the hope of freedom that continue me to move.\n\n ",
        "subreddit": "Entrepreneur",
        "author": "OutsmartBetter",
        "score": 658,
        "num_comments": 230,
        "created_utc": 1758084890.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nj421k/this_is_fucking_too_hard/",
        "fetched_at": "2025-09-18T08:15:18.609008"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 455,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-18T08:15:24.478448"
      },
      {
        "id": "1njc2zb",
        "title": "How do you guys actually switch off?",
        "selftext": "I’ve been running my little business for a while now and honestly the hardest part is never feeling like I can turn my brain off. Even when I’m not working, I’m thinking about the next step, next client, next deadline. Most of my breaks don’t even feel like breaks. I’ll scroll or zone out, and it just makes me feel worse. Weirdly the only time I actually feel like I’m relaxing is when I’m doing something dumb and social, like hopping on with a couple friends for a bit. At least it feels like my brain gets a reset.  \n  \nHow do you guys actually unwind without feeling guilty about it?",
        "subreddit": "Entrepreneur",
        "author": "bountifulcarcass",
        "score": 201,
        "num_comments": 93,
        "created_utc": 1758112953.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1njc2zb/how_do_you_guys_actually_switch_off/",
        "fetched_at": "2025-09-18T08:15:18.609002"
      },
      {
        "id": "1njbqba",
        "title": "I tested a business idea with just a landing page (and it's now generating £4.5k/month)",
        "selftext": "Having worked corporate 9-5, been through redundancy, and with all this AI will replace you soon talk happening, I knew I wasn't looking to go back to that way of working. So I started thinking, if I had to start a physical business today, what would it be?\n\nI kept coming back to car wrapping, I don't know why but it's something that clicks for me. It has decent margins, is a growing market and has visual results that sell themselves.\n\nBut then I worked backwards through what I'd actually need:\n\n* Prime location (expensive)\n* Professional equipment (£££)\n* Vinyl suppliers and storage\n* Tools and workspace\n* Months learning to wrap professionally myself, or hiring experienced staff with salaries\n\nEven after all that investment, I'd still need to figure out how to get customers.\n\nSo I flipped it and just pretended I already had all that infrastructure and jumped straight to the marketing stage.\n\nI built a focused landing page targeting specific UK postcodes and areas. One offer, one goal, zero distractions - pure landing page fundamentals.\n\n**Results after the first few weeks:**\n\n* £45k worth of quoted wrap jobs\n* £15k worth of closed deals\n* Built 2 additional landing pages for different auto services like remapping\n\nMost of my time now goes into finding quality partners who can actually fulfill these leads.\n\nThis is actually harder than it sounds. Partner with a one-man band (no matter how skilled), and they're spending all day wrapping cars, they might get back to you with quotes in the evening... if you're lucky. \n\nBut I'm a firm believer in speed-to-lead when it comes to closing deals. That response time can make or break conversions.\n\nThis wouldn't be complete without mentioning AI, but not the usual shit.\n\nAll leads go into a simple table, then when I get manual quotes from suppliers, I enter them alongside the vehicle details (make, model, trim). Over time, I've built up a comprehensive database of quotes for specific vehicles.\n\nNow when someone requests a quote, AI can either pull from an exact match or work out that their vehicle is similar size to another in the database. I can provide ballpark quotes in minutes that are pretty much bang-on to what the wrapper would quote themselves.\n\nI've noticed a drastic increase in responses from potential leads coming back saying, \"Can you do it in this colour or that colour? How long will it take? When is the earliest you could fit me in?\" All the questions that are edging closer to a deal.\n\n Right now I get 10% of every closed deal.\n\n**Main performer:**\n\n* A car security landing page, took 5 months to build up to \\~£30k/month revenue\n* I take 15% commission = £4.5k monthly income\n* Spend £1k a month on Google Ads for this campaign\n* Getting more and more leads from LLMs like ChatGPT and Perplexity\n\n**The irony:**\n\nMy main business is actually building landing pages for others, but here I am, having become my own best customer - using landing pages to test and drive leads. I can't even fathom how many clients I would need to get to £4.5k a month versus doing the same amount from one landing page.\n\nSometimes the biggest barrier to testing a business idea isn't the market, it's convincing yourself you need all the infrastructure first.\n\nA well-crafted landing page lets you validate demand and understand your market. Then you can decide, do you actually want to do this physical business, or just let someone else do it.\n\n[Testing my car wrapping landing page](https://preview.redd.it/g3n8mnkavppf1.png?width=3133&format=png&auto=webp&s=a488e20a61b0a71bfd4ece24d31dd49052ff2fd5)\n\n",
        "subreddit": "Entrepreneur",
        "author": "Y0gl3ts",
        "score": 195,
        "num_comments": 102,
        "created_utc": 1758112011.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1njbqba/i_tested_a_business_idea_with_just_a_landing_page/",
        "fetched_at": "2025-09-18T08:15:18.609004"
      },
      {
        "id": "1nj9z05",
        "title": "found an interesting tool on hugging face that removes watermarks",
        "selftext": "I was going down a rabbit hole on hugging face the other day and stumbled on a project called NoWatermark. it’s basically an ai tool that takes in an image and removes the watermark from it. the crazy part is that it actually does a decent job on most images i tested.\n\nmade me think about how fast these little experiments are turning into products. hugging face spaces makes it super easy for devs to launch something that looks and feels like a live tool without worrying much about infra. even if the project is small, it shows how quickly an idea can be put in front of users.\n\nthe link if you wanna check it out: https://huggingface.co/spaces/abdul9999/NoWatermark\n\ncurious what you all think about tools like this in the context of saas. do you see something like watermark removal being turned into a legit service (for photographers, designers, or even cleaning up old archives), or do you think it always runs into copyright/legal walls? feels like there’s a fine line between useful and misuse here.\n\nalso wondering how people approach the “ethics vs demand” problem when building tools. like, just because you can build it and people will use it, should you?\n\nwould love to hear your thoughts.",
        "subreddit": "SaaS",
        "author": "krispwah_destination",
        "score": 178,
        "num_comments": 4,
        "created_utc": 1758106808.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nj9z05/found_an_interesting_tool_on_hugging_face_that/",
        "fetched_at": "2025-09-18T08:15:19.931969"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 147,
        "num_comments": 177,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-18T08:15:24.478495"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 143,
        "num_comments": 39,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-09-18T08:15:24.478459"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 112,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-18T08:15:24.478498"
      },
      {
        "id": "1njtc4i",
        "title": "A Practical founder toolkit to Get Your First 100 Users for $0",
        "selftext": "Many of us have 2-3 great products, but struggle to promote it. Here’s a simple founder toolkit playbook to help you get your first 100 users without a marketing budget:\n\n**Launch even on Moon**\n\n* Launch on Product hunt\n* Post on Betalist\n* Launch on Peerlist\n* Share in \"Show HN\" on Hacker News\n* Launch on Uneed\n* Share in “Products” on Indie Hackers\n* Showcase on [r/S](https://www.reddit.com/r/SideProject/)aaS \n* Submit to Product Hunt\n* Launch on Microlaunch\n* [Get listed on 200+ directories](http://getmorebacklinks.org) like above ones \n\n**Build in Public on Twitter, Reddit, Linkedin, even on friends whatsapp group**\n\n* Show what you’re building with videos, screenshots and updates.\n* Post product updates, success and failures.\n* Ask for feedback on specific features, ask them to review and roast.\n* Share testimonials and case studies + learnings \n* Celebrate your wins and others wins \n* Follow 25-30 top accounts in your niche and engage with their posts\n\n**Become part of the Game**\n\n* Scan X, Linkedin and Reddit for relevant conversations, dont even leave facebook and discord.\n* Track competitor mentions, search for keywords, and intent words.\n* Track keywords related to the problem you solve, see google trends and searches.\n* Look for mentions of specific features\n* Get alerts for your product’s category\n* Contribute meaningfully, share your product and disclose your affiliation\n\n**Start SEO on day 0**\n\n* Write \\[competitor\\] alternative pages\n* Publish feature pages\n* Get listed on as many startup directories possible \n* Write \\[competitor\\] pricing pages\n* Create templates/examples galleries\n* Turn your FAQs into blog posts\n* Write \\[competitor\\] coupon/discount code pages\n\nAnd if you find this too vague and want something more actionable, well, that’s why I wrote complete [playbook](http://foundertoolkit.org) to go from 0 to $10K MRR. \n\n*Let's Build like MADMAN.. wohoo!*",
        "subreddit": "SaaS",
        "author": "Getmorebacklinks",
        "score": 107,
        "num_comments": 71,
        "created_utc": 1758153435.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1njtc4i/a_practical_founder_toolkit_to_get_your_first_100/",
        "fetched_at": "2025-09-18T08:15:19.931950"
      },
      {
        "id": "1niiql5",
        "title": "What happens when you reject a $20M acquisition offer (i will not promote)",
        "selftext": "A $20M offer for a company barely generating revenue. You reject it.\n\nAre you crazy, or are you ambitious?\n\nWhat are your thoughts on these insane valuations and the choice between a life-changing exit and doubling down on a long-shot? Not sure whether founders are crazy or people buying them outright.",
        "subreddit": "startups",
        "author": "pmv143",
        "score": 95,
        "num_comments": 95,
        "created_utc": 1758032212.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1niiql5/what_happens_when_you_reject_a_20m_acquisition/",
        "fetched_at": "2025-09-18T08:15:21.414515"
      }
    ]
  }
}