{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-12T01:01:09.377784"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-12T01:01:00.672480"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-12T01:01:00.206916"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-12T01:01:00.206934"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-12T01:01:00.206932"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-12T01:01:00.206926"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-12T01:01:00.672477"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-12T01:01:00.672484"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-12T01:01:00.672482"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-12T01:01:00.672464"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-12T01:01:00.206929"
      }
    ],
    "reddit": [
      {
        "id": "1pjnfaf",
        "title": "I quit my $300k finance job at 30 because I finally admitted I hated it - and the lifestyle downgrade has been absolutely brutal.",
        "selftext": "For 7 years I pushed through a career that looked great on paper but made me miserable. I finally walked away this year. No dramatic blow up, no big revelation, just the quiet realization that I could not keep pretending I enjoyed it.\n\nSince then, I bought half of a 40-year-old family business and started building a Miami-focused real estate platform. (Both sites were basically vibe coded by me with basic programming experience. Hiring them out would have been over $100k - irrelevant detail).\n\nWhat has been insane is the lifestyle freefall.\n\nI was always scared to become an entrepreneur because of this exact thing. Now I am living it.\nOne business is profitable but still early stage. The other is a startup that needs heavy lifting.\nBoth require marketing, ads, experiments, money going out before money comes in.\nI underestimated how competitive it is just to get attention. Meta ads, Google ads, creative testing, all of it. I really thought I could just show up and grow something. Absolutely delusional.\n\nThe hardest part?\nIgnoring the headhunters calling with mid six figure jobs.\nI know I can go back. I know I can make money tomorrow. But that is the life I spent years trying to escape.\n\nAnd then there is the identity shift.\nTelling girls I am building companies instead of being the finance guy at a big fund.\nNot casually dropping $200 on sushi like it is nothing.\nNot skiing every winter.\nNot having that easy, comfortable narrative of I am doing well.\n\nIt is humbling. Honestly, some days it is embarrassing. I did not expect it to hit this hard.\n\nBut I also have so much respect now for entrepreneurs who stuck through this phase and made it work. You do not realize how much grit it takes until you are the one staring at the ceiling at 3AM wondering if you are insane.\n\nRant over.\n\nWould love to hear if anyone else went through this identity and lifestyle whiplash when switching from a high paying job to entrepreneurship.",
        "subreddit": "Entrepreneur",
        "author": "robbinh00d",
        "score": 2241,
        "num_comments": 462,
        "created_utc": 1765424168.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pjnfaf/i_quit_my_300k_finance_job_at_30_because_i/",
        "fetched_at": "2025-12-12T01:01:01.512856"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 486,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-12T01:01:08.376437"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 438,
        "num_comments": 127,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-12T01:01:08.376475"
      },
      {
        "id": "1pjf8um",
        "title": "I Sold my Cleaning Business After 5 Years!",
        "selftext": "After 5 years of starting and growing a cleaning business, I recently just signed the dotted line to sell it! I have officially exited my first business!\n\nFunny to think I stumbled across a Reddit post about starting a cleaning business and did everything that it said lol. Shout out Rohan and anyone who got started from that thread.\n\nIt only felt right to make this post on Reddit because this is where it all started.\n\nThis post isn’t a “how to start a cleaning business” or anything, just sharing a few things from my journey. If you have questions you can ask away!\n\nWhen I started, it was at the beginning of the “remote cleaning business” model era. It took me time to get the business started because I was in college. Once I cracked marketing, which was right before I graduated back in 2021, things began to roll.\n\nApril 2021 I had my first 10-cleaning month. June I had my first 20-cleaning month and July we went up to 30 cleanings. I was all in on the business since then. It was my full-time job, but it was more like a full-time masterclass on business, MBA and the gulag you go through as an entrepreneur. I’m 26 years old now and since starting the business I’ve grown so much when I sit back and reflect. I’m no guru either! I’m from Detroit, I moved to Atlanta to go to Morehouse College, I started my cleaning business my senior year, and since graduating I’ve spent my life up to this point of writing this running the business. \n\nAt the height of the business, which is when I decided it was time to sell, I had the business operating on a chaotic rope.\n\nI had residential cleaning customers and commercial contracts . At one point we had a number of Airbnb properties we did cleaning for and at another point operated all three at the same time. (Was a freaking zoo!) I had a great office manager named V who was the sweetheart and pitbull for me and the business. I had a great team & rolodex of cleaners who, after all the mayhem, worked with us for multiple years at a time. When it was time to ascend, we eventually got another star named J who was our sales rep alongside me.\n\nThe business was at a point where a majority of the business was operating on a system and I checked on everything from my phone.\n\nThis is the point where I decided to package up and get the business on the market for my own personal reasons.\n\nIt’s so much that I learned from running a cleaning business, but these things are the most important that im about to share. \n\n**Live and die by your cleaners.**\n\nIt took me years to understand why the cleaners are the most important part of the business. When I started I thought you could just hire a cleaner by the snap of a finger and when I did that I almost lost every time. The cleaners are the backbone of the business. They are the make or break point. It’s necessary to appreciate when you come across great cleaners and keep them busy. Understand that when customers hire a cleaning service that’s a very serious buying decision for them. Imagine a customer books you, you send an unqualified cleaner and the customer is unhappy and never books with you again. That’s what happened with me until I started bringing on good talent.\n\nMany will say the most important aspects of the cleaning business are marketing and you need to focus on growing, but the hidden marketing lever is having some Vini’s and Itsmenia’s on your team. That’s what I had. I had cleaners that people knew and loved. When you have that you can almost hit a money glitch. Literally your business can grow through word of mouth the proper way. The cleaners were most important. It’s a grind at first but once you find that space cherish and respect it.\n\n**The power of niching is a great power!**\n\nWhen I first started the business I used Thumbtack, I used Yelp, I passed out flyers, I DID EVERYTHING! It all brought in clients. We did whatever because I was hungry and I needed to pay the bills. I didn’t have any other job, I did the cleaning business full time, so if you called we were going to clean it. It took me until about year 2 to understand the power of niching.\n\nWhen I finally understood, it’s like we hit another money glitch. Business got a little easier and we gained more money that made complete sense! I figured out which customer we were going to serve. We had services tailored only to their problems and aligned our systems towards solutions for only the problems they had. When I did this people found us vs us looking for them. When things got slow of course we always got back out there and took whatever that made sense, but we stayed true to the niche we chose and that’s when I started benefiting and growing the biz.\n\n**It will behoove you to become a local superstar!**\n\nIf you run any type of business and you get customers that are paying you cold hard cash and using your services or whatever you sell, pat yourself on the back! Because people online make it like getting customers in your business is easy the shit is not easy! It’s only when you finally crack it is when it becomes easy like playing a video game.\n\nWhat I realized is that you have to become a local superstar and get your business out there as much as possible. You need to shout and let everybody know what you got going on. IDC who it is because when you do, eventually you will become known for what you are doing. That’s what happened with me. I let everybody and their mother know about my cleaning business. Not only that, I invested heavily into my marketing skills.\n\nHere are the areas I can turn on with a push of a button (Facebook Ads, Google Ads and SEO, and Thumbtack and please don’t put me in a room full of people because I will get business from an event too). I will go over this in a moment. But becoming a local superstar and known for what you do is a compounding effort. If you take your business serious the support you get is the gift you receive from being undeniable. I lasted 5 years, you will be surprised how many people don’t even start. People will recognize you! People will need you and soon people will start calling you. It’s up to you to step to the plate and perform.\n\n**You need flow.**\n\nWhenever I expressed hardship in my business, my friend who runs a million dollar + landscaping business would always say fill up your pipeline. A pipeline in business does solve problems and should not be approached lightly. I will say you need to approach this as if someone is trying to take literal food from your loved one’s mouth. As if it’s life or death because truly if you aren’t getting customers you will eventually go flat. This means you need customers coming in from multiple areas.\n\nWhat I did was have paid ads and organic flows. For each area I put a system in place. I learned and put time into each area and it wasn’t all at the same time either. It started with the platforms like thumbtack, then I got decent with organic social media, decent with paid ads (FB & Google Ads), then I met the Yoda of Online Marketing, SEO. I wasn’t good at the beginning but over time I got good at each stop, built a system around it and kept it going. I’m not saying go and do all of this because it’s time consuming.\n\nWhat I am saying is that each system that got built all went into either the residential pipeline or commercial pipeline. My main goal was to get new people in the doors that I can talk to. I kept my pipeline full! \n\nA glitch is letting people know about your cleaning business on stage at local events. I constantly went to business events around ATL and every chance I got I grabbed the microphone and introduced my business with everyone looking. At these events people have bumrushed me for my information, to the point where I had my iPad ready to collect info and sell on spot. Take that information and do with it what you will.\n\nThen I began to get the soulful nod that it was time for me to depart from the cleaning business. It was such a journey. I once read in a book that once you finally get your business to the point where it’s running without you and things change, you can become more motivated to continue to grow that business. Not me. I’m forever grateful to the cleaning industry and have no ill will towards it, but I was able to see that it was time to go elsewhere.\n\nThe journey led me to the stop to sell my business and on Nov 3rd, after months of work to sell the business, a contract was signed! At that moment the relief I felt was so reassuring that I hit a money dance! \n\nI’m so happy to have been in the industry and started my business journey here!\n\nFor all the cleaning business owners and aspiring, keep pushing! This is an industry that is in demand. A cleaning business is a business that can provide you with whatever you need during the time of your life. Need extra money? Pick up a few houses to clean. Want to build a multi million dollar cleaning business? You can literally sign a few contracts and be at a million with a cleaning business. It’s whatever you want it to be. Not saying it’ll be easy but the money is there!\n\n\n\nI wish you all luck! And if you read this far, thank you!",
        "subreddit": "Entrepreneur",
        "author": "yuiev",
        "score": 281,
        "num_comments": 78,
        "created_utc": 1765402388.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pjf8um/i_sold_my_cleaning_business_after_5_years/",
        "fetched_at": "2025-12-12T01:01:01.512864"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 148,
        "num_comments": 30,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2025-12-12T01:01:08.376451"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 97,
        "num_comments": 64,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2025-12-12T01:01:08.376448"
      },
      {
        "id": "1pju460",
        "title": "just understood what \"network is net worth\" actually means",
        "selftext": "okay so my classmate at masters union, raised $1.5M for his startup.  and the investor is our alumni. i have been hearing \"build your network\" since day one but always thought it meant linkedin connections and coffee chats.\n\ni didn’t realize it meant your batchmate could literally become the person writing you checks and now suddenly all those alumni mixers and networking events feel way more important.",
        "subreddit": "Entrepreneur",
        "author": "YogurtIll4336",
        "score": 88,
        "num_comments": 31,
        "created_utc": 1765448298.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pju460/just_understood_what_network_is_net_worth/",
        "fetched_at": "2025-12-12T01:01:01.512860"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 77,
        "num_comments": 53,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-12T01:01:08.376495"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 60,
        "num_comments": 21,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-12T01:01:08.376469"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 58,
        "num_comments": 54,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-12-12T01:01:08.376499"
      }
    ]
  }
}