{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-07T08:16:49.204241"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-07T08:16:40.084652"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-07T08:16:40.084654"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-07T08:16:39.688527"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-07T08:16:39.688534"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-07T08:16:39.688512"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-07T08:16:40.084647"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-07T08:16:40.084650"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-07T08:16:39.688530"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-07T08:16:40.084637"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-07T08:16:39.688532"
      }
    ],
    "reddit": [
      {
        "id": "1nznqc5",
        "title": "I made my first $1.... from farts",
        "selftext": "So I built this random website where people can log their farts and see them on a World Fart Leaderboard. It started as a joke, but I figured if it was weird and specific enough, people might actually use it. I added meal tracking, a “stinkiest day” insight, and some affiliate links for gut health stuff just to see what would happen. Now there are over 1,600 farts logged from 60 countries... and today I made my first $1. It’s not much, but that was the goal. Just make one dollar from something I built. Feels kinda surreal.\n\nNext goal: $1,000.",
        "subreddit": "Entrepreneur",
        "author": "Most_Passage_6586",
        "score": 485,
        "num_comments": 130,
        "created_utc": 1759767781.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nznqc5/i_made_my_first_1_from_farts/",
        "fetched_at": "2025-10-07T08:16:41.012006"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 453,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-07T08:16:48.202828"
      },
      {
        "id": "1nzhiay",
        "title": "A founder offered a user 50% off for life. His reason for leaving was a brutal lesson on churn.",
        "selftext": "I have a rule. When I take on a new SaaS client, I have to sit in on one of their cancellation calls. Unfiltered to get the idea.\n\nLast month, I’m on a Zoom with a founder. He’s trying to save a user who's about to churn and he offered a massive, permanent discount. He was basically giving it away.\n\nThe customer politely said no.\n\nFrustrated, the founder asked why and the customer’s answer completely changed how I approach growth for my clients.\n\nThe user said, \"Look, the tool is good, but I'm the only one on my team who uses it. It's not plugged into our Slack or our CRM, so every Monday I have to consciously remember to log in and do the work. It feels like an island.\"\n\nThat was it. The whole problem is this.\n\nThe founder was trying to sell on features and price, but It wasn't about price. It wasn't about a missing feature. It was about workflow.\n\nThe product was a single land and It made the user feel inefficient and alone, and a tool that makes you feel that way gets cut. \n\nSince that call, the first thing I audit isn't a client's ad spend or their fancy sales deck or procedure. It's their **onboarding.**\n\nyou can't win people back with discounts. You lost them the moment they signed up and felt like they were working in an empty place, and they had to like \"I have to figure this out by myself\".",
        "subreddit": "SaaS",
        "author": "Aman458",
        "score": 193,
        "num_comments": 71,
        "created_utc": 1759753277.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nzhiay/a_founder_offered_a_user_50_off_for_life_his/",
        "fetched_at": "2025-10-07T08:16:42.893591"
      },
      {
        "id": "1nz38j6",
        "title": "VCs: \"We invest at the earliest stage!\" (But also, where's your traction?) I will not promote",
        "selftext": "Love how every accelerator and VC firm plasters \"pre-seed\" and \"earliest stage\" all over their website... then the first question in the application is about your MRR.\n\nLook, I get it. Risk mitigation. Due diligence. Blah blah blah. But can we just be honest about what \"earliest stage\" actually means anymore? Because it sure as hell doesn't mean \"idea stage\" or even \"MVP stage.\" It means you've already validated product-market fit, have paying customers, show growth metrics, and probably survived on ramen for two years bootstrapping.\n\nThe real translation guide:\n\n* \"No traction required\" -> You need traction\n* \"We invest in pre-seed\" -> We invest in seed-stage companies we're calling pre-seed\n* \"Founder-friendly\" -> We'll ghost you for three months then send a form rejection\n\nMeanwhile, founders are out here thinking they're doing something wrong because they can't raise at the \"earliest stage\" when they're... you know, actually at the earliest stage.\n\nJust once I'd love to see a VC website that says: \"We invest in companies that already figured it out and just need capital to scale faster.\" At least that would be honest.\n\nAm I missing something here, or has everyone just agreed to redefine what \"early\" means and forgot to tell the actual early-stage founders?",
        "subreddit": "startups",
        "author": "JFerzt",
        "score": 172,
        "num_comments": 67,
        "created_utc": 1759706274.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nz38j6/vcs_we_invest_at_the_earliest_stage_but_also/",
        "fetched_at": "2025-10-07T08:16:44.626071"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 172,
        "num_comments": 46,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-07T08:16:48.202884"
      },
      {
        "id": "1nz7nn3",
        "title": "I feel the \"young entrepreneur\" hype is undeserved",
        "selftext": "And that \"older\" (30-40+) entrepreneurs are overlooked or at least feel that way.\n\nThe press loves to sensationalize the young guys making $X in an impressively short timeframe but, \n\n1) a lot of luck is often involved and we don't know how long this person will last \n\nand \n\n2. I feel it can discourage people who are a bit older (even 23yo's who see 16yo making impressive $X figures w dropshipping or tiktok shop or whatever) .\n\nAge brings more experience, better judgement, ability to weather ups and downs.\n\nAlso, an MIT Sloan study cites that the average age for the most successful high growth companies is...around 45.",
        "subreddit": "Entrepreneur",
        "author": "broseidonswrath",
        "score": 167,
        "num_comments": 57,
        "created_utc": 1759718795.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nz7nn3/i_feel_the_young_entrepreneur_hype_is_undeserved/",
        "fetched_at": "2025-10-07T08:16:41.012046"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 162,
        "num_comments": 52,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-07T08:16:48.202872"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 147,
        "num_comments": 180,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-07T08:16:48.202915"
      },
      {
        "id": "1nyle40",
        "title": "Where are the GenZ multi millionaires and billionaires ? I will not promote",
        "selftext": "For the first time, none of the Forbes Billionaires aged under 30 are self made.\nMark zuckerberg became a billionaire at age 22. Where are the GenZ self made billionaires or multi millionaires and in what industry are they mostly ?\nDid content creation replace startups as the fastest way to riches for young people ?",
        "subreddit": "startups",
        "author": "Financial-Ad-6960",
        "score": 128,
        "num_comments": 95,
        "created_utc": 1759662534.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nyle40/where_are_the_genz_multi_millionaires_and/",
        "fetched_at": "2025-10-07T08:16:44.626094"
      },
      {
        "id": "1nzgmsw",
        "title": "Most of you just don't want to do the work - i will not promote",
        "selftext": "I put out a post recently where I said you shouldn’t hold off your company to look for a a co-founder, and that the best thing you can do is to start building and people will find you.  \n  \nThe response to that just made it clear to me that most of y’all love hiding behind the excuse that you \"don’t have what you need to start\", and that’s precisely why you aren’t going to make it.  \n  \nHere’s another thing you need to learn as a founder - if your idea needs a technical co-founder or capital to get off the ground isn't immediately available to you, chances are that it’s not the best idea for you to be working on right now.  \n  \nThe best idea for you isn’t the objectively best idea, it’s the one you can actually execute on with your current unfair advantages.  \n  \nA good idea isn’t just about market size or originality. It’s about execution. And execution depends on you.  \n  \nSo if your idea needs you to chase people far outside your orbit or capital you don’t have, pick a smaller idea. Else, I guarantee you won’t make it.",
        "subreddit": "startups",
        "author": "ssk012",
        "score": 115,
        "num_comments": 56,
        "created_utc": 1759750737.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nzgmsw/most_of_you_just_dont_want_to_do_the_work_i_will/",
        "fetched_at": "2025-10-07T08:16:44.626052"
      }
    ]
  }
}