{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-17T16:16:45.982609"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-17T16:16:37.221894"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-17T16:16:36.827890"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-17T16:16:36.827893"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-17T16:16:36.827876"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-17T16:16:37.221892"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-17T16:16:37.221896"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-17T16:16:36.827898"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-17T16:16:37.221881"
      },
      {
        "videoId": "MLBwqLcazYY",
        "title": "Bookkeeping 101 for Small Business (EASY EVEN IF YOU KNOW NOTHING ABOUT ACCOUNTING)",
        "description": "BOOKKEEPING 101 FOR SMALL BUSINESS (EASY EVEN IF YOU KNOW NOTHING ABOUT ACCOUNTING) // Do you wonder ...",
        "channelTitle": "Jill Gockel",
        "publishedAt": "2019-09-10T11:17:27Z",
        "url": "https://www.youtube.com/watch?v=MLBwqLcazYY",
        "fetched_at": "2025-11-17T16:16:37.221897"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-17T16:16:36.827895"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 480,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-17T16:16:44.981237"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 186,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-17T16:16:44.981283"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 176,
        "num_comments": 34,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-17T16:16:44.981263"
      },
      {
        "id": "1ozezyj",
        "title": "Tried a face search tool and it made me think about how SaaS products handle public data.",
        "selftext": "I was testing some AI based tools to learn how different SaaS products work with large public datasets, and one of the tools I tried was a face search engine called FaceSeek. I uploaded an old photo just to see how it behaved, and FaceSeek ended up showing a few images of me from accounts I honestly forgot ever existed.\n\nIt really made me think about how much public data a SaaS tool like FaceSeek has to work with and how much engineering goes into making the search fast, accurate and still respectful of privacy. It also reminded me that our old content stays discoverable online far longer than we expect.\n\nThis is not a promotion. It was just an interesting moment that made me appreciate how complicated data heavy SaaS products can be. I would love to hear if anyone here has worked on something similar or dealt with large scale indexing or matching systems.",
        "subreddit": "SaaS",
        "author": "mugiwaranogoffy",
        "score": 95,
        "num_comments": 6,
        "created_utc": 1763382594.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ozezyj/tried_a_face_search_tool_and_it_made_me_think/",
        "fetched_at": "2025-11-17T16:16:39.736482"
      },
      {
        "id": "1oyvw56",
        "title": "My AI saas failed after 7 months of work",
        "selftext": "I had an idea for an AI SaaS after I saw that about 70 million people search monthly for my topic. I built the product. I worked hard on design, user experience, and fine-tuning the model. I made a marketing plan and launched.\n\nResult at first: zero visitors, completely normal.\n\nI kept going. I worked on SEO. I made four TikTok reels per day, but my target users were not there. I switched to Instagram. I got more engagement, but still no real results.\n\nI tried Google Ads. The first ad campaign was banned. I opened a second account, fixed everything that could cause a ban, and it got banned again. I tried a third account and did not take it very seriously. That one was approved🙂. Still, the campaign did not bring the right users (not a serious campaign and low budget).\n\nI also tried social media campaigns. I posted AI videos, human videos, and memes... I used every tip I found online. The max views I got on a reel were 10k. Most comments were GIFs or random things.\n\nI worked on backlinks. I made a list of 100 sites where I could publish. I wrote many posts and blogs and shared them. Nothing moved. I tried X with four followers, so you can guess the result :)\n\nRight now I have about 100 registered users and around 3k visitors in total. I have zero revenue. I make updates every day to improve the model and SEO, and UX. Friends, volunteers, and testers tried it and gave positive feedback. It works for them. The problem seems to be visibility and finding the right users who are willing to pay.\n\nI am not writing this to discourage anyone from starting an AI SaaS. I am sharing the reality. Not every AI product makes millions of dollars in the first month. Sometimes you fail, and u need money or a strong base of followers or a community.\n\nI am not stopping. I will keep improving the site until it makes its first dollar. If it does not, I will move on when I find a better idea.",
        "subreddit": "SaaS",
        "author": "Ok-Snow-2462",
        "score": 93,
        "num_comments": 226,
        "created_utc": 1763324119.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1oyvw56/my_ai_saas_failed_after_7_months_of_work/",
        "fetched_at": "2025-11-17T16:16:39.736504"
      },
      {
        "id": "1ozbz28",
        "title": "What’s a service you happily pay for every month because it keeps your business running smoothly?",
        "selftext": "We always talk about the things we build or recommend, but what about the ones we personally rely on? Whether it’s a time-tracking app, a marketing agency, or an accounting platform. What’s that one service you’d never cancel in the near future because it makes your life easier?\n\nDrop your must-have services, let’s share the real game-changers for business owners.",
        "subreddit": "Entrepreneur",
        "author": "Activeshadough",
        "score": 87,
        "num_comments": 81,
        "created_utc": 1763371974.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ozbz28/whats_a_service_you_happily_pay_for_every_month/",
        "fetched_at": "2025-11-17T16:16:38.033940"
      },
      {
        "id": "1oz498l",
        "title": "Do we actually need GDPR compliance if all our customers are in the US?",
        "selftext": "Hi all. We're a 7 person Saas and literally every customer we have right now is US based. Yesterday a potential customer from our email list (turns out they're based in London) asked if we're GDPR compliant and honestly I didn't even know how to answer.  \nI did some reading and now I'm confused because some articles say if you have ANY EU users you need it and others say it depends on how you're processing data or something? We don't specifically target EU customers but we also don't block them from signing up.\n\nOne of our engineers said we should just add a cookie banner and call it a day but I don't want this because I'm essentially thinking longterm (having EU clients as well). Another founder told me GDPR is like a massive undertaking with DPAs and data mapping and all this stuff that would take months.  \nHas anyone dealt with this as a tiny team? Did you wait until you actually had EU revenue to worry about it or did you do it preemptively? I don't want to ignore it if it's actually required but also can't afford to spend 3 months on compliance right now. Any advice is appreciated",
        "subreddit": "SaaS",
        "author": "OkButterscotch1192",
        "score": 74,
        "num_comments": 52,
        "created_utc": 1763345715.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1oz498l/do_we_actually_need_gdpr_compliance_if_all_our/",
        "fetched_at": "2025-11-17T16:16:39.736489"
      },
      {
        "id": "1oyu1ee",
        "title": "Just got laid off from a sales job. Feel quiet good actually.",
        "selftext": "I applied for a sales job for the sake of getting pay stubs to process papers for my wife.\n\nI got laid fired the 2nd week and now I was thinking of just fully committing to my business and getting it registered. I make 5 digits monthly from the two gigs and Im scaling them up to this day. The problem is the process for getting it registered is so quiet complicated. \n\nIts basically under the table and i have no proof of income coming from it. Cause I sell products in fb marketplace or through friends and network. I have coding background aswell. And i want to try something new. Got fired yesterday but im going to be celebrating tonight for reaching $500k earnings from my gigs. Im the only one who knows this and i just want to share it with strangers here in reddit.\n\nI cant share it with family or friends cause I feel like its wrong, its going to change my life and attitude for the worse because of pressure of trying to maintain my successful image , but at the same time i want to share my success or to brag maybe? Reddit became kind off my therapy and therapist.\n\nToday is a good day. I enjoyed the ferry ride and the scenery. Im gonna be trading some motherboards for PSUs and SSDs and once i come back home, im gonna say sorry to my wife and come clean. Have a good day fellas! \n\n",
        "subreddit": "Entrepreneur",
        "author": "papatender",
        "score": 71,
        "num_comments": 20,
        "created_utc": 1763319781.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oyu1ee/just_got_laid_off_from_a_sales_job_feel_quiet/",
        "fetched_at": "2025-11-17T16:16:38.033971"
      },
      {
        "id": "1o40fm7",
        "title": "As someone who works from home, how do you socialise? or meet new people/make friends?",
        "selftext": "I am working from home, a 27F. Honestly it gets boring and i dont have any friends in here in my hometown. I have lived in hostel since 15 and hence havent made any friends here.\n\nMy hometown is also not a lively place with meetups or activities happening, so it just becomes difficult for me.\n\nAny other way to socialise? maybe any online ways? Please suggest.\n\nUpvote1Downvote1Go to comments  \n",
        "subreddit": "freelance",
        "author": "This-Brief6214",
        "score": 64,
        "num_comments": 64,
        "created_utc": 1760201179.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o40fm7/as_someone_who_works_from_home_how_do_you/",
        "fetched_at": "2025-11-17T16:16:44.981298"
      },
      {
        "id": "1ozeilq",
        "title": "The worst part of corporate life isn't the hours",
        "selftext": "I'm so exhausted from working this 9-to-5 job with incompetent people who bark orders without considering the whys or hows, just throwing around random demands to stroke their egos as supervisors and pretend they're being productive. \n\nTo me, this is by far the worst part of being a corporate slave. \n\nIt's not waking up every day to go to work, or even not having the financial situation I want. \n\nIt's working with clueless people who tell you to work in idiotic ways while thinking they're intellectually superior. It's incredibly frustrating.\n\nI'm trying to escape this situation by starting my own business. \n\nCould anyone who has successfully escaped the rat race tell us what freedom feels like? \n\nI need some motivating words.",
        "subreddit": "Entrepreneur",
        "author": "Salt-Sea-8685",
        "score": 41,
        "num_comments": 28,
        "created_utc": 1763381116.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ozeilq/the_worst_part_of_corporate_life_isnt_the_hours/",
        "fetched_at": "2025-11-17T16:16:38.033942"
      }
    ]
  }
}