{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-09T08:13:57.076414"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-09T08:13:48.192465"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-09T08:13:47.948454"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-09T08:13:47.948446"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-09T08:13:47.948429"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-09T08:13:48.192458"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-09T08:13:48.192463"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-09T08:13:48.192461"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-09T08:13:47.948450"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-09T08:13:48.192446"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-09T08:13:47.948448"
      }
    ],
    "reddit": [
      {
        "id": "1ornkq4",
        "title": "Why does the Palantir CEO talk in riddles? Is it to hide they dont have industry knowledge?",
        "selftext": "Palantir is very secretive about what they do but when you look into the CEO, he has no tech or math background. \n\nAre they just middlemen orchestrating deals? Whenever they are asked what they do, they name-drop and talk in riddles, \"US Military, CIA, FBI\" etc, but zero actual evidence they provide any solutions in the space or have deep industry knowledge. \n\nI just find it impossible for a philosophy major to lead actual talent (I know, because I have a tech company)...... or better yet, take the Chinese on. The Chinese dont cherish autistic dropouts like we do here in the US.\n\nHow does one lead an industry they have no qualified education in?",
        "subreddit": "Entrepreneur",
        "author": "Heidi_PB",
        "score": 669,
        "num_comments": 267,
        "created_utc": 1762602894.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ornkq4/why_does_the_palantir_ceo_talk_in_riddles_is_it/",
        "fetched_at": "2025-11-09T08:13:49.069663"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 472,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-09T08:13:56.075027"
      },
      {
        "id": "1or3gas",
        "title": "We have 5 subscriptions of the same software because nobody talks to each other",
        "selftext": "Just did an audit of our software spending because our burn rate seemed way too high\n\n  \nIt turns out that we're paying for 5 separate subscriptions to Notion across 3 different credit cards. Some are individual plans, some are team plans and one is an enterprise plan that nobody is even using\n\n  \nHow does this happen? I'll tell you how it happens. It's because different teams just sign up for shit without even CHECKING if we already have it. Marketing has their own. Engs have their own. Sales has their own. Even our 2 person HR team has their own workspace\n\n  \nI added it all up and we're spending like $900 per month on Notion when we could have one enterprise plan for close to 500\n\n  \nAnd it's not just Notion btw. We have multiple Zoom accounts, 3 different Figma subscriptions, 4 ChatGPT plus accounts (why???) amd 2 AWS accounts that are both being used for different projects\n\n  \nI brought this up to our COO and he just shrugged and said that that's what happens when you grow fast what an answer hahahaha",
        "subreddit": "smallbusiness",
        "author": "NoCommittee4973",
        "score": 461,
        "num_comments": 63,
        "created_utc": 1762542956.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1or3gas/we_have_5_subscriptions_of_the_same_software/",
        "fetched_at": "2025-11-09T08:13:54.250082"
      },
      {
        "id": "1orff25",
        "title": "Amazon is getting ridiculous and rewarding petty thieves with both product and their money back.",
        "selftext": "So here’s what happened.\n\nI sold a handmade sculpture on Amazon, something I put a lot of time and care into. The buyer, a woman named Emily, got it just fine. Then out of nowhere, she messages me saying she wants to return it because it “looks better at a lower level.” Her exact words were basically that the eyes looked off when she put it higher up.\n\nI told her nicely that I can’t take it back for that reason. The piece looks exactly like the photos, and I’m not a big company that can just eat losses because someone didn’t like how it looked on a shelf. I’m one person making and shipping these myself.\n\nShe didn’t like that. She got defensive, saying my question “didn’t make sense” and that the “advertising didn’t match her hopes.” Whatever that means.\n\nThen she started opening return cases. Three of them. Each time she gave a new reason. The last one? She claimed the item was “defective.” Totally false. Nothing wrong with it, she just didn’t like how it looked where she put it.\n\nAnd guess what? Amazon **refunded her in full** without even checking if she returned it. She didn’t. She still has the piece and the money.\n\nSo now I’m out the cost, the time, and the product, all because someone abused the return system and Amazon just automatically sided with her. No evidence, no verification, nothing.\n\nI reported everything to Amazon and posted about it on the forums because this is getting ridiculous. I followed every rule. The listing was accurate. The photos were clear. And yet somehow, a customer can just say “defective” and walk away with both the product and a full refund.\n\nI’m honestly just fed up. This kind of thing might be nothing to a big company, but for a small artist, it hurts.",
        "subreddit": "smallbusiness",
        "author": "shervintwo",
        "score": 397,
        "num_comments": 88,
        "created_utc": 1762573936.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1orff25/amazon_is_getting_ridiculous_and_rewarding_petty/",
        "fetched_at": "2025-11-09T08:13:54.250043"
      },
      {
        "id": "1orspcw",
        "title": "Our API usage spiked 400% overnight, and I don’t know why",
        "selftext": "Checked logs. One customer is hitting our endpoint 50k times per day.\n\nThey’re on a $49/month plan.\n\nOur AWS bill is $340 for just them this month.\n\nDo I contact them? Implement rate limiting? Both?\n\nTurns out “unlimited API calls” was a terrible idea.\n\n",
        "subreddit": "SaaS",
        "author": "Several_Function_129",
        "score": 191,
        "num_comments": 105,
        "created_utc": 1762616926.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1orspcw/our_api_usage_spiked_400_overnight_and_i_dont/",
        "fetched_at": "2025-11-09T08:13:50.757847"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 189,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-09T08:13:56.075061"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 181,
        "num_comments": 33,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-09T08:13:56.075041"
      },
      {
        "id": "1oqqkln",
        "title": "The actual timeline of building a startup (not the LinkedIn version) - i will not promote",
        "selftext": "everyone on linkedin and reddit posts their highlights. \"we hit $1M ARR in 6 months\" or \"went from idea to profitable in 90 days.\"\n\nheres the real timeline nobody talks about:\n\nMonth 1-2: talking to users, realizing your idea is wrong  \nMonth 3: building scrappy MVP  \nMonth 4: launching the mvp  \nMonth 5-6: talking to more users, realizing the MVP is solving wrong problem  \nMonth 7-8: rebuilding based on what you learned  \nMonth 9: launching again, getting some traction  \nMonth 10-12: figuring out how to get users consistently  \nMonth 13-18: actually growing but slower than you thought  \nMonth 19-24: finally understanding your business\n\nthats if youre FAST. most take 3 years to get to that point.\n\nthe linkedin version makes it seem like 6 months idea to scale. the reality is 18-24 months idea to consistent revenue. and thats okay. the founders who accept this timeline make better decisions. the ones expecting 6 months burn out or run out of money.\n\nif you are in month 8 feeling behind you are not. you are actually on pace. just nobody talks about the real timeline.",
        "subreddit": "startups",
        "author": "ksundaram",
        "score": 178,
        "num_comments": 34,
        "created_utc": 1762510089.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oqqkln/the_actual_timeline_of_building_a_startup_not_the/",
        "fetched_at": "2025-11-09T08:13:52.547641"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 168,
        "num_comments": 59,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-11-09T08:13:56.075089"
      },
      {
        "id": "1oruxiq",
        "title": "Anybody here already \"peaked\"?",
        "selftext": "Hey folks - so i'm in my 30s, built and sold a very successful company 5 years ago. Always been self employed, never had a job - had self sustaining revenue and lived well since college. \n\nAfter exiting my last company- i spent a few years pursuing the arts - music, comedy and a social media career. I partied a lot spent money and dealt with some mental issues and that didnt really go anywhere due to issues in my personal life (wife)\n\nNow i have been working on a new business - that is somewhat similar to my old business, with learnings. \nI got into this mostly cause money running out - neccesity. vs my first company, which was very much my entire identity and a life long mission. \n\nIt seems ive lost the spark- have had a bunch of ups and downs with the new company (maybe economy? Or competition). But it feels like because i already got wealthy i have just lost that Killer instinct. \n\nMy rational mind says figure it out.  Build and sell new business and focus, then make a run on the creative endeavors again. \n\nHas anyone else \"peaked\" and gotten the spark back?",
        "subreddit": "Entrepreneur",
        "author": "OneChrisHanson",
        "score": 72,
        "num_comments": 42,
        "created_utc": 1762622322.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oruxiq/anybody_here_already_peaked/",
        "fetched_at": "2025-11-09T08:13:49.069667"
      }
    ]
  }
}