{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-03T16:18:21.136701"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-03T16:18:12.196705"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-03T16:18:11.915300"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-03T16:18:11.915302"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-03T16:18:11.915285"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-03T16:18:12.196703"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-03T16:18:12.196709"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-03T16:18:12.196707"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-12-03T16:18:11.915307"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-03T16:18:12.196692"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-03T16:18:11.915304"
      }
    ],
    "reddit": [
      {
        "id": "1pc5ix4",
        "title": "My friend got an ada demand letter and showed me the actual settlement agreement they wanted him to sign, this is insane!",
        "selftext": "My buddy runs a small shopify store, he got hit with an accessibility demand letter last month from some law firm. The initial demand was for $20k settlement plus legal fees, they sent over the actual settlement agreement template and the terms are wild beyond just the money.\nAgreement requires: bringing site into \"substantial compliance\" with wcag 2.2 level aa within the term of agreement, 24 month monitoring period where they can come back and check, if you breach any terms they can reopen the case, strict confidentiality clause so you can't even tell other business owners about the amount or terms.\nThe kicker is buried in section 4 about remediation, you have to make \"good faith efforts\" but there's no clear standard for what that means. So even after paying $20k+ and doing work, they could potentially argue you didn't try hard enough.\nI talked to a lawyer who said these agreements are designed to be vague so they can keep coming back, the confidentiality clause means most business owners can't even compare notes or warn each other.\nAnyone else seen agreements like this? Trying to figure out if these terms are standard or if this firm is extra aggressive.",
        "subreddit": "smallbusiness",
        "author": "Wtf_Sai_Official",
        "score": 992,
        "num_comments": 287,
        "created_utc": 1764672930.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pc5ix4/my_friend_got_an_ada_demand_letter_and_showed_me/",
        "fetched_at": "2025-12-03T16:18:18.273019"
      },
      {
        "id": "1pcd2ka",
        "title": "Sold 340 lifetime deals for $149 each. 18 months later I regret every one.",
        "selftext": "Needed cash to fund development. Ran a lifetime deal on AppSumo. $149 for lifetime access to a product I was charging $39/month for.Sold 340 deals in 2 weeks. $50,660 in revenue. Felt like winning the lottery.18 months later, here's the math:If those 340 customers paid monthly at even 50% of normal price ($19.50), with average 14-month retention, that's $92,820 in revenue.I left $42,000 on the table. And counting, because lifetime means forever.But the money isn't the worst part.LTD customers are my highest-support users. They submit 3x more tickets than monthly subscribers. They request features constantly. They leave 1-star reviews when I don't build what they want.They have zero incentive to churn, so they stick around complaining instead of quietly leaving.My NPS among LTD customers: 12. Among monthly subscribers: 54.And I can never raise prices on them. They're grandfathered at $0/month for life.What I'd do differently:If you need cash, offer annual plans at a discount. You get money upfront but customers still renew.If you must do LTDs, cap the number ruthlessly. 50 max. Create scarcity.Never offer lifetime on a product that has ongoing server costs. You're signing up to lose money on every user forever.The AppSumo crowd isn't your target market. They're deal hunters who buy everything and use nothing. Not ideal customers for feedback or growth.Still digging out of this hole.Anyone else have LTD regrets?",
        "subreddit": "SaaS",
        "author": "Big_Currency_1805",
        "score": 763,
        "num_comments": 226,
        "created_utc": 1764693198.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pcd2ka/sold_340_lifetime_deals_for_149_each_18_months/",
        "fetched_at": "2025-12-03T16:18:14.685822"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 490,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-03T16:18:20.135290"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 428,
        "num_comments": 124,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-03T16:18:20.135312"
      },
      {
        "id": "1pcl6h9",
        "title": "10 Years in the game... losing my mind...",
        "selftext": "Long story short, I started my business 10 years ago with a little less than $2k to my name. My original goal was just to overtake my earnings at the time of $40k/yr. In the beginning things were rough... real rough. My first 3 months were crickets drawing my bank account down to cents.. Fast forward to the 4th month and I finally got a client. Because I was so young, my overhead was minimal so one client got me by. To not bore you will my life story, I have grown the business to \\~$1M annually without taking on any outside money. The ride has been wild and I no longer perform the actual service that we offer. I have figured out how to scale a rather unscalable business in a way that really nobody else has figured out. Here is the thing... the burnout I feel is debilitating to the point where it is hard for me to get through my days. I really used to love what it is we do and to my knowledge we are the only ones doing this at this scale without private equity or VC. All of this said, I know I am leaving TONS of $$ on the table and really no matter how hard I try, I just can't seem to build what needs to be built in order to scale further. This is part of the debilitation that I feel. I have swung 40 times (thats an exaggeration) and stuck out for one reason or another. Whether it is I don't have enough money to build it or I find somebody that says they can build it and they can't. I hate the feeling of being lost or without direction and really I am starting to actually lose my damn mind. The worst part is it is only me at the top and I have nobody to really talk to about all this. Running solo in the desert trying to find rain clouds and for whatever reason I just keep finding salt flats. Advice?",
        "subreddit": "Entrepreneur",
        "author": "Familiar-Ad-3429",
        "score": 83,
        "num_comments": 40,
        "created_utc": 1764711068.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pcl6h9/10_years_in_the_game_losing_my_mind/",
        "fetched_at": "2025-12-03T16:18:12.951764"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 77,
        "num_comments": 53,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-03T16:18:20.135338"
      },
      {
        "id": "1pcnntc",
        "title": "Got SOC 2 certified. Cost $28K. Won exactly one deal because of it.",
        "selftext": "Enterprise prospects kept asking \"Are you SOC 2 compliant?\" Kept losing deals because the answer was no.\nDecided to get certified. Here's what it actually costs:\nCompliance platform (Vanta): $9K/year\nAuditor fees: $12K\nPenetration test: $4K\nLegal review: $3K\nMy time: roughly 80 hours over 4 months\nTotal first year: $28K plus 80 hours.\nResults after 12 months:\nOne enterprise deal that specifically required SOC 2. $18K ARR.\nLost money year one. Maybe break even year two.\nBut here's what else happened:\nSecurity questionnaires got way easier. Used to take 8 hours each. Now I send the SOC 2 report and they're done.\nFewer prospects ask questions. The badge answers before they ask.\nSales cycle shortened for security-conscious buyers.\nWas it worth $28K? Probably not based on direct ROI.\nBut the indirect benefits compound. I'm now in the consideration set for deals I'd have been eliminated from before.\nThe real lesson: SOC 2 is a tax on selling to enterprises. You either pay it or you don't play in that market.\nFor SMB-focused SaaS? Skip it.\nFor enterprise ambitions? Budget for it earlier than you think.\nHave you done SOC 2? Worth it?",
        "subreddit": "SaaS",
        "author": "ToeAdventurous3638",
        "score": 76,
        "num_comments": 53,
        "created_utc": 1764716950.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pcnntc/got_soc_2_certified_cost_28k_won_exactly_one_deal/",
        "fetched_at": "2025-12-03T16:18:14.685835"
      },
      {
        "id": "1pcklpz",
        "title": "2 VCs reached out after my OSS hit 1.8k stars in 53 days. never done this before - what should i actually prepare? “I will not promote”",
        "selftext": "building an ai coding tool. open source. bootstrapped.\n\nthe traction so far:\n\n- 1.8k github stars in 53 days\n- 35% week-over-week growth\n- all organic - reddit, dev communities, word of mouth\n\nnow 2 VCs want to talk. i’ve never raised before and tbh not even sure if it’s the right move.\n\nfor founders who’ve been through this:\n- what do they actually ask in first calls?\n- what catches first-timers off guard?\n- any red flags i should watch for?\n\ntrying to go in prepared even if i end up not raising.",
        "subreddit": "startups",
        "author": "MrCheeta",
        "score": 76,
        "num_comments": 58,
        "created_utc": 1764709761.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1pcklpz/2_vcs_reached_out_after_my_oss_hit_18k_stars_in/",
        "fetched_at": "2025-12-03T16:18:16.614545"
      },
      {
        "id": "1pcn4em",
        "title": "Christmas bonus for small business with 2 employees and declining sales",
        "selftext": "Here's some info about the business: I own a small business with 2 employees. I give 5% guaranteed annual raises that kick in on January 1. I also provide a 401k match of up to 4%. In the past Christmas bonuses have been 1% of wages earned for the year.\n\nThe bad news is that gross sales are down about 11% this year. They were also down around 9% last year. I've absorbed the costs and have kept the increases and benefits. Not sure how much longer I can hold out. It's only for 2 employees though so I think I can continue with the above for another year.\n\nHow are other small business owners navigating bonuses/raises/benefits as your sales continue to decline?\n\n  \nEdit: \n\nJust to clarify, the employees have done everything asked of them. They show up, shut up, and keep up. They work hard and are reliable. They are professional and polite. Even though the business is going through a downturn I am having trouble with the idea of withholding something from them that they are not responsible for. I understand bonuses are performance based, but their performance hasn't diminished. It's just people out there are struggling. And for those that are telling me to focus on sales, I've definitely tried a few things this year. I switched to a new POS system that better tracks customer behavior and sends reminders for increased engagement. I've offered more sales. The employees have changed displays/endcaps every month as well as getting rid of slow moving SKUs and replacing them with new products. I have gone through every expense and tried to find a way to lower overhead costs. Sometimes the economy just sucks and the free market puts you in your place. So this is less about a \"bonus\" and more about being a \"gift.\"",
        "subreddit": "smallbusiness",
        "author": "Equivalent_Call7856",
        "score": 73,
        "num_comments": 81,
        "created_utc": 1764715624.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pcn4em/christmas_bonus_for_small_business_with_2/",
        "fetched_at": "2025-12-03T16:18:18.273021"
      },
      {
        "id": "1pcgjx3",
        "title": "I'm burned out from my job and want to build a SaaS. Need brutally honest advice",
        "selftext": "Hey everyone,  \nI'll be straight: **I hate my job.**\n\nI've been a software engineer for years, and I've seen almost every angle of this career:\n\n* Worked at multiple companies (different industries, different scales)\n* Did freelancing\n* Built **web apps, mobile apps**, and internal tools\n* Experience with **scraping, AI integrations, and automation (n8n)**\n* I know how to ship, maintain, and scale products\n\nAnd yet… I feel stuck.  \nGood salary, okay title, but zero ownership and zero excitement.\n\nI don't want another side project that dies after 2 weekends.  \nI want to build a **real SaaS**, something boring but useful, something people actually pay for.\n\n  \nMy main problems:\n\n* I have **too many skills**, which makes it hard to commit to *one* idea\n* I don't want to build \"AI todo app #9999\"\n* I'm not afraid of backend, frontend, infra, or automation, but I am afraid of spending months building the wrong thing\n\nSo I'm here asking for **real advice from people who've been there**:\n\n* How did you find your **first SaaS idea that actually made money**?\n* Did you start from a pain you personally had, or copy an existing business and niche down?\n* If you were in my position today, **what would you build first** given skills in web dev, scraping, AI, and automation?\n* What's the biggest mistake you made early on?\n\nI'm ready to execute. just trying to point the effort in the right direction.\n\nAny advice, hard truth, or idea is appreciated 🙏",
        "subreddit": "SaaS",
        "author": "Street_Remote2252",
        "score": 66,
        "num_comments": 55,
        "created_utc": 1764700743.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pcgjx3/im_burned_out_from_my_job_and_want_to_build_a/",
        "fetched_at": "2025-12-03T16:18:14.685859"
      }
    ]
  }
}