{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-26T00:58:04.169594"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-26T00:57:55.355915"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-26T00:57:54.987294"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-26T00:57:54.987296"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-26T00:57:54.987280"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-26T00:57:55.355913"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-26T00:57:55.355919"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-26T00:57:55.355917"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-26T00:57:54.987301"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-26T00:57:55.355902"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-26T00:57:54.987297"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 487,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-26T00:58:03.168215"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 180,
        "num_comments": 37,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-26T00:58:03.168272"
      },
      {
        "id": "1p64phc",
        "title": "California — Can I adjust timesheets if an employee stays later just to hang out?",
        "selftext": "Edit: I won’t be adjusting the time card. ChatGPT gave me odd information which was why I asked if I had stated in policy they need to get approval to stay later. \n\nIf it wasn’t clear but I’ve told this employee not to stay late or clock in early before. I’ve also sent a message to the whole team about this exact issue two weeks ago when I started noticing. (Though no one else does this except for that 1 employee and always when it’s his friend’s shift.) I also just realized this has been happening a lot longer than the last few weeks someone else was running payroll before\n\nFor the next step I warned the employee this time and also the lead not to do it again. The next time will be a write up. Thank you everyone!\n\n\n———————\n\nI own a small coffee shop in California and while running payroll I’ve been noticing a part-time employee who is scheduled from 12 PM to 4 PM but has stayed until 5 PM multiple times. (We are not busy from 4 PM to 5 PM and someone else will be coming at 5 PM to help close with the lead)\n\nThe shop wasn’t busy during these hours, and we didn’t need two people. I suspect they stayed late to chat with our shift lead (they’re friends). I’ve already reminded both of them that extra hours must be approved, and this should not happen again.\n\nMy question is: Is it legal to adjust their timesheet back to 4 PM if they stayed the extra hour for personal socializing without authorization, and minimum work is done\n\nFor context, I do plan to give less shifts to this employee moving forward, but I want to understand what employers typically do in this situation and how to handle it correctly.\n\nAny advice from other small business owners or HR professionals would be appreciated.\n",
        "subreddit": "smallbusiness",
        "author": "StartupTechy",
        "score": 151,
        "num_comments": 94,
        "created_utc": 1764049931.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p64phc/california_can_i_adjust_timesheets_if_an_employee/",
        "fetched_at": "2025-11-26T00:58:01.325721"
      },
      {
        "id": "1p6a1u5",
        "title": "(Rant) I HATE ALL THIS AI STUFF!!!",
        "selftext": "I get a TON of chat requests saying \"hey, I built this AI tool that helps businesses do XYZ...\"; I DON'T CARE that it's \"AI-powered\", as a business owner all I care about is \"does it get the job done RIGHT, THE FIRST TIME?\"!\n\nWere in an AI bubble right now because people are deluded into thinking that \"AI\" means \"I'll get funding\"...but if your business/tool/app/site doesn't actually DO anything BETTER than what's already out there, you're TOAST.\n\nAnd STOP with all this \"AI is a new thing\" nonsense. Quake III had a pretty good AI, as did Battlefront II.\n\nEnd Rant. Thanks for listening. \n\nNow get back to building.",
        "subreddit": "Entrepreneur",
        "author": "Broad-Worry-5395",
        "score": 125,
        "num_comments": 71,
        "created_utc": 1764070012.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p6a1u5/rant_i_hate_all_this_ai_stuff/",
        "fetched_at": "2025-11-26T00:57:56.172460"
      },
      {
        "id": "1p5zynn",
        "title": "Solution to fake traffic screenshots? Database of verified startup traffic",
        "selftext": "I was tired of fake traffic screenshots.  \n  \nThat’s why I built a platform where founders can prove their traffic in three easy steps.  \n  \n1. Upload a read-only Google Property ID and add TrustTraffic's email to read-only property access management in Google Analytics  \n  \n2. Get a public profile with automatically verified traffic  \n  \n3. Receive a free dofollow backlink  \n  \nNo loopholes, no number editing access, no human review needed.   \n  \nIt even comes with a monthly traffic leaderboard so you can see where you stand, as well as a leaderboard showing the countries with websites that have the most traffic.\n\nWould love to hear what you wonderful people think",
        "subreddit": "Entrepreneur",
        "author": "Practical_Might1395",
        "score": 118,
        "num_comments": 23,
        "created_utc": 1764035468.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p5zynn/solution_to_fake_traffic_screenshots_database_of/",
        "fetched_at": "2025-11-26T00:57:56.172476"
      },
      {
        "id": "1p5ibhk",
        "title": "hot take: the first 10 users of any startup are just people who liked the founder- I will not promote",
        "selftext": "so I was watching this Sauce VC podcast on Masters union yt channel (don't ask why, I was procrastinating)\n\nand they said something like: **“the founder’s passion attracts the first alpha users + early employees.”** and honestly… yeah. I’ve literally never seen an early-stage startup where the *product* was the reason people showed up. it’s always the founder. their energy. their delusion.\n\nso tell me if you’ve ever joined an early startup or tested an early app… did you do it for the product or because the founder was your friend ???",
        "subreddit": "startups",
        "author": "Alternative-Wish9912",
        "score": 99,
        "num_comments": 36,
        "created_utc": 1763994143.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p5ibhk/hot_take_the_first_10_users_of_any_startup_are/",
        "fetched_at": "2025-11-26T00:57:59.567019"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 67,
        "num_comments": 45,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-26T00:58:03.168251"
      },
      {
        "id": "1p63nb6",
        "title": "If you had to restart your income streams from zero today, what would your first 48 hours look like?",
        "selftext": "Not hypotheticals. Actual step-by-step actions you’d take immediately.",
        "subreddit": "Entrepreneur",
        "author": "Timely-Fondant-7228",
        "score": 64,
        "num_comments": 59,
        "created_utc": 1764046403.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p63nb6/if_you_had_to_restart_your_income_streams_from/",
        "fetched_at": "2025-11-26T00:57:56.172479"
      },
      {
        "id": "1p6f252",
        "title": "Shipped 8 SaaS products in 2 years. Here's my complete 10-14 day build process, tech stack, and why speed matters more than perfection",
        "selftext": "Most developers overthink their tech stack and spend 3-6 months building before launching. I tested eight different SaaS products over two years, and the stack that consistently got me from validated idea to production in 10-14 days became my competitive advantage as a solo founder.\n\n**The Complete Tech Stack:**\n\nFrontend Next.js 14 with App Router, TailwindCSS for styling, shadcn/ui for component library. Why this matters: Server-side rendering is crucial for SEO from day one, the component library speeds up UI development by 5x compared to building from scratch, and React's ecosystem means every problem has been solved by someone already. Backend Next.js API routes, no separate backend until you hit $50K+ MRR. Why: maintaining one codebase in one repo with one deploy process eliminates 90% of DevOps complexity early stage. Zero API versioning headaches, no CORS issues, simpler mental model.Database Supabase (Postgres) with Prisma ORM for type safety. Why: free tier genuinely covers your first 1,000 users, real-time subscriptions are built-in if you need them, migrations are straightforward, and you can always migrate to any Postgres host later if needed. Auth Clerk or NextAuth, absolutely never build authentication yourself. Why: two-hour setup versus two weeks of custom building that will inevitably have security holes you don't know about. Payments Stripe with proper webhook handling. Why: webhooks are reliable, documentation is exceptional, everyone trusts Stripe checkout, and international payments just work. Hosting Vercel for frontend (push to deploy, zero config), Supabase for database and storage.\n\n**The 10-14 Day Build Process:**\n\nDays 1-2: Set up boilerplate with the entire stack above. Never start from absolute scratch use starter templates or your own boilerplate. Days 3-7: Build exactly one core feature. Not a dashboard. Not analytics. Not user settings. Just the single feature that solves the validated pain point from your customer interviews. This is the hardest part resisting feature creep. Days 8-10: Integrate Stripe completely, test every payment scenario including failures, implement basic error handling and logging. Ugly UI is completely acceptable at this stage. Working checkout is absolutely mandatory. Days 11-12: Deploy to production on your actual domain, test the entire flow end-to-end as a real user would, fix only critical bugs that break core functionality. Days 13-14: Create a simple landing page explaining the value proposition clearly, prepare basic launch assets (screenshots, demo video if needed), and ship it to your first users.\n\n**What I Deliberately Skip:**\n\nCustom backend architecture, GraphQL (REST is fine), microservices (monolith until $100K+ MRR), custom design systems (Tailwind + shadcn is enough), complex state management (React hooks are sufficient), testing beyond manual testing (add tests after revenue).The pattern I've learned: speed of iteration matters infinitely more than technical perfection at the start. Every week you spend perfecting architecture is a week you're not learning from real users. I've documented this entire process with actual code examples, deployment checklists, and common pitfalls in [Toolkit](http://foundertoolkit.org) based on building these eight products.",
        "subreddit": "SaaS",
        "author": "Express_Memory_8236",
        "score": 58,
        "num_comments": 14,
        "created_utc": 1764083832.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p6f252/shipped_8_saas_products_in_2_years_heres_my/",
        "fetched_at": "2025-11-26T00:57:57.905106"
      },
      {
        "id": "1p68wjj",
        "title": "UPS is charging us heavy surcharges every week.",
        "selftext": "Hi - as the title suggests…I work for a small business and we ship a lot of stuff. It recently became my responsibility to reconcile the UPS invoice we get weekly and it has become clear that UPS is essentially scamming us out of hundreds of dollars a week. I wanted to see if others have been having the same experience. \n\nWe are being hit with two surcharges mainly: “dimensional weight adjustments” & “address corrections”. These sometimes amount to more than the original cost of the shipment, are often not valid and easily disputed, and feel very much like UPS attempting to skim money from businesses that are shipping enough to not be able to catch these additional fees. \n\nWhen speaking with our account executive, she mentions that they use an automated (I assume AI) system to image and measure packages. I’ve asked for proof from this system on a few occasions for dimensional adjustments and received nothing, but have had disputes accepted instead. She also has mentioned that the team that handles the surcharges is “third party and overseas”, which makes me think they are receiving a portion of these surcharges, incentivizing them to overcharge and not accept disputes. \n\nAnyway, just want to know if this is a common issue others who use UPS for 30+ shipments a week are experiencing. Thanks! ",
        "subreddit": "smallbusiness",
        "author": "StitchedRebellion",
        "score": 54,
        "num_comments": 66,
        "created_utc": 1764065855.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p68wjj/ups_is_charging_us_heavy_surcharges_every_week/",
        "fetched_at": "2025-11-26T00:58:01.325723"
      }
    ]
  }
}