{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-08-22T16:46:06.759200"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-08-22T16:45:59.975080"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-08-22T16:45:59.975086"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-08-22T16:45:59.589422"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-08-22T16:45:59.589409"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-08-22T16:45:59.975076"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-08-22T16:45:59.975083"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-08-22T16:45:59.589428"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-08-22T16:45:59.589430"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-08-22T16:45:59.975064"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-08-22T16:45:59.589432"
      }
    ],
    "reddit": [
      {
        "id": "1mw5yfg",
        "title": "Forced every engineer to take sales calls. They rewrote our entire platform in 2 weeks",
        "selftext": "Our senior DevOps engineer thought I'd lost my mind. He didn't join a startup to do sales. So he promised me 5 calls and I guaranteed he'd never have to do it again. It was a bit of a back-and-forth but I strongly believe it fundamentally changed how we build products.\n\nWhen I sat in on the calls, I observed a few things: \n\n\\- Seeing them explain why our competitor's platform was \"too complex for non-technical users.\"  \n\n\\- Seeing them assure the customer that the continuous monitoring was actually working (We had beautiful logs and metrics. But what they wanted was a green checkmark.)\n\n\\- Seeing them respond when customers asked \"Can someone just do this for me?\" \n\nMost of our team are backend engineers too and I think this fundamentally made them better product designers. At the end of it, they were sketching a completely different architecture without my \"PMing\". Because they finally understood who was actually using our product.\n\nThe rewrite took 2 weeks. We removed 60% of features. Added a simple progress bar. Built Slack integration for questions. Created \"done-for-you\" workflows. \n\nOur support tickets dropped 70%. \n\nThe biggest problem with most engineers is actually over-engineering. \n\n1. **Users don't care about your elegant solution** \\- they care about their problem going away\n2. **Technical correctness < user understanding** \\- if they can't use it, it doesn't matter how well it's built\n3. **Every feature has a cost** \\- not in code, but in user confusion\n\nSince this experience, I've made this a mandatory culture in our team. Every engineer takes 5 sales calls per quarter. There's always going to be a little pushback. But hearing the exhaustion in a customer's voice when they say \"I just need this to work.\" does it all. I think it helps build up their instinct. ",
        "subreddit": "Entrepreneur",
        "author": "rluna559",
        "score": 2650,
        "num_comments": 251,
        "created_utc": 1755767709.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1mw5yfg/forced_every_engineer_to_take_sales_calls_they/",
        "fetched_at": "2025-08-22T16:46:00.403812"
      },
      {
        "id": "1mwfcdy",
        "title": "From $6M/year to near-bankruptcy overnight - and how it turned into a $50M pivot",
        "selftext": "In 2014 I launched a Shopify store in an adult niche (cannabis accessories). Everyone told me I was insane. \"Illegal\", \"will never work\", \"you cant advertise\". But I saw where the legalization trend was going and pushed forward anyway.\n\nBy 2016 we were doing $6M a year in revenue. 25,000 square foot warehouse, thousands of SKUs, private label containers arriving monthly, 60 full-time staff, free lunch, cold brew on tap, all that fun stuff. 99% of our traffic came from Google Search, because at the time cannabis accessories were banned from every major ad platform. We ranked #1 for bongs, vaporizers, glass pipes, and pretty much every other high-intent keyword.\n\nThen November 16, 2016 happened, one week before Black Friday. I woke up to $150 in sales instead of the $6,000 we’d normally have by mid-morning. Panic mode set in. The site was live, checkout worked, payment processor was fine. Then I checked Google Analytics and saw a 99% drop in traffic overnight.\n\nSearch Console revealed the problem: manual penalty for link manipulation. The thing is, we had never bought backlinks. Someone had bought hundreds of thousands of spammy backlinks to our site in a targeted SEO attack, and it worked.\n\nThe next month was brutal. We laid off more than 50 employees. I was personally on the hook for a $25k a month lease (with a $60k salary because we were reinvesting EVERYTHING), and holding $1M in inventory with no way to move it.\n\nThen came the pivot. We had the warehouse and the inventory, so I put together a quick landing page offering dropshipping to our competitors at 50% off retail. Word spread fast. Within a year we were the main dropship supplier for the industry. I built custom software to handle the scale, keep inventory in sync, and manage fulfillment automatically.\n\nSix months later the manual penalty was lifted and our SEO traffic started to come back, but I wasn’t about to give up the dropship revenue stream.\n\nIn 2021 a retail giant, High Tide Inc, approached to buy our store. They didn’t want the software, so I spun it out into a new company, named it Crowdship.io, and marketed it as a \"dropship automation software\". Since then we’ve done over $50M in GMV, became the largest B2B dropship platform for cannabis accessories, and built a whole new business out of what started as a complete disaster.\n\nSometimes the thing that nearly kills your business is the same thing that ends up saving it. When life blows up your plans, look for the pivot hiding in the wreckage. Don't let anything keep you down. ",
        "subreddit": "Entrepreneur",
        "author": "thundernutz",
        "score": 928,
        "num_comments": 99,
        "created_utc": 1755792653.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1mwfcdy/from_6myear_to_nearbankruptcy_overnight_and_how/",
        "fetched_at": "2025-08-22T16:46:00.403809"
      },
      {
        "id": "1mw42jw",
        "title": "I'm a sperm cell and just hit 20k MRR",
        "selftext": "It was simple. I asked customers what their pain points were.\n\nI sold before I built anything. None of my customers had any concerns handing me hundreds and thousands of dollars even though I'm pretty young, I have nothing to show, no reputation, and I'm obviously not technical.\n\nI then vibe coded a solution in a couple hours. Posted a TikTok on how even I was able to achieve success in 2025. Shit went viral and here we are.\n\nYou guys are over complicating things. Just get out there and follow this advice.",
        "subreddit": "SaaS",
        "author": "listenhere111",
        "score": 553,
        "num_comments": 122,
        "created_utc": 1755760464.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1mw42jw/im_a_sperm_cell_and_just_hit_20k_mrr/",
        "fetched_at": "2025-08-22T16:46:01.809102"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 440,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-08-22T16:46:05.757805"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 274,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-08-22T16:46:05.757852"
      },
      {
        "id": "1mwnvwe",
        "title": "I FUCKING HATE MARKETING, THIS IS HELL.",
        "selftext": "I’m at the point where I just want to scream. Marketing is fucking hell. Organic growth is so goddamn slow it feels like torture. I put in endless effort, endless hours, and what do I get? A drip of visitors, a crawl of traffic, and the constant thought in my head: why the fuck am I even doing this?\n\nI used to see numbers moving, I used to get some traction, and now it’s like hitting a fucking brick wall every single day. I’m sick of it. I’m sick of posting, sick of trying to play games with algorithms, sick of grinding my face off for breadcrumbs\n\nFuck marketing.\nFuck PMF.\nFuck organic growth being slow as shit.\nFuck watching numbers crawl when I bust my ass.\nFuck the days I feel like giving up.\nFuck freelancing.\nFuck 9-to-5 bullshit\nFuck the grind that feels endless.\nFuck the silence after posting.\nFuck the thought that this won’t work.\n\nAnd fuck all of this frustration. It’s boiling me alive. I swear to god this shit makes me want to smash my head against the wall.\n\nBut fuck giving up even more. As much as this feels like pure hell, I’m not quitting. Not today. Not tomorrow. I’ll rage, I’ll curse, I’ll break apart but I’ll still show up. Even if it kills \n\n\nEdit : Hey, seriously thank you for all the support, the advice, and even the pushback. marketing is brutal. I’m learning, I’m grinding, and yeah, I vented hard because sometimes it feels like hell.",
        "subreddit": "SaaS",
        "author": "Best-Ice-9532",
        "score": 185,
        "num_comments": 140,
        "created_utc": 1755811834.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1mwnvwe/i_fucking_hate_marketing_this_is_hell/",
        "fetched_at": "2025-08-22T16:46:01.809062"
      },
      {
        "id": "1mq3pt1",
        "title": "I'm Rob, failed at 5 SaaS attempts in 2 years, then built my 6th in stealth for 6 months. Added $1k MRR in 24 hours on launch day. Currently at $3.5k MRR (AMA)",
        "selftext": "Hello fellow SaaS builders. My name’s Rob & I just added $1k MRR in 24 hours after 5 failed attempts.\n\nA couple weeks ago was launch day for my 6th SaaS attempt. After building in stealth for 6 months, I went from $1,600 to $2,500+ MRR in a single day.\n\nI started my SaaS journey 2 years ago. Failed 5 times. Lost money, time, and almost my sanity. But with attempt #6 I did a few things differently.\n\nFirst off, I faced the pain-point myself. Every SaaS \"guru\" preaches build in public, launch fast, get feedback. But launching broken products never worked for me. Too much noise, too many opinions, too much damage to first impressions. So I tried something different.\n\n**My secrets to a successful launch day:**\n\n**Building in “Stealth”:** I still posted publicly, but kept the product private until it was ready.\n\n* Posted screenshots asking \"who wants to try this?\" - no product links\n* DMed interested people to join private beta\n* Got 30 paying users before anyone knew what I was building\n* Their brutal feedback made the product 10x better\n* Built hype so launch day went that much better\n\n**Launch Day Momentum:** When you finally launch, ride the wave HARD.\n\n* Posted a curry selfie celebrating 26 trials → 50,000 views\n* Screenshot PostHog analytics → 20,000 views\n* Screenshot Lemon Squeezy dashboard → 10,000 views\n* Every win becomes content that drives more wins\n\n**Why Photos Matter:** Text gets lost in the AI slop on X. But by showing you are a real human being with a real story, you stop and grab peoples’ attention.\n\n* People root for underdogs (probably you)\n* Authenticity beats polished marketing (especially in AI era)\n\n**The Numbers Game:**\n\n* 70 free trials in 24 hours\n* 50% trial conversion rate (industry average is 15-20%)\n* 200,000+ views on X in 24hrs\n* 95% of traffic from organic X posts\n\nOver 6 months of private beta, I built to $1,600 MRR. Then added $1,000 more in 24 hours. A couple weeks on, I’m at $4,500+ MRR with another 150 trials pending.\n\nAsk me anything about:\n\n* Failing 5 times and what I learned\n* Building in \"stealth\" while still posting publicly\n* Getting 30 people to pay for a private beta\n* Launch day execution\n* Why posting a picture of me eating a curry converted more users than anything else\n\nGoal is $10k MRR well before the end of the year. After 5 failures, it finally feels possible.\n\nHappy to share specific tactics, screenshots, or just commiserate about the SaaS grind :)\n\nLet's gooo!\n\n(I'll be sticking around most of the day to answer questions. And I'll try my best to answer any asked even after today, so don't hesitate to leave your question!)\n\nEDIT: This was a lot of fun, thanks so much for asking all of your questions - there were some really great ones! I'll have to bookmark this myself so I can come back and re-read my answers, since I dropped most of my brain in here today haha. Catch you all next time or on X (hopefully past $10k MRR)! :D",
        "subreddit": "SaaS",
        "author": "robj3d3",
        "score": 181,
        "num_comments": 126,
        "created_utc": 1755184997.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1mq3pt1/im_rob_failed_at_5_saas_attempts_in_2_years_then/",
        "fetched_at": "2025-08-22T16:46:01.809038"
      },
      {
        "id": "1mwqdrz",
        "title": "Got asked to do a deep clean, did the job, now the owner is halving the agreed rate after the fact",
        "selftext": "I was asked last-minute to do a deep clean of an apartment for someone hosting a special event. The place was in rough shape including a lot of mould and I was encouraged to do as much as I could to get it looking right. I brought my own supplies, worked thoroughly, and postponed other things to fit it in because I was told the rate upfront and agreed on that basis.\n\nAfter the job was done, the owner told me she had “made a mistake” offering that rate and is now only willing to pay me half. This wasn’t discussed beforehand it only came up after I’d completed everything. I’ve tried to handle it calmly and professionally, but I feel really disrespected.\n\nI’m torn because she’s in my building and connected to people I know but I also don’t think it’s okay to change terms retroactively. \n\nWould love to hear how others would handle this or what you’d say in my shoes.\n\nEdit: it’s in writing and verbal, sent her a screenshot of her telling me the rate and she’s claiming it’s a mistake!\n",
        "subreddit": "smallbusiness",
        "author": "geniusmastermind8",
        "score": 146,
        "num_comments": 77,
        "created_utc": 1755818037.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1mwqdrz/got_asked_to_do_a_deep_clean_did_the_job_now_the/",
        "fetched_at": "2025-08-22T16:46:04.466838"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 141,
        "num_comments": 171,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-08-22T16:46:05.757834"
      },
      {
        "id": "1knjjez",
        "title": "Hitting Pause (Temporarily) on New Posts",
        "selftext": "Hi, it's your friendly subreddit moderator here. Unfortunately, recent weeks have seen a significant increase of post submissions that break the [subreddit rules](https://www.reddit.com/r/freelance/about/rules) in clear and obvious ways. We're at the point where more than 90% of the post submissions violate the rules.\n\nWhile some of this is the standard \"I didn't read the subreddit rules and don't understand that this isn't /r/forhire, so please hire me/work on my project\" stuff I am used to dealing with, I suspect a lot of the increase is due to AI. I have removed dozens of posts that are some iteration of \"go to Gumroad and buy this ebook/PDF/guide that will help you freelance\" (one even stated that its purpose was to help you create ebooks with AI to sell to freelancers). I have also removed dozens of posts of market research/promotional spam related to \"vibe coding\" tools.\n\nI've been moderating this subreddit for more than a decade (!), so I'm used to periodic surges of inappropriate posts because some YouTuber made a video telling people to submit things to Reddit, or because some virtual assistant course mandated that its students make marketing comments here, or because Reddit itself decides that increased posts and traffic are more important than subreddit rules and moderators' time. Unfortunately, I am currently at the point where I need the firehose of incoming spam to stop. I need at least a couple of days, but reserve the right to continue this until the end of the month.\n\nComments are on. Please be respectful.",
        "subreddit": "freelance",
        "author": "martey",
        "score": 113,
        "num_comments": 25,
        "created_utc": 1747343489.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1knjjez/hitting_pause_temporarily_on_new_posts/",
        "fetched_at": "2025-08-22T16:46:05.757883"
      }
    ]
  }
}