{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-28T16:14:59.590743"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-28T16:14:51.111194"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-28T16:14:50.730042"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-28T16:14:50.730044"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-28T16:14:50.730029"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-28T16:14:51.111192"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-28T16:14:51.111199"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-28T16:14:51.111197"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-28T16:14:50.730050"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-28T16:14:51.111181"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-28T16:14:50.730046"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 486,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-28T16:14:58.589359"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 326,
        "num_comments": 105,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-11-28T16:14:58.589369"
      },
      {
        "id": "1p8a9z3",
        "title": "Customer paid $2400 upfront for annual plan. Emailed 3 days later asking for refund.",
        "selftext": "Thought I'd won the lottery when I saw that Stripe notification. Annual plan. Full year paid. $2400.\nSent them a welcome email, got their account set up, even recorded a personal walkthrough video.\nDay 3: \"Hey, this isn't what I thought it was. Can I get a refund?\"\nProcessed it immediately. Asked what went wrong.\n\"I thought it did [completely different thing that was never mentioned anywhere on the landing page].\"\nI have no idea where they got that idea. My landing page is pretty clear. Demo video shows exactly what it does.\nBut whatever. They're gone. I'm out $2400 and like 4 hours of onboarding time.\nThe annoying part is I can't even learn from it. They misunderstood something fundamental that I can't figure out how to make clearer.\nThis happen to anyone else? Big payment followed by immediate regret?\n",
        "subreddit": "SaaS",
        "author": "Bulky-Economy-6746",
        "score": 242,
        "num_comments": 99,
        "created_utc": 1764270246.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p8a9z3/customer_paid_2400_upfront_for_annual_plan/",
        "fetched_at": "2025-11-28T16:14:53.571248"
      },
      {
        "id": "1p8g5ep",
        "title": "Hired a VA to handle support. She's better at it than me.",
        "selftext": "Paying her $12/hour for 20 hours a week. She responds faster, friendlier, and actually remembers customer context.\n\nI was spending 15+ hours a week on support and it was killing me. Every interruption broke my focus.\n\nFirst week with her I was paranoid. Checked every ticket she closed. Critiqued her responses.\n\nWeek 3: Stopped checking. Customer satisfaction score went UP.\n\nTurns out I'm not actually good at support. I'm just the founder so I thought I had to do it.\n\nShe caught 3 bugs I didn't know about, suggested 2 onboarding improvements, and one customer specifically asked to \"thank the support person who helped me Tuesday.\"\n\nCost breakdown: $240/week for her vs probably $400/week of my opportunity cost doing support badly.\n\nShould've done this 6 months ago.\n\nFor bootstrapped founders: when did you hire your first help and what made you finally do it?\n\n",
        "subreddit": "SaaS",
        "author": "Crazy-Recording4800",
        "score": 83,
        "num_comments": 18,
        "created_utc": 1764286489.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p8g5ep/hired_a_va_to_handle_support_shes_better_at_it/",
        "fetched_at": "2025-11-28T16:14:53.571252"
      },
      {
        "id": "1p8tvwo",
        "title": "I made $311 selling my AI Mastery course 1 day before Black Friday",
        "selftext": "Hello r/SaaS,\n\n  \nThis is creator of [https://startcod.ing/](https://startcod.ing/) and I built this course to help people struggling with Bolt And Lovable trying to ship production quality app.\n\n\n\nHere are the few things I recognised:\n\n* They are not aware of what's happening behind the scenes.\n* Creators do not have idea of which library to use and how.\n* Too much overreliance on AI for architecural decisions.\n\nSo I created the course while building \"Indie Kit\" - A SaaS Starter Kit. to help people with following topics:\n\n* How to think like a AI Creator.\n* Basics of Internet\n* Basics of NextJs\n* Security Issues while using supabase and how to prevent.\n* How to lay a strong foundation that AI does not hallucinate.\n* How to setup and keep control of your code so that your project produces less error while you're adding features.\n* How to do tool research to avoid vendor lock ins.\n\n  \nSo I made this platform with Video Lessons + Text Content + Quizzes. \n\nShaped with 50+ beta students and today I got my 4th sale of $311.\n\n  \nI am very happy and I actually talked to people who already pursued and they are happy. \n\n  \nThank you,\n\nCJ\n\n[https://startcod.ing/](https://startcod.ing/) and [https://ssur.cc/zXaEbhf](https://ssur.cc/zXaEbhf)  \n",
        "subreddit": "SaaS",
        "author": "Square-Badger-2828",
        "score": 73,
        "num_comments": 7,
        "created_utc": 1764333688.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p8tvwo/i_made_311_selling_my_ai_mastery_course_1_day/",
        "fetched_at": "2025-11-28T16:14:53.571241"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 69,
        "num_comments": 50,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-28T16:14:58.589393"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 55,
        "num_comments": 51,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-11-28T16:14:58.589397"
      },
      {
        "id": "1p8xvv7",
        "title": "How a random interaction turned into a game changer for my startup",
        "selftext": "I’m the founder and CEO of an Healt Platform. (I’LL NOT PROMOTE)  \nWe were finally ready for the big step: launch our mobile version on the App Store (necessary move).  \nI didn't want to add people to the company, so having budget, we decided to look for a dev to hire.\n\nToo bad every developer I talked to sent me quotes that were insane. Completely out of budget. And I had an entire week packed with calls, one after another.\n\nOne evening I was finishing an important pitch deck. I opened this app I use every single day to work with other people, just to get one last productive session in. I’m scrolling through the home and I spot this guy with a bio that said: “the next Sam Altman*.”* It made me laugh, so I messaged him without expecting anything\n\nTurns out he wasn’t just a funny guy, he was a developer, and not just any developer, but a genuinely talented one. We hopped on a call, he showed me some of his projects and I instantly knew he was the right person. His quote was a fraction of what I had been hearing all week. I literally saved thousands of dollars thanks to a completely random moment\n\nFast forward to today,we’re already building the app together. Sometimes the best opportunities are hiding in places you’d never expect.",
        "subreddit": "SaaS",
        "author": "Perfect-Run4970",
        "score": 48,
        "num_comments": 2,
        "created_utc": 1764344329.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p8xvv7/how_a_random_interaction_turned_into_a_game/",
        "fetched_at": "2025-11-28T16:14:53.571250"
      },
      {
        "id": "1p5204t",
        "title": "Finished making a website for a local business, asked for compensation, and now they ghosted me. What should I do?",
        "selftext": "Hey everyone, I am trying to get started with freelance web design for small businesses. I knew of a local restaurant owner from my community that had no website at all so I decided to meet with them and talk about making a website for them. They didn't ask for one but once I brought the idea to them, they liked the sound of it and wanted me to create it for them. \n\nI worked on it for a while on Square and integrated it with their online ordering system and POS system in their restaurant. I even added a catering and reservation section that they didn't have before. I briefly brought up the pay and they said they'd \"put me on a payroll\" and that was it. So once I finished making the website for them, they started having customers use it already. So I asked him about being paid for my work through text messages and he just read the message without saying anything. Then I asked him again if we can have a call to talk about it, and he left me on read again. \n\nSo I decided to turn off the website to not be public anymore, and he still hasn't reached out or anything. I really wanted to help him build a website for his business, but was kinda surprised he didn't appreciate my help and offer to pay anything. What should I do? Should I reach out to him again asking for a specific amount of money for the website so I can make it public again? Should I go to his restaurant in person and ask to speak with him? Not really sure what my next move should be. ",
        "subreddit": "freelance",
        "author": "Dexter2376",
        "score": 48,
        "num_comments": 58,
        "created_utc": 1763942195.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p5204t/finished_making_a_website_for_a_local_business/",
        "fetched_at": "2025-11-28T16:14:58.589377"
      },
      {
        "id": "1p73jky",
        "title": "Built a marketplace platform with 10,000+ users. Need advice. I will not promote.",
        "selftext": "My startup marketplace platform went live this time last year. I’ve gotten 10,000+ users and one of the biggest brands in the world continuing to use us after a 6 month paid pilot. \n\nI raised $400k from angels in my pre-seed and now I need to raise $2m. I’ve reached out to over 100 VCs and funds with no response, I’ve heard through events and panels etc that they rarely even look at cold outreach messages. I’ve identified individuals as well as funds that would be a perfect fit for what I’m doing - but how the hell do you actually reach these people?! \n\nI know this is an annoying question that is basically everyone’s problem but here I am, asking it! ",
        "subreddit": "startups",
        "author": "FreelanceFraya",
        "score": 45,
        "num_comments": 93,
        "created_utc": 1764149718.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p73jky/built_a_marketplace_platform_with_10000_users/",
        "fetched_at": "2025-11-28T16:14:55.188353"
      }
    ]
  }
}