{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-29T16:12:31.981194"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-29T16:12:23.215236"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-29T16:12:22.826013"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-09-29T16:12:22.826023"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-29T16:12:22.825997"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-29T16:12:23.215232"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-29T16:12:23.215234"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-29T16:12:23.215237"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-29T16:12:22.826017"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-29T16:12:23.215224"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-29T16:12:22.826020"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 455,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-29T16:12:30.980155"
      },
      {
        "id": "1nt324g",
        "title": "How Did The Richest Self-Made Person You Know, Under 35, Obtain Their Wealth?",
        "selftext": "No one is truly self-made but this excludes the people that got their wealth, job, or a $100,000+ loan to start their business from their super rich dad or family.\n\nBy know I mean people that you have actually met and had a conversation with. Not the richest person \"you know of.\" (Ex. Mark Zuckerberg)\nHow much is their wealth? 1,000,000/10,000,000?/100,000,000?",
        "subreddit": "Entrepreneur",
        "author": "Financial-Ad-6960",
        "score": 345,
        "num_comments": 284,
        "created_utc": 1759102488.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nt324g/how_did_the_richest_selfmade_person_you_know/",
        "fetched_at": "2025-09-29T16:12:23.975509"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 171,
        "num_comments": 44,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-09-29T16:12:30.980175"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 154,
        "num_comments": 49,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-09-29T16:12:30.980167"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 148,
        "num_comments": 179,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-29T16:12:30.980207"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 115,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-29T16:12:30.980210"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 99,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-29T16:12:30.980192"
      },
      {
        "id": "1ntdq7s",
        "title": "Why do only 0.1% of talented people start startups?",
        "selftext": "I come across so many people who are much, much smarter than me, brilliant thinkers, amazing engineers, creative problem solvers. Yet I keep seeing this stat floating around that only about 0.1% of talented people actually go on to start startups.\n\nWhy is that ?\n\ngenuinely curious to hear Redditors’ perspectives on this. At times, I wonder what would the world look like if every talented person decided to start a company?",
        "subreddit": "Entrepreneur",
        "author": "Public_Cherry_2641",
        "score": 94,
        "num_comments": 202,
        "created_utc": 1759139080.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ntdq7s/why_do_only_01_of_talented_people_start_startups/",
        "fetched_at": "2025-09-29T16:12:23.975507"
      },
      {
        "id": "1nt5jvb",
        "title": "In my small town of 80k, everyone complains that there isn't a dance club. There are numerous bar and grills/sports bars, including many owned by the same company. Why hasn't someone ventured into that realm? What am I missing?",
        "selftext": "Granted the people that are complaining to me (an owner of a retail store) aren't the night club age anymore. Can a bottle service night club survive in rural America?",
        "subreddit": "smallbusiness",
        "author": "Try_Harder7",
        "score": 81,
        "num_comments": 129,
        "created_utc": 1759109739.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1nt5jvb/in_my_small_town_of_80k_everyone_complains_that/",
        "fetched_at": "2025-09-29T16:12:29.204683"
      },
      {
        "id": "1nt49rj",
        "title": "50 steps I made from Idea to first 100 customers after launching 3 Indie SaaS and making money in all 3",
        "selftext": "I am Krissmann, founder of 3 microsaas tools and one of the 6 writers of founder toolkit, We guys have built multiple micro saas in this AI wave to rack in enough sales to dropout of our univerisites and go for serious building.\n\nBut I have seen myself in your shoes and want to share just 50 tasks to skip all frustrating days by boring tasks to grab your initial users.\n\n1. Make a list of problems of your product is solving  \n2. Make a list of PERSONA of people facing that problem and looking for your product  \n3. Make a list of places where they find current available solutions to the problems they face  \n4. Make list of your direct indirect competitors  \n5. See how and where they engage and sell with customers  \n7. Make lifeline routine, habits, complete life of all your customer PERSONAS.  \n8. Be sure and make sure your product is best to solve their PARTICULAR PROBLEM \\[ I assume this \\]\n\nTill here, you have all raw materials ready. and I feel you also must be feeling the direction and flow now.\n\n8. Make a MAP of PERSONA --> PROBLEM --> SOLUTION --> MEDIUM OF COMMUNICATION  \n9. You should be clear your which ICP hangouts where on internet and in what mood, intent of purchase is important.  \n10. Join those places, observe, enagage, read but DO NOT POST  \n11. Analyze how your competitors are speaking to them and how people are reacting, engaging and talking.\n\nTill here, you have your raw materials and machines ready.\n\n12. Find negative reviews, people abusing your competitors, etc  \n13. Contact them, talk and share your solution  \n14. Keep on doing this until you have atleast 3 people ready to pay for your solution  \n15. If you don't find any bad reviews, then start talking to people asking questions  \n16. If after 20+ calls you have 0 intent then INTROSPECT YOUR PRODUCT, MARKET OR ICP  \n17. I assume, you get 3 initial customers  \n18. Do work, get feedback and ask for referrals  \n19. repeat it till you get 10 paying people  \n20. You have your TRUST COMPONENT READY too.\n\nNow you have complete idea of where to sell, who to sell, how to sell, Let';s start BUILDING COMMUNICATION NOW\n\n21. Start building in public, where your ICP enagage  \n22. Build content in places where your ICP spend time but no intent  \n23. Make announcements, share growth, share feedbacks, etc  \n24. Start working on SEO  \n25. Get listed on directories  \n26. Do PH launch  \n27. Start posting on reddit, Linkedin  \n28. Build Company pages for more trust  \n29. Add customer support system  \n30. Start adding blogs, pSEO pages  \n31. Build free tools, free glimpses etc\n\nTill here, you are now seeded in the small pool and now time to become SHARK there.\n\n32. Start educating about your domain to your ICP via content  \n33. Engage and educate  \n34. Make newsletters and email systems  \n35. Try to build audience around niche  \n36. Push people, celebrate them in your niche to make loyal following  \n37. Support everyone, call out wrong things, add fuel to voice  \n38. Start collaborating with newbies in same channel and niche, add small services  \n39. Start affiliate, referrals etc\n\nTill here, people in communities know you, understand you, and I hope you got 100 customers till this time, minimum 50.\n\n40. Start making systems on current things and keep them going  \n41. Carve out enterprise or LTD deals to get runway  \n42. Start ads to saturate your numbers from this channel  \n43. Start looking for channels and repeat the processes  \n44. Add more SEO work - blogs, pSEO, free tools etc  \n45. Keep AMA sessions  \n46. Work on ads on different channels and double down on highest ROI channel  \n47. Make systems of it, and you should here start thinking of next steps\n\nNext 3 steps?  \nYou will know when you reach 47th step.\n\nI am able to curate this after doing my own 3 micro saas and taking them to some level and I feel it is the most practical, natural and organic way to crack.\n\nI invite all founders to add, correct me but curate a proper set of instructions for every beginner and aspirational person to follow the right path. \n\nI believe these 47 steps are perfect to make your first internet dollar and first thousand internet dollar too. ",
        "subreddit": "Entrepreneur",
        "author": "Getmorebacklinks",
        "score": 77,
        "num_comments": 22,
        "created_utc": 1759105947.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nt49rj/50_steps_i_made_from_idea_to_first_100_customers/",
        "fetched_at": "2025-09-29T16:12:23.975513"
      }
    ]
  }
}