{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-28T01:08:46.816346"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-28T01:08:38.019773"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-12-28T01:08:38.019771"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-28T01:08:37.662691"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-28T01:08:37.662708"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-28T01:08:37.662704"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-28T01:08:37.662702"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-28T01:08:38.019769"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-28T01:08:38.019775"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-28T01:08:38.019758"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-28T01:08:37.662706"
      }
    ],
    "reddit": [
      {
        "id": "1pwcnz3",
        "title": "Bought a $1,200 product from Alibaba, listed it on FB Marketplace for $2,500 out of curiosity. Now I’m wondering if I stumbled onto something real.",
        "selftext": "So here’s the story.\n\nI was looking at some car accessories and kept seeing the same products priced at what felt like a crazy markup. Out of curiosity, I started digging into Alibaba to see what the actual manufacturing cost looked like. After a decent amount of research into suppliers, reviews, and verifying the manufacturer, I pulled the trigger on one unit.\n\nWhen it arrived, I was honestly expecting stereotypical cheap Chinese knockoff quality. But it wasn’t. The build quality was on par with the name-brand US versions I’d been comparing it to.\n\nJust for fun, I threw it up on Facebook Marketplace to see if there was any interest. The response surprised me. My all-in cost including shipping was around $1,200. Comparable products were selling locally for $2,500+. I had multiple inquiries within days.\n\nSo now I’m testing it for real. Bought a few more units, planning to flip them. If it works, I’ll open an LLC and do everything above board.\nHere’s where my background helps: I work in logistics, so I’ve been able to optimize shipping and cut some costs that I think most people wouldn’t know how to avoid. I’m wondering if that gives me a legitimate edge, or if this whole space is so saturated that margins get crushed the moment you try to scale.\n\nMy questions for this community:\n\n\t∙\tIs the “Alibaba to local resale” model played out, or are there still niches where this works?\n\t∙\tDid I just get lucky with this particular product category, or is there a repeatable process here?\n\t∙\tFor those who’ve done this: what’s the capital requirement to actually make it a real business vs. a side hustle?\n\nWould love to hear from anyone who’s tried this, whether it worked or didn’t. Not looking for validation; just trying to figure out if this is worth pursuing seriously or if I should just enjoy the quick wins and move on.",
        "subreddit": "Entrepreneur",
        "author": "Different-Bridge5507",
        "score": 561,
        "num_comments": 320,
        "created_utc": 1766777250.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pwcnz3/bought_a_1200_product_from_alibaba_listed_it_on/",
        "fetched_at": "2025-12-28T01:08:38.864409"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 491,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-28T01:08:45.815005"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 443,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-28T01:08:45.815050"
      },
      {
        "id": "1pwz6oj",
        "title": "18, own a car wash, making profit but I feel empty What should I do?",
        "selftext": " I opened a car wash and I’m 18.\n\nI didn’t go to university and I’m not planning to. But honestly I feel really sad because I keep feeling like I’m “missing something” and maybe I don’t have a real future And I’m actually a failure because my standardized testing scores are all bad.\nI opened the car wash after borrowing 53k$ from my dad (he’s not rich he just believed in me) It took me 3 months to convince him I went to him every day until he finally agreed.\nRight now the business makes around 13k/month in revenue, and about 4000$/month net profit (because it’s Manuel car wash with workers) (even while paying back the loan).\nBut despite that, I feel like something is missing in my life I can’t even explain it properly\nI don’t have stories. I don’t have friendships. I don’t have that university life where people talk, hang out, and share experiences Most of my time I just sit doing nothing I feel empty and far away from people my age.\nI started thinking maybe I should use the money to study abroad (I’m in Saudi) on my own just to “live” and not waste my youth but at the same time I need to manage the car wash.\nAny advice from entrepreneurs who’ve been through something like this? Or had that same sense of emptiness? What would you do if you were in my position?",
        "subreddit": "Entrepreneur",
        "author": "xcfa",
        "score": 172,
        "num_comments": 113,
        "created_utc": 1766845942.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pwz6oj/18_own_a_car_wash_making_profit_but_i_feel_empty/",
        "fetched_at": "2025-12-28T01:08:38.864400"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 163,
        "num_comments": 40,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2025-12-28T01:08:45.815027"
      },
      {
        "id": "1pwtuum",
        "title": "Stop letting developers treat your startup like a research project.",
        "selftext": "I’ve built MVPs for over 30 founders. And the number one reason I see startups run out of money isn't bad marketing.\n\nIt’s **\"Resume Driven Development.\"**\n\nThat’s when a developer convinces you to use the newest, hottest, most complex technology stack because *they* want to learn it to pad their resume, not because your business needs it.\n\nI see pre-revenue startups running on Kubernetes clusters, microservices, and experimental graph databases. They are spending $1,000/month on cloud bills for 5 users.\n\nWhen I come in to build an MVP, I have a strict rule: **We use Boring Technology.**\n\nHere is why \"Boring\" is the best investment you can make:\n\n**1. Boring doesn't break at 2 AM.**\nI use stacks that have been around for 10+ years (like a standard SQL database and a monolith backend). Why? Because every edge case has been solved. When your first customer tries to pay you, you don't want an \"experimental\" library handling the credit card. You want the thing that has processed billions of dollars already.\n\n**2. Boring is cheap to hire for.**\nIf I build your MVP using some obscure, trendy framework that came out last month, you are stuck with me forever. Nobody else knows how to fix it.\nI build using standard, popular tools. That means when you grow, you can hire a junior developer to take over my work easily. I literally engineer myself out of a job, because that’s what is best for *your* business.\n\n**3. Boring is fast.**\nI don’t waste weeks configuring complex cloud infrastructure. I spin up a boring server in 10 minutes. That means I spend the rest of the month building the features your customers actually pay for.\n\n**The \"Commercial Grade\" MVP**\nThere is a difference between a \"prototype\" and a \"product.\"\nA prototype is held together by duct tape.\nA product is simple, but solid.\n\nI don’t build prototypes. I build simple products on solid foundations.\n- I *do* cut scope (we don't need AI-powered avatars yet).\n- I *don't* cut stability (your database will be backed up, and your auth will be secure).\n\nFounders: Check your tech stack. If you can’t pronounce half the tools your dev is using, you might be funding their education, not your product.\n\nFellow devs: Stop over-engineering. The most impressive code is the code that makes money, not the code that uses the most buzzwords.",
        "subreddit": "SaaS",
        "author": "Warm-Reaction-456",
        "score": 161,
        "num_comments": 61,
        "created_utc": 1766827961.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pwtuum/stop_letting_developers_treat_your_startup_like_a/",
        "fetched_at": "2025-12-28T01:08:40.600881"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 154,
        "num_comments": 62,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2025-12-28T01:08:45.815025"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 90,
        "num_comments": 37,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2025-12-28T01:08:45.815023"
      },
      {
        "id": "1pwloje",
        "title": "How are y'all building things so quickly?",
        "selftext": "Seriously though... I see people launching full products in like 2-3 weeks and I'm over here still debugging my auth flow after a month.\n\nWhat's the secret? Are you using no-code tools, pre-built templates, or just way better at scoping than me? Or maybe I'm just overthinking everything (probably this one tbh).",
        "subreddit": "SaaS",
        "author": "Jyzerman9",
        "score": 69,
        "num_comments": 86,
        "created_utc": 1766800929.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pwloje/how_are_yall_building_things_so_quickly/",
        "fetched_at": "2025-12-28T01:08:40.600899"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 68,
        "num_comments": 27,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-28T01:08:45.815048"
      }
    ]
  }
}