{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-23T01:05:36.489826"
  },
  "data": {
    "youtube": [
      {
        "videoId": "24TFLVCceiQ",
        "title": "The Only BOOKKEEPING Tutorial You Need 2025 | For Beginners",
        "description": "Bookkeeping for beginners (2025) explained in under a minute, then a complete step-by-step tutorial. This is a 2 hour free course ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2025-10-02T18:18:19Z",
        "url": "https://www.youtube.com/watch?v=24TFLVCceiQ",
        "fetched_at": "2025-11-23T01:05:27.354749"
      },
      {
        "videoId": "9a04BsKv26M",
        "title": "Top 5 Accounting Software for Small Business (2025 Guide)",
        "description": "My top 5 Accounting Software for Small Businesses. In this updated Bookkeeping software guide, I share my top 5 online ...",
        "channelTitle": "Stewart Gauld",
        "publishedAt": "2025-08-27T11:30:07Z",
        "url": "https://www.youtube.com/watch?v=9a04BsKv26M",
        "fetched_at": "2025-11-23T01:05:27.354756"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-23T01:05:27.354735"
      },
      {
        "videoId": "q_UPVaJL5WA",
        "title": "The Truth About STARTING a Bookkeeping Business in 2025",
        "description": "Ready to pick one niche, get unstuck and get clients to ogrow your business faster? Grab the Profit Booster 1000 Niches PDF + ...",
        "channelTitle": "The Bookkeeping Shop",
        "publishedAt": "2025-05-14T17:30:24Z",
        "url": "https://www.youtube.com/watch?v=q_UPVaJL5WA",
        "fetched_at": "2025-11-23T01:05:27.354765"
      },
      {
        "videoId": "JEAkQLMxqtw",
        "title": "How to Set Up Your Books as a New Business Owner",
        "description": "Bookkeeping doesn't have to be scary—and getting it right from day one can save you major headaches down the road. In this ...",
        "channelTitle": "Mark J Kohler",
        "publishedAt": "2025-04-29T21:54:58Z",
        "url": "https://www.youtube.com/watch?v=JEAkQLMxqtw",
        "fetched_at": "2025-11-23T01:05:27.354752"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-11-23T01:05:27.354742"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-11-23T01:05:27.354740"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-23T01:05:26.983273"
      },
      {
        "videoId": "LgOiQeYkuAA",
        "title": "How to Choose the Best Accountant for Your Small Business",
        "description": "Deciding to hire an accountant is a significant step forward for any business owner. But with so many options out there, how do ...",
        "channelTitle": "CSI Accounting",
        "publishedAt": "2024-03-21T17:50:03Z",
        "url": "https://www.youtube.com/watch?v=LgOiQeYkuAA",
        "fetched_at": "2025-11-23T01:05:27.354777"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-23T01:05:26.983275"
      }
    ],
    "reddit": [
      {
        "id": "1p3cdwi",
        "title": "Being a entrepreneur - designing a site myself with control or finding trusted designers?",
        "selftext": "I started freelancing as a photographer in Austin last month and realized having a proper site is way more important than I thought since some of the commercial artists I know have websites. Word of mouth isn't cutting it for me . Spent hours googling \"small business designers” (forgot to include WEB , smh).. but reviews are all over the place it seems. Did anyone else have this problem when they were first getting set up? How did you finally decide which one to use?\n\nmaestrosites looks interesting but its trustpilot barely has any reviews. How do small business owners typically decide which web designer to use?",
        "subreddit": "Entrepreneur",
        "author": "BrainPuzzled9987",
        "score": 514,
        "num_comments": 39,
        "created_utc": 1763764060.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p3cdwi/being_a_entrepreneur_designing_a_site_myself_with/",
        "fetched_at": "2025-11-23T01:05:28.212206"
      },
      {
        "id": "1p31e3z",
        "title": "Lost a client worth 30% of my revenue, then spotted him on Reddit DIY-ing the project",
        "selftext": "I run a small performance design studio and things are usually steady enough. Over the summer I picked up this new client who ended up becoming a pretty big part of my revenue. We were working on the branding stuff for his new business, the early stage bits, figuring out the look and feel and how he wanted the whole thing to show up.\n\nThen bad luck hit. I got slammed with this severe liver inflammation thing. The doctor told me to stay in bed for 2–3 weeks and cut my workload down so I could actually rest. I was upfront with my client about it, and he was super cool. I even managed to send small updates here and there so the project didn’t stall completely..\n\nBut after a point he just stopped replying. No “hey I need a break,” no “I’m rethinking things,” nothing. Two weeks go by. Nothing. I figured he was busy, but after the third week of being left on read, it hit me that the guy I thought was a long-term partner had just ghosted me without a word .\n\nFast forward to last week, I was scrolling through a business subreddit and saw a familiar brand name on my feed. It was him. He was asking for advice on his DIY branding and positioning assets he generated using some online tool. The stuff he posted was nothing like what he first told me he wanted. It honestly felt like he’d gone in the opposite direction overnight.\n\nTurns out some clients don’t tell you what’s bothering them. They’d rather ask the internet than have a simple five minute conversation.\n\nHas anyone else dealt with something like this or am I just catching weird luck lately ?",
        "subreddit": "smallbusiness",
        "author": "ikushch",
        "score": 487,
        "num_comments": 139,
        "created_utc": 1763738495.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p31e3z/lost_a_client_worth_30_of_my_revenue_then_spotted/",
        "fetched_at": "2025-11-23T01:05:33.525133"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 483,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-23T01:05:35.488459"
      },
      {
        "id": "1p41ad2",
        "title": "I used to screen Pitch Decks for a living. Here is why I rejected 90% of them in 30 seconds. [I will not promote]",
        "selftext": "There is a misconception that investors read your deck. **We don't.**\n\nWe \"skim\" it. You have roughly 30 seconds to buy another 5 minutes of our attention.\n\nI previously worked as an Investment Banking Analyst handling deal flow for early-stage rounds (roughly \\~$12M in total deal value). After screening hundreds of decks, I noticed a specific pattern in the 90% that get auto-rejected.\n\nIf you want to survive the first \"skim,\" fix these 4 things:\n\n**1. The \"Netflix\" Problem (Too much suspense)** If I have to read 5 slides to understand *what you actually do*, I’m already bored. Slide 1 should be: \"We do X for Y by using Z.\" Don't make me guess. Clarity > Cleverness.\n\n**2. The \"TAM\" Hallucination** \"The Global Real Estate Market is $50 Trillion...\" Stop. We know real estate is big. This number is lazy. Tell me your **SAM (Serviceable Available Market)**. How many people can *you* actually sell to *today*? If you can't calculate that bottom-up, you don't know your customer.\n\n**3. The \"Feature\" Dump** Founders love listing features (AI-powered, Blockchain-enabled, Fast). Investors fund **Outcomes**, not Features.\n\n* **Bad:** \"We have an AI chatbot.\"\n* **Good:** \"We reduce customer support costs by 40%.\"\n\n**4. The Fake \"Ask\"** \"We are raising $500k to grow.\" Grow what? The office plants? Be specific: \"We are raising $500k to hire 2 Engineers and 1 Sales Rep to hit $10k MRR in 12 months.\" That is a plan. \"Growth\" is a wish.\n\n**The Hard Truth:** Investors don't fund companies. They fund **stories** that are backed by math. If your story is confusing, the math doesn't matter.\n\nHappy to answer questions about deck structure or what actually goes on inside an Investment Committee meeting.\n\nEdit : This blew up way more than I expected. I’m trying to reply to every comment, but if you have a specific question about your deck structure, it's faster to DM me.",
        "subreddit": "startups",
        "author": "yashhz",
        "score": 317,
        "num_comments": 45,
        "created_utc": 1763838133.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p41ad2/i_used_to_screen_pitch_decks_for_a_living_here_is/",
        "fetched_at": "2025-11-23T01:05:31.838670"
      },
      {
        "id": "1p34f00",
        "title": "Competitor hired our best engineer. He quit after 3 months and asked for his old job back.",
        "selftext": "They offered him $40K more. I couldn't match it. He left. Hurt badly. He knew our entire system. Built half of our core features.\n\n3 months later: email. \"Any chance I could come back?\"\n\nTurns out the competitor is a mess:\n\n15-person eng team, but no clear roadmap\n\nMeetings about meetings\n\nEvery PR needs 4 approvals\n\nMicromanagement from a non-technical CEO\n\nHe said, \"I took the money but hated the work. I miss actually building things.\"\n\nI brought him back. Matched his new salary. We can afford it now.\n\nSometimes losing people is temporary. If your company culture is actually good, people figure it out.\n\nHas anyone else had someone leave and come back? Did you take them back?",
        "subreddit": "SaaS",
        "author": "AdSecret5838",
        "score": 253,
        "num_comments": 117,
        "created_utc": 1763745401.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p34f00/competitor_hired_our_best_engineer_he_quit_after/",
        "fetched_at": "2025-11-23T01:05:30.067036"
      },
      {
        "id": "1p3wziz",
        "title": "We've been paying a contractor 1.5k for 10 months after he stopped working for us",
        "selftext": "I was reconciling our books this weekend (because our finance person quit) and I noticed we’ve been sending monthly payments to a freelance designer who hasn’t delivered anything since January\n\nI messaged him asking if we hired him for something recently and we've forgotten because you've been receiving monthly payments and he said no because (based on his words) I finished that logo project in January. He assumed that we just wanted to keep him on retainer so he didn’t say anything  \nFirst of all retainer is CRAZY. He just kept getting paid because nobody turned off the recurring payment when the project ended!!!!  \nI checked with the team and everyone thought someone else was still using him for stuff. We’re 24 people like how does something like this even happen?\n\nApparently he’s been receiving 1.5k every month for 10 months and figured we knew what we were doing which honestly fair cuz that’s on us not him  \nThe worst part is he’s a nice guy and offered to pay some of it back but like legally that’s our fuckup not his. We just gave him $15k for nothing because nobody communicated...........\n\nHow do you deal with this if you don't have a proper financial team set up?",
        "subreddit": "smallbusiness",
        "author": "SadAlternative2422",
        "score": 234,
        "num_comments": 121,
        "created_utc": 1763827851.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p3wziz/weve_been_paying_a_contractor_15k_for_10_months/",
        "fetched_at": "2025-11-23T01:05:33.525107"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 186,
        "num_comments": 133,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-23T01:05:35.488516"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 183,
        "num_comments": 35,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-23T01:05:35.488502"
      },
      {
        "id": "1p3zovd",
        "title": "I just sold my startup for $980M and I’m still in the womb (breakdown included)",
        "selftext": "Hey everyone! This is John (9 months old)  \n  \nTyping this from inside my temporary studio apartment (aka my mom).\n\nDoctor says I’m crowning soon, so I’ll keep this brief.\n\n# How it started:\n\nAround Week 14, I overheard my parents arguing about hospital bills.  \nMassive market gap detected:  \n  \n**Prenatal financial anxiety is severely underserved.**\n\n# Launching the product:\n\nI deployed v1 during a routine ultrasound.  \nThe technician accidentally saw my dashboard and said “this is better than what our hospital uses.”\n\nBoom: first enterprise client.  \nACV: $12M + free applesauce post-birth.\n\nI slapped a Stripe link on the heartbeat monitor.  \nARR started climbing faster than my amniotic fluid levels.\n\n# Here’s what I learned (3 steps):\n\n1. **Solve real pain.** Expecting parents will spend $400 on a vibrating crib - they will definitely pay for predictive kick analytics.\n2. **Move stupid fast.** The window between morning nausea and afternoon cravings is TINY. Ship before the hormones ship you\n3. **Know when to exit.** I got in contact with a Fortune 500 medical supplier with a $980M offer. I accepted so I could focus on being born.\n\n# What’s next?\n\nProbably learning to open my eyes.  \nMaybe a seed round after that.\n\nAnyway, I hear the doctor saying “push,” so I gotta dip.\n\nAMA once I have fingers.\n\n\\- John | *Fetus, 0*",
        "subreddit": "SaaS",
        "author": "Ok-Series-4597",
        "score": 111,
        "num_comments": 31,
        "created_utc": 1763834315.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p3zovd/i_just_sold_my_startup_for_980m_and_im_still_in/",
        "fetched_at": "2025-11-23T01:05:30.067005"
      },
      {
        "id": "1p3vvmc",
        "title": "hit £31k on gumroad in 3 months selling digital products + ebooks with zero audience and no money",
        "selftext": "so i just hit £31k on gumroad in 3 months and the whole thing started because i was tired of waiting to build an audience first\n\neveryone says grow your instagram or start a newsletter before you sell anything. i just went straight to selling and figured out the audience part later\n\nthe method was kinda backwards but it worked. i went on reddit and twitter and found people complaining about specific problems. not general stuff like i want to make money but specific like i dont know how to organise my content calendar or i need email templates for my consulting business\n\nthen i made exactly that. like word for word what they said they needed\n\ni didnt make some massive course or 100 page ebook. i made small specific digital products. notion templates. canva kits. plug and play stuff people could use in 10 minutes. priced them between £9 and £27\n\nfirst product took me maybe 6 hours to make. launched it in a reddit comment where someone literally asked for that exact thing. made £180 the first week and i was buzzing\n\nthe thing with gumroad is you dont need traffic if your product shows up when people search for it. their discover page actually works if you nail your title and description with the exact words people type\n\nalso i tested the same products on different gumroad accounts for different niches. one for productivity stuff. one for creative templates. one for business tools. keeps everything organised and lets me see what actually sells vs what i think should sell\n\nnow i have like 8 products across a few accounts and some months hit £12k some hit £8k. this month was £31k which is wild\n\nthe biggest thing i learned is people dont buy solutions to big problems. they buy solutions to the annoying small problem theyre dealing with right now\n\nhonestly though now im at this point and its getting messy. managing multiple accounts and customer emails is taking up so much time. im terrible at the automation side of things and i know im leaving money on the table because i cant scale properly\n\nanyone here whos further along than me. how are you handling fulfilment and customer support without it taking over your life. like what tools or systems actually work because im drowning in admin stuff and i know theres a better way to do this",
        "subreddit": "Entrepreneur",
        "author": "dumbl3d00r",
        "score": 79,
        "num_comments": 46,
        "created_utc": 1763825088.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p3vvmc/hit_31k_on_gumroad_in_3_months_selling_digital/",
        "fetched_at": "2025-11-23T01:05:28.212186"
      }
    ]
  }
}