{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-14T16:14:42.468567"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-14T16:14:33.190778"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-14T16:14:33.190781"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-14T16:14:32.912516"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-14T16:14:32.912521"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-14T16:14:32.912502"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-14T16:14:33.190775"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-14T16:14:33.190777"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-14T16:14:32.912518"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-14T16:14:33.190763"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-14T16:14:32.912520"
      }
    ],
    "reddit": [
      {
        "id": "1o5mfjm",
        "title": "Homeless guy abuses free burger privilege, loses it when I can't deliver",
        "selftext": "Hey fellow Redditors,\n\nI own a burger joint that I've been running for 6 months now. Since day one, I've been giving a free burger to a homeless guy who comes in 3 times a week. I've always been happy to help him out, but last week, things took a turn.\n\nHe came in on a Saturday, and I had to tell him I couldn't give him a free burger because I was running low on product. I offered him a side of fries instead, but he lost his temper and started cussing at me. He claimed I was 'full of shit' and that I had plenty of product, which wasn't true.\n\nAs the owner, I'm used to dealing with difficult customers, but this guy's behavior was unacceptable. I yelled at him to leave and told him not to come back.\n\nI know some of you might think I'm a jerk for cutting him off, but honestly, I feel like he took advantage of my kindness for too long. Has anyone else had to deal with a similar situation? How did you handle it?",
        "subreddit": "smallbusiness",
        "author": "BR0C0D3",
        "score": 1071,
        "num_comments": 319,
        "created_utc": 1760368375.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o5mfjm/homeless_guy_abuses_free_burger_privilege_loses/",
        "fetched_at": "2025-10-14T16:14:39.601407"
      },
      {
        "id": "1o5cwx8",
        "title": "I had to fire someone I actually liked, and it messed with my head",
        "selftext": "He wasn’t lazy or toxic. Just slow, always missing small details that cost us time and money. I’d been avoiding the conversation for months because he’s a decent guy, showed up early, stayed late, tried hard. When I finally did it, he just nodded and said, “ Yeah, I kinda knew. ” That line’s been stuck in my head all week. no one tells you how heavy it feels when the business you built means having to hurt someone who trusted you. I know it was the right call, but it still feels like shit.\n\n",
        "subreddit": "Entrepreneur",
        "author": "Niyahog",
        "score": 858,
        "num_comments": 177,
        "created_utc": 1760339390.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o5cwx8/i_had_to_fire_someone_i_actually_liked_and_it/",
        "fetched_at": "2025-10-14T16:14:34.038873"
      },
      {
        "id": "1o5zgpb",
        "title": "Made $4.5k last month because my product name is so short people accidentally turn it into ads",
        "selftext": "My previous startup had a long name - Copilot2trip. Even our team shortened it to \"c2t\" in calls because nobody wanted to say the full thing.\n\nFor my next project, Linkedin content AI tool, I went radically short: 2pr\n\nHere's what happened. When you give an extremly short and meaningless name, people instinctively add the domain when they mention it. They say \"2pr\\[.\\]io\" instead of just \"2pr\" because saying just \"2pr\" sounds awkward or unclear. (hopefully moderators will get that is not a link but core feature of the post/story)\n\nThat becomes a clickable hyperlink automatically.\n\nMost of our signups come from direct links now. People share the name in Slack channels, LinkedIn comments, Reddit threads. Word-of-mouth converts into clickable links without any extra effort.\n\nMade $4500 last month and a 80% of that came from people just dropping the name in conversations.\n\nIf you're venture-backed with a marketing budget, you probably want a memorable brand name like Mistral or Clay.\n\nBut if you're bootstrapping and need scrappy distribution, super short plus meaningless might actually be a hack.\n\nGeniunly, I can't understand why this growth hack idea is not so widely cited or shared",
        "subreddit": "Entrepreneur",
        "author": "PeaceBoring5549",
        "score": 638,
        "num_comments": 125,
        "created_utc": 1760397341.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o5zgpb/made_45k_last_month_because_my_product_name_is_so/",
        "fetched_at": "2025-10-14T16:14:34.038858"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 464,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-14T16:14:41.467167"
      },
      {
        "id": "1o61tbv",
        "title": "Sold my first saas for 20 mil € and retiring (AMA)",
        "selftext": "The title speaks for itself. I've been a software developer for four years. In June, after visiting Google IO in Berlin, I came up with the idea of not just another service, or an agent for the sake of an agent, but a truly in-demand service (at least for me)\nTook a two-week vacation from my corporate, coded practically 24/7, then there was prod release, an advertising campaign on TikTok, constant bug fixing and adding features from comments on the same TikTok.\n\nFour months later, I have over 150,000 regular users, with excellent growth dynamics for new users and existing users upgrading to the Pro plan. And received an email from a huge(old) competitor about a full buyout of the app, including sources and me for a one-year contract.\n\nI agreed to be an advisor, signed the contract, and the first installment arrived today. To say it's a it career speedrun is an understatement :) my relatives don't know, gf non existent. So I'm waiting a year and then leavinf to live my best life.\n\nThere is no point in advertising anything anymore, so I will answer your questions as best I can.\n\nThe most important thing to know is that luck is, of course, very important, but the most important thing is your ideas.",
        "subreddit": "SaaS",
        "author": "No_Donut_6093",
        "score": 386,
        "num_comments": 227,
        "created_utc": 1760403782.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o61tbv/sold_my_first_saas_for_20_mil_and_retiring_ama/",
        "fetched_at": "2025-10-14T16:14:35.932292"
      },
      {
        "id": "1o5nkeh",
        "title": "What's one trick/tip you'd share with another entrepreneur over a beer but would never say publicly?",
        "selftext": "Im running a small eco friendly cleaning supply company for about 3 years now and finally profitable but it got me thinking about things that work but sound weird to say in person. For me its being friends with my competitors. Sounds backwards but theres like 4 other small eco cleaning businesses in my area and we sort of help each other. Like share supplier info or warn about sketchy deals and refer customers when we can't help them. One told me about a logistics company that cut my shipping by 30% and another saved me from a supplier who doesn't reply after first orders.  \n  \nBig chains dont hurt us much since our customers want local and they always complain stuff isnt in stock there anyway. Curious what works for you that feels counterintuitive. Whats your industry and your thing?",
        "subreddit": "smallbusiness",
        "author": "Healthy-Landscape674",
        "score": 215,
        "num_comments": 61,
        "created_utc": 1760370855.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o5nkeh/whats_one_tricktip_youd_share_with_another/",
        "fetched_at": "2025-10-14T16:14:39.601411"
      },
      {
        "id": "1o60ii4",
        "title": "I think I'm fucked",
        "selftext": "I've been running a semi successful cleaning business for 10 years.\n\nHave stagnanted at $300k annual revenue but have really struggled to get past that level.\n\nLast 18 months we've fallen in to Google's dislike pile and have been loosing traffic month over month.\n\nTried fixing things but got on the bad side of the June/July core update and out traffic has almost zeroed out \n\nGoing from 800 organic clicks per day 18 months ago to 10 per day now.\n\nHad a couple contractor teams leave. Latest one is going for surgery due to cancer in a week.\n\nJust had my first child a month ago.\n\nAnd I think I'm fucked. \n\nI can't recruit new teams unless I get the bookings. And I can't get the bookings unless I spend money on marketing. And I don't have money unless I get bookings.\n\nI've spent over $100,000 on SEO \"agencies\" that were essentially BS.\n\nGAds is way different now that it was 8 yrs ago.\n\nI've spent $20k on GAds in the last 6 months and made about $10k from those ads.\n\nAnd this contractor leaving us for cancer surgery makes me think I don't actually have a business anymore.\n\nAm I stuck in sink cost fallacy? Do I actually have a business at all? What do I do if 10yrs experience turns to shit?\n\nI need to voice this out loud and don't want to speak to my wife about it. \n\nNot sure what I'm looking for. Maybe I just need to vent.\n\nEdit: in Australia not US",
        "subreddit": "smallbusiness",
        "author": "BangCrash",
        "score": 190,
        "num_comments": 238,
        "created_utc": 1760400175.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o60ii4/i_think_im_fucked/",
        "fetched_at": "2025-10-14T16:14:39.601409"
      },
      {
        "id": "1o6g42g",
        "title": "I just made $1.5 B by selling my SaaS (AMA)",
        "selftext": "The title speaks for itself. I've been a software developer for four hours. Last night as I was playing with my toy trains in my mom’s basement I came up with the idea of not just another service, or an agent for the sake of an agent but a truly in-demand service. Took a two hour break from scrolling Reddit, watched an 5 minute intro to HTML & CSS tutorial and coded the most brilliant software ever created (to-do app that saves to localStorage).\n\nAn hour later and I have over 100 million visits (DDoS attack) which is truly unimaginable growth, I never expected my product to catch on THIS fast. Also, I received a call from a huge company (Indian customer service I think that tells you all you need to know ;) ) about buying my app for $1.5 billion and a contract that includes free use of the company’s private jet, private island, mansion and more.\n\nI instantly accepted their offer, gave the my mom’s credit card number and internet banking password and am currently waiting for the money to come in. To say it's a it career speedrun is an understatement :) my relatives don't know (my mom has no idea lol), real-life gf non existent. Only my imaginary furry girlfriend knows because I tell her everything (she makes me, otherwise I get punished).\n\nThere is no point in advertising anything anymore, so I will answer your questions as best as I can while waiting for my money to come in. \n\nThe most important thing to know is that luck is, of course, very important, but the most important thing is your ideas.\n\n>I will be answering your questions but I’m closing the AMA because my mom says she wants to have a talk (she must be so proud and happy!!)",
        "subreddit": "SaaS",
        "author": "Ok-Firefighter4745",
        "score": 178,
        "num_comments": 90,
        "created_utc": 1760449951.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o6g42g/i_just_made_15_b_by_selling_my_saas_ama/",
        "fetched_at": "2025-10-14T16:14:35.932288"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 174,
        "num_comments": 48,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-14T16:14:41.467207"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 167,
        "num_comments": 56,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-14T16:14:41.467199"
      }
    ]
  }
}