{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-24T16:14:20.080634"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-24T16:14:11.573372"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-10-24T16:14:11.261491"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-24T16:14:11.261484"
      },
      {
        "videoId": "itpCtsopKTI",
        "title": "Bookkeeping Basics for Small Business Owners (free template!)",
        "description": "Start using Melio for FREE at https://go.melio.com/gillian You can download the Google Sheets template I'm using in this video ...",
        "channelTitle": "Gillian Perkins",
        "publishedAt": "2023-08-01T15:00:40Z",
        "url": "https://www.youtube.com/watch?v=itpCtsopKTI",
        "fetched_at": "2025-10-24T16:14:11.573371"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-24T16:14:11.261470"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-24T16:14:11.573367"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-10-24T16:14:11.573369"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-24T16:14:11.261487"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-24T16:14:11.573355"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-24T16:14:11.261489"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 464,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-24T16:14:19.079175"
      },
      {
        "id": "1oe0bow",
        "title": "How Did the Youngest Self-Made Millionaire You Know Build Their Wealth?",
        "selftext": " Real life examples of young people who built serious wealth on their own, without family money or big startup loans. How did they do it, what industries or skills helped, and roughly how much have they made $1M, $10M, $100M? I want actual stories, not famous names.",
        "subreddit": "Entrepreneur",
        "author": "Reasonable-Tour-8246",
        "score": 298,
        "num_comments": 247,
        "created_utc": 1761217515.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oe0bow/how_did_the_youngest_selfmade_millionaire_you/",
        "fetched_at": "2025-10-24T16:14:12.315216"
      },
      {
        "id": "1oe3wlg",
        "title": "Raised prices 25% and didn't lose a single client",
        "selftext": "Was terrified. I have been undercharging for 3 years because I thought people would leave.\n\ndid the math and realized i was barely breaking even after product costs, rent, staff. needed to raise prices or close down.\n\nsent an email. kept it simple. prices going up in 30 days.\n\nwaited for angry emails and cancellations.\n\ngot two replies. Both said \"makes sense.\"\n\nnobody cancelled. Nobody complained. one person said i should've done it sooner.\n\nApparently I was the only one who thought my prices were too high.\n\nHas anyone else put off raising prices for way too long because of fear that turned out to be totally wrong?",
        "subreddit": "smallbusiness",
        "author": "ilovedoggos_8",
        "score": 256,
        "num_comments": 39,
        "created_utc": 1761227701.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oe3wlg/raised_prices_25_and_didnt_lose_a_single_client/",
        "fetched_at": "2025-10-24T16:14:17.278986"
      },
      {
        "id": "1oe1ps1",
        "title": "Do people actually make money from cold emails or is that just Twitter talk?",
        "selftext": "I’ve sent over 300 emails this month. Got 2 replies. One was an auto responder. I keep seeing people post “I made 10k from cold outreach” like it’s easy.\n\nAt this point I’m convinced there’s something they’re not saying.\n\n  \nAnyone here actually getting real results from cold email? \n\nwhat’s the actual trick\n\n",
        "subreddit": "Entrepreneur",
        "author": "Deeceness",
        "score": 200,
        "num_comments": 154,
        "created_utc": 1761221853.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oe1ps1/do_people_actually_make_money_from_cold_emails_or/",
        "fetched_at": "2025-10-24T16:14:12.315219"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 178,
        "num_comments": 50,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-24T16:14:19.079232"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 173,
        "num_comments": 130,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-24T16:14:19.079196"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 169,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-24T16:14:19.079226"
      },
      {
        "id": "1oeii0z",
        "title": "Considering selling my website, what's a fair exit multiple these days? ($1.3M/year)",
        "selftext": "Hi all,\n\nThrowaway for obvious reasons.\n\nI've been running a website for over 11 years now, and I'm at the point where I'm seriously considering selling to take a break. It's been a good run, but after all these years I'm trying to figure out if now is the right time and what kind of valuation I should realistically expect.\n\nThe site is monetized through advertising, primarily Google AdSense (around 55%), though I've diversified over the years with other ad networks and direct sponsors. All traffic is organic (SEO-driven), and I run a very lean operation.\n\nLast 12 months the business did about $1.3M in revenue with roughly $1.16M in profit (around 90% margins).\n\nHere's where I'm struggling: I've heard wildly different numbers on multiples. Some say sites like this trade at 3x SDE/EBITDA (especially from competitors), while others mention 5-6x or even higher for strategic buyers who see specific synergies.\n\nFor those of you who've recently sold similar businesses, what kind of multiple did you actually get? And what should I be realistically targeting here?\n\nAny guidance would be really appreciated. Thanks in advance!",
        "subreddit": "smallbusiness",
        "author": "tofire_or_nottofire",
        "score": 144,
        "num_comments": 98,
        "created_utc": 1761262044.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oeii0z/considering_selling_my_website_whats_a_fair_exit/",
        "fetched_at": "2025-10-24T16:14:17.278980"
      },
      {
        "id": "1oez2al",
        "title": "Nobody prepares you for how unpredictable income feels when you’re self employed",
        "selftext": "I’ve been running my own thing for about a year now nothing huge, just a small local service business and the biggest surprise isn’t the work itself, it’s how unstable the money feels. One week you’re invoicing five clients and feeling on top of the world, the next you’re refreshing your email every hour waiting for payments to clear while bills pile up like they’re on a timer. It’s this weird mix of pride and panic and no one really talks about how heavy that is.  \nI’ve learned to build a cushion, track everything and celebrate small wins but the unpredictability still messes with my head. Last night I couldn’t sleep, so I opened my laptop for a few minutes just to zone out before bed not even to play seriously just something brainless to stop thinking about invoices.  \nFor those of you doing this longer does the anxiety ever settle or do you just get better at living with it?",
        "subreddit": "smallbusiness",
        "author": "Special-Tax-122",
        "score": 135,
        "num_comments": 21,
        "created_utc": 1761315705.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oez2al/nobody_prepares_you_for_how_unpredictable_income/",
        "fetched_at": "2025-10-24T16:14:17.278974"
      },
      {
        "id": "1oesgod",
        "title": "Ok so what REALLY works for cold email infrastructure? burning through domains here",
        "selftext": "Running a B2B SaaS (\\~800k ARR) and honestly cold email is becoming a nightmare.\n\nwhat's killing us:\n\n\\- warmup taking 3+ weeks per domain\n\n\\- no visibility into actual inbox placement vs spa⁤m (can't trust the platforms)\n\n\\- constantly checking blacklists\n\ntbh starting to think this is just the reality of cold email in 2025 but then i see other companies claiming 5%+ reply rates with thousands of emails daily\n\nanyone actually cracked this?",
        "subreddit": "SaaS",
        "author": "redzkaizer",
        "score": 94,
        "num_comments": 19,
        "created_utc": 1761295300.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1oesgod/ok_so_what_really_works_for_cold_email/",
        "fetched_at": "2025-10-24T16:14:13.973090"
      }
    ]
  }
}