{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-20T16:15:37.565000"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-20T16:15:29.110111"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-20T16:15:28.659696"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-20T16:15:28.659699"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-20T16:15:28.659682"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-20T16:15:29.110109"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-20T16:15:29.110114"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-20T16:15:29.110112"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-20T16:15:28.659703"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-20T16:15:29.110098"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-20T16:15:28.659700"
      }
    ],
    "reddit": [
      {
        "id": "1p17d8b",
        "title": "Found out my \"broke\" client is actually loaded and now I feel like an idiot",
        "selftext": "I do product sourcing consulting on the side. Small operation, just me, been doing it for two years. A potential client reached out last month saying she's a solo entrepreneur trying to launch her first product line but \"really struggling financially\" and could I please work with her at a reduced rate.\n\nI felt bad for her. We've all been there right? So I gave her 30% off my normal rate, brought my project fee down from $4500 to $3000. Told her I remember what it's like starting out and I wanted to help.\n\nFast forward to yesterday. I'm helping her evaluate supplier quotes and she casually mentions she's trying to decide between putting 45k or 60k into her first inventory order. Then she's talking about her \"backup funds\" in case the product doesn't perform well.\n\nI didn't say anything but later I'm thinking wait, if you have 60k liquid to drop on inventory plus backup funds, why were you crying poor about my consulting fee?\n\nSo I did something probably unethical. I looked her up. Her LLC is registered, public record. I found her personal LinkedIn. She's not some struggling entrepreneur. She sold a previous company two years ago. I can't find exact numbers but based on the acquisition announcement and her current lifestyle posts it wasn't small.\n\nShe straight up lied to me to get a discount.\n\nNow I'm sitting here feeling like a complete idiot. I gave her a discount because I thought I was helping someone bootstrap their dream. Turns out she was just negotiating and I fell for the sob story.\n\nPart of me wants to tell her I know and revise my rate back to normal for the remaining work. But we're halfway through the project and I already agreed to the price. Plus if she refers other clients to me that's probably worth more than the $1500 I'm losing here.\n\nBut I'm also pissed. I've turned down two other inquiries this month because I'm at capacity and I'm working with her at a discount while she's sitting on what looks like serious money.\n\nMy wife thinks I should just finish the project and never work with her again. My business partner thinks I should confront her because she disrespected my work and wasted my goodwill.\n\nHonestly I don't even know what the right move is here. I keep thinking about all the hours I'm putting in at a reduced rate while she probably thinks she played me perfectly. Maybe she did.",
        "subreddit": "smallbusiness",
        "author": "Exact-Literature-395",
        "score": 610,
        "num_comments": 318,
        "created_utc": 1763558065.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p17d8b/found_out_my_broke_client_is_actually_loaded_and/",
        "fetched_at": "2025-11-20T16:15:34.818640"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 481,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-20T16:15:36.563614"
      },
      {
        "id": "1p08qzv",
        "title": "Apps in ChatGPT are one of the biggest startup opportunities in years (i will not promote)",
        "selftext": "For more than a decade founders have been building the same categories over and over. Mobile apps, web apps, SaaS dashboards. All solid ideas in the past, but today these markets are so saturated that even excellent teams struggle to get noticed.\n\nWhat almost nobody is paying attention to is the new ecosystem emerging inside ChatGPT. Website traffic is already slipping because users simply ask their LLM to handle the task. And now that ChatGPT Apps exist, full applications with real UI and logic run directly inside the chat. If you are not familiar with them, just watch the announcement from OpenAI on YouTube.\n\nOpenAI will also introduce a full App Store for ChatGPT Apps at the end of this year. Here is the important part. ChatGPT can recommend and use apps automatically, even if the user never installed anything. Distribution happens inside the model itself.\n\nChatGPT has around 800 million weekly users. The Apple App Store had roughly one billion in 2025. The difference is that the ChatGPT App Store is still empty. No incumbents. No real competition. Opportunities like this are extremely rare and the potential is huge.\n\nMany categories can be rebuilt natively for LLMs. Shopping tools, price comparison services, booking engines, finance dashboards, workflow systems, enterprise products. None of the existing solutions can be dropped into an LLM unchanged, so the playing field resets. Anyone who understands this early can release an LLM native version of a proven model and become relevant before the established players react.\n\nYou do not need to outperform the incumbents. You only need to become visible enough to be a threat. When that happens, big companies will either hurry to catch up or eventually buy the challenger to protect their market.\n\nLearning how ChatGPT Apps and MCP work requires some effort, but the upside is entering a new market before everyone else shows up.\n\nIf you want to explore it, just google around. There are already resources and a few early tools that explain how to build these apps.",
        "subreddit": "startups",
        "author": "marsel040",
        "score": 215,
        "num_comments": 66,
        "created_utc": 1763462651.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p08qzv/apps_in_chatgpt_are_one_of_the_biggest_startup/",
        "fetched_at": "2025-11-20T16:15:33.263324"
      },
      {
        "id": "1p18lmr",
        "title": "When your relationship starts crossing into your business life",
        "selftext": "I’m 35M in San Diego and run a small design studio. Things finally feel stable after years of grinding, and most of my net worth is tied up in this company. I’ve been with my partner for a little over two years and the relationship is getting serious talking about moving in, longterm plans, maybe marriage one day.\n\nI didn’t expect it to make me this anxious. I love her, but I also built this business before we even met, and I’m realizing I have no idea how people really blend their personal future with something they spent years building. Even simple conversations about money or longterm planning feel heavier than I thought they would. At one point someone casually mentioned things like prenups or just getting stuff on paper early in relationships, and it honestly made me realize how unprepared I am for these conversations.\n\nOther founders I’ve asked just say you’ll figure it out but that doesn’t help much. If anyone here has gone through this, how did you handle the personal side without feeling like you were putting your business at risk?",
        "subreddit": "smallbusiness",
        "author": "WildlyGlaring",
        "score": 195,
        "num_comments": 25,
        "created_utc": 1763561232.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p18lmr/when_your_relationship_starts_crossing_into_your/",
        "fetched_at": "2025-11-20T16:15:34.818652"
      },
      {
        "id": "1p1z9lc",
        "title": "I Spent $1,500 on LinkedIn Influencers. It Turned Out Wildly Profitable.",
        "selftext": "Hello everyone, I hope you’re doing well.   \n  \nI booked three influencers to promote [my SaaS](http://gojiberry.ai) on LinkedIn, and here are the results.  \n  \n You’ve probably already seen my previous posts. Last time, [I booked five](https://www.reddit.com/r/SaaS/comments/1or644h/i_paid_5_influencers_on_linkedin_to_promote_my/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button), and three of them were completely fake, meaning they were using pods.   \n  \nBased on that experience with the five influencers, I rebooked three.   \n  \nThe one who performed the best last time was in the French-speaking market, so I thought, why not take three people in the French-speaking market this time?\n\nSo I picked three people, budget was 500 dollars per post, for a total of 1,500 dollars.\n\n**How did I find them?** It’s very simple.   \n  \nCompetition on LinkedIn is extremely low.   \n  \nThere are people with audiences worth far more than Instagram or TikTok influencers, because it's B2B and the audience actually has budget.   \n  \nBut since there isn’t huge demand, they’re willing to post for 500 dollars.   \n  \nAnd if you think about it, 500 dollars is five months of someone at 100 dollars per month. Or even one month at 500 dollars. It can be profitable very quickly. For high-ticket products worth several thousand euros per month, it’s almost impossible not to break even.   \n  \nYou just need a few demos, close one client, and you’re good.\n\n**How did I contact them?**   \n  \nI looked at the French influencer who had performed the best last time.   \nI checked who interacted with him the most and who had an audience among those people.\n\n  \nI reached out by sending the post from the previous campaign and said, “We did this promotion with this person, would you be interested?” We agreed on a price, and we were on.\n\nA few things to mention. \n\nMy process is always the same.\n\nI want a post that goes viral, with people commenting a specific keyword. \n\nWhen people comment that keyword, I want the influencer to reply with a link to a Notion document.   \n  \n**Why do we do this instead of directly talking about my tool?**   \n  \nSimply to maximize reach. When I hire a LinkedIn influencer, the goal is to get as many impressions as possible, as many comments as possible, and as many clicks as possible on the links in the comments. \n\n  \nThen the Notion document is basically a blueprint explaining how to implement what was said in the post. And of course, to implement what’s in the post, at some point they will need to click on my SaaS and create a free account.\n\nIt’s a big mistake I see most brands making.   \n  \nI see PipeDrive, I see Canva booking influencers, and no one puts the link in the comments.   \n  \nPeople are lazy. If it’s not a direct click, few people will copy your brand name and search for it.   \nUnless you’re doing brand awareness with a huge budget and you don’t care about conversion, you must put the link directly in the comments.\n\nThen, **how do I make sure influencers actually do the work?**   \n  \nI write the post for them, get it validated, create the Notion resource with dedicated tracking links, and I push them all day to reply to comments.   \n  \nThis is extremely important, because if they don’t do it, it’s basically wasted money.\n\nI booked three influencers, each with their own Notion document.   \n  \nSame content, but different links and images. I wrote the posts, and then they published them on Monday, Tuesday, and Wednesday.\n\nAnother thing you can do:   \n  \nif an influencer is too expensive, negotiate. And if they won’t lower the price, negotiate multiple posts, or ask if they have a newsletter, a YouTube channel, etc. Try to compensate the price difference with extra value. Most of the time, it’s more about price than value. If the influencer says 600 euros, it means he wants 600 euros. But doing one post or two for 600 euros isn’t a huge difference. Negotiate this way, it’s important.\n\nNow for the results.   \n  \nThese three influencers brought a total of 58 trials to my SaaS.  \n  \nOn average, we convert at 30%.   \n  \nThat means around 16 or 17 customers.   \n  \nThat’s 1,600 to 1,700 dollars in MRR. We’ll see if the trial-to-paid conversion matches our usual numbers, but it’s extremely promising.\n\nWhat’s interesting is that the influencer who performed the best last time performed the worst this time because his post completely flopped.   \n  \nStill, he remains profitable. The results are very good. It brought thousands of people to the Notion resource, hundreds of people to my website, and again, 58 people added their card, with around 30% converting.\n\nOn top of that, we know posts continue to live over time. They will keep bringing trials. All the people who didn’t start a trial but saw the resource will see us again later and think, “I’ve seen this tool before,” which makes conversion easier.\n\nSo yes, it’s extremely profitable. \n\n[Here are the posts the influencers made ](https://www.notion.so/Proof-of-influencer-campaign-11-20-2025-2b1b9abcbe3f80c5b619d225a6d64b6a?source=copy_link)\n\nThanks everyone, bye!",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 194,
        "num_comments": 49,
        "created_utc": 1763632592.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p1z9lc/i_spent_1500_on_linkedin_influencers_it_turned/",
        "fetched_at": "2025-11-20T16:15:31.626710"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 189,
        "num_comments": 133,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-20T16:15:36.563666"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 180,
        "num_comments": 35,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-20T16:15:36.563650"
      },
      {
        "id": "1p1t6ke",
        "title": "My SaaS is profitable but I'm exhausted. Thinking about shutting it down anyway.",
        "selftext": "$8K MRR. 78% profit margin. Growing 15% month over month. On paper, this is the dream. In reality? I hate it. I'm the only developer, the only support person, the only marketer, the only salesperson. Every customer email feels like homework I don't want to do. Every bug feels personal. Every churn notification ruins my day. I started this because I wanted freedom. Instead, I built myself a job I can't quit. The Breaking Point Yesterday a customer asked for a feature that would take me 2 weeks to build. Another customer threatened to churn if I didn't add SSO this month. My payment processor flagged 3 accounts for review. And my girlfriend asked when I'm going to stop working at 11pm every night. The answer is never. Because if I stop, the whole thing collapses. I know what people will say: \"Hire someone!\" But hiring means giving up profit margin, dealing with management I've never done, and trusting someone else with my codebase. That sounds worse than the current situation. \"Sell it!\" To who? This is too small for acquirers and too dependent on me to fetch a real multiple. \"Just push through!\" For what? More money I don't have time to spend? Another year of 80-hour weeks? The Honest Truth I'm starting to think profitable isn't the same as worth it. Maybe I'd rather make $5K/month doing something I actually enjoy than $8K doing something that makes me miserable. Or maybe I'm just burned out and need a break. I don't even know anymore. Has anyone else felt this way about a \"successful\" business? What did you do?I also tried putting together an action plan for myself [here](https://gamma.app/docs/Shooting-my-shot-topooiiyrl3kp1n) , but I'd really love to hear how others handled this crossroads.",
        "subreddit": "SaaS",
        "author": "Apprehensive-Tip3800",
        "score": 145,
        "num_comments": 173,
        "created_utc": 1763610689.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p1t6ke/my_saas_is_profitable_but_im_exhausted_thinking/",
        "fetched_at": "2025-11-20T16:15:31.626713"
      },
      {
        "id": "1p1crrw",
        "title": "Unpopular opinion: 90% of SaaS founders are just guessing 😂",
        "selftext": "Hot take: most SaaS founders have no idea what’s actually happening in their market and are just guessing with confidence lol.  \nEvery time someone says we analyzed global demand, I’m like where, how?\n\nBc all I find is ancient pdfs, broken spreadsheets and random data that contradicts itself.  \nStarting to think everyone’s just pretending they did research and hoping nobody asks for receipts.\n\nBe honest  \nHow much of your market knowledge is legit and how much is pure vibes?\n\n",
        "subreddit": "SaaS",
        "author": "Thr04w4yFinance",
        "score": 124,
        "num_comments": 36,
        "created_utc": 1763570791.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p1crrw/unpopular_opinion_90_of_saas_founders_are_just/",
        "fetched_at": "2025-11-20T16:15:31.626740"
      },
      {
        "id": "1p1pnq2",
        "title": "Anybody else start a company while unemployed?",
        "selftext": "I want to know how many unemployed college students decided to start their own businesses since I'm in a similar position. I know that right now in my life the last thing I should be doing is trying to start a company but hell why not be delusional for a while right? Anybody else in a similar boat as me? I'm not looking for advice I'm looking for people who have been in the same boat",
        "subreddit": "Entrepreneur",
        "author": "Dazzling_Hand6170",
        "score": 107,
        "num_comments": 106,
        "created_utc": 1763600713.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p1pnq2/anybody_else_start_a_company_while_unemployed/",
        "fetched_at": "2025-11-20T16:15:29.810786"
      }
    ]
  }
}