{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-25T00:57:27.025189"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-25T00:57:18.264243"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-25T00:57:17.901947"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-25T00:57:17.901950"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-25T00:57:17.901932"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-25T00:57:18.264240"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-25T00:57:18.264246"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-25T00:57:18.264245"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-25T00:57:17.901955"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-25T00:57:18.264229"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-25T00:57:17.901951"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 484,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-25T00:57:26.023819"
      },
      {
        "id": "1p5k9gh",
        "title": "Anyone else hit that point where you’re one bad day away from quitting",
        "selftext": "I keep having this moment in the middle of the day where I just stop whatever I’m doing and feel that heavy holy shit I don’t know how much longer I can keep this up feeling not because I hate the business because I actually care about it a lot but because it feels like I’m constantly two steps behind even when I’m working from the second I wake up. I’ll be answering emails trying to calm down customers fixing problems I didn’t even create and the whole time I’m wondering if I’m actually building something real or if I’m just dragging myself toward a burnout. I can already see coming  \nand it messes with my head because I WANT this to succeed but being the person who has to handle every bill every mistake every decision every tiny fire that somehow becomes a bigger fire makes me feel like I’m carrying a whole building with one hand and the smallest things tip me over like I’ll sit down for a second to breathe or scroll something on my phone and the stress comes right back like it never left. I’m not saying I’m about to quit but it’s starting to feel way too close and way too normal to think about and I don’t know if that’s just part of running a small business or a sign that I’m pushing myself past the point of being okay.",
        "subreddit": "smallbusiness",
        "author": "GhostLion296",
        "score": 225,
        "num_comments": 37,
        "created_utc": 1763998780.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p5k9gh/anyone_else_hit_that_point_where_youre_one_bad/",
        "fetched_at": "2025-11-25T00:57:24.109730"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 182,
        "num_comments": 35,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-25T00:57:26.023874"
      },
      {
        "id": "1p5771r",
        "title": "My SasS hit $2k/mo in 5 months. Here's how I'd do it again from $0",
        "selftext": "So 5 months ago, I was honestly pretty tired of seeing everyone else's success stories while I was still figuring things out. Then I built [my own SaaS called Tydal](https://www.tydal.co/), a marketing tool that helps founders get customers from Reddit.   \nIt's literally just enter your product description -> wait 30 seconds -> dozens of potential customers. It's now pulling in $2k monthly and growing steadily.\n\nSo now I want to share how I'd start over if I had to go back to zero. Here's exactly what I'd do:\n\n**Hunt where the money bleeds**\n\nI'd dig into [r/entrepreneur](https://www.reddit.com/r/entrepreneur/), [r/marketing](https://www.reddit.com/r/marketing/), and agency Facebook groups, but here's the twist - I'd sort by controversial not just top. That's where the real pain lives. People arguing about problems means there's emotion, and emotion means willingness to pay.\n\nFor my SaaS, I saw founders constantly complaining about how hard marketing was. One thread had 200+ comments of people talking about horror stories of them wasting months building but not making any many because they couldn't market at all.\n\n**Validate with wallet signals, not surveys**\n\nDon't ask \"would you pay for this.\" I'd look for people already paying for broken solutions. Check what SaaS tools they mention in their complaints. Look at their LinkedIn - are they using expensive enterprise software that's overkill for their problem?\n\nI found businesses paying $200/month for agencies just to track basic leads. That's a clear wallet signal - they're already spending money to solve this pain badly but I could offer a much better and lower cost alternative.\n\n**Build strategically imperfect**\n\nHere's what everyone gets me wrong - they either code for months OR they use no-code tools that create Frankenstein apps that break under real usage.\n\nI'd say ship fast like an MVP (not something that doesn't work) but solves just 1 core feature, then immediately start testing with real users. Not because coding is hard (we've got tons of tools now), but because the real challenge is getting the user experience right for your specific market.\n\nThe difference? No code tools are great for features, but terrible at understanding market positioning and user flows. You need something that can think strategically about the whole product.\n\n**Infiltrate, don't broadcast**\n\nI'd join 5-7 agency Slack communities and Discord servers as well as founder Reddit communities. Not to pitch but to become the person who always has helpful solutions. Answer questions about marketing, share post templates and real examples.\n\nAfter 2-3 weeks of being genuinely helpful, when someone posts \"our marketing has been a disaster,\" I'd DM them directly: \"saw your post about marketing struggles - I built something specifically for this after having the same nightmare. want to see if it helps?\"\n\n**Offer some sort of free try, but don't give everything away**\n\nI'm not saying give all your features for free, but what I would recommend is having a very limited free trial(like limited usage/features) or a credit card required free trial, so the user still has commitment but still gets to try it the product for free. For my first product, I screwed up here, offered everything for free, and got barely any paying users.\n\nIf I started again, I'd have a 7 day free trial but card required. Here's why: most people that won't put even this level of commitment won't become customers anyway. And the psychological effect of payment creates commitment - they'll actually USE your product and give real feedback.\n\nI learned this from watching other founders. The ones who pay become your best beta testers.\n\n**Scale through operator networks**\n\nInstead of broad Facebook ads, I'd target people who are active in specific communities. These people are already looking for solutions and match my ICP. One success story shared in the right Slack channel or posted in the right Reddit community is worth 100 cold outreach messages.\n\nI'd sponsor agency newsletters, but not the big ones everyone knows about. The smaller, niche ones where every reader is a qualified prospect. ROI is insane because there are no wasted impressions.\n\n**The counter-intuitive stuff:**\n\nCompetition validates your market. When I saw 12 other \"marketing\" tools in my niche, I got excited, not worried. It meant founders were already spending money on this problem.\n\nI just knew if I did it 10x better than any of the other competitors I would stand out amongst the pack, the customers are already here.\n\nBuilding in public is overrated for B2B. Big companies and owners don't care about your journey - they care about results. Save the behind-scenes content for after you have paying customers.\n\nIf you're more B2C or have an audience in smaller founders, then building in public may be worth it but it's very commitment heavy.\n\n**If I started tomorrow:**\n\nDay 1: Pick 3 reddit communities(founder heavy) and start contributing value from day 4 i will start scanning for the top 3 pain points from real conversations  \nmax 1 week for building an MVP addressing the biggest pain, then start DM and comment outreach. By day 15, get first paying customer or pivot the positioning\n\nThe key insight: anyone will pay premium prices for tools that solve specific operational problems. Most don't look for cheap they're looking for effective.\n\n**Reality check:**\n\nMost people fail because they're solving imaginary problems or undercharging for real solutions. Saas tools need to either save time, make money, or reduce risk. Everything else is a nice-to-have that won't survive the first budget review.\n\nThe hard part isn't building the app - it's understanding exactly how agencies think about buying software and positioning your solution in those terms.\n\n*If you have any other questions, let me know, I'm happy to help :)*",
        "subreddit": "SaaS",
        "author": "Lopsided_Funny_6397",
        "score": 102,
        "num_comments": 58,
        "created_utc": 1763957024.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p5771r/my_sass_hit_2kmo_in_5_months_heres_how_id_do_it/",
        "fetched_at": "2025-11-25T00:57:20.814994"
      },
      {
        "id": "1p59cgn",
        "title": "Here’s the biggest lesson I learned",
        "selftext": "I’ve worked with many teams using. Over the years, one thing became very clear: **ERPs don’t fix inventory problems, only strong SOPs do.**\n\nI’ve seen companies implement expensive systems expecting accuracy to magically improve. Instead, the ERP ended up exposing the same issues they already had: inconsistent receiving, undocumented stock movements, incomplete BOMs, and irregular counting routines.\n\nOn the other hand, I’ve also seen small teams using modest ERPs achieve excellent accuracy simply because their SOPs were clear, enforced, and part of daily operations.\n\nThe ERP is just a tool. If the underlying process is weak, the system amplifies the chaos. If the process is strong, the ERP becomes a powerful enabler.\n\nSo after many years around these systems, my biggest takeaway is this:  \n**Get the SOPs right first. The technology will only perform as well as the discipline behind it.**",
        "subreddit": "Entrepreneur",
        "author": "OncleAngel",
        "score": 81,
        "num_comments": 13,
        "created_utc": 1763964079.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p59cgn/heres_the_biggest_lesson_i_learned/",
        "fetched_at": "2025-11-25T00:57:18.925514"
      },
      {
        "id": "1p5c0fs",
        "title": "What is an AI tool that helps you operate like a much bigger company than you are?",
        "selftext": "AI is often cited as something that would technically allow people to start 1 person billion dollar companies/unicorns. This is a fascinating idea! So really curious, what is an AI tool that helps you operate like a much bigger company than you are already?",
        "subreddit": "Entrepreneur",
        "author": "Sure_Marsupial_4309",
        "score": 70,
        "num_comments": 39,
        "created_utc": 1763973980.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p5c0fs/what_is_an_ai_tool_that_helps_you_operate_like_a/",
        "fetched_at": "2025-11-25T00:57:18.925510"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 70,
        "num_comments": 43,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-25T00:57:26.023850"
      },
      {
        "id": "1p5ibhk",
        "title": "hot take: the first 10 users of any startup are just people who liked the founder- I will not promote",
        "selftext": "so I was watching this Sauce VC podcast on Masters union yt channel (don’t ask why, I was procrastinating)\n\nand they said something like: **“the founder’s passion attracts the first alpha users + early employees.”** and honestly… yeah. I’ve literally never seen an early-stage startup where the *product* was the reason people showed up. it’s always the founder. their energy. their delusion.\n\nso tell me if you’ve ever joined an early startup or tested an early app… did you do it for the product or because the founder was your friend ???",
        "subreddit": "startups",
        "author": "Alternative-Wish9912",
        "score": 62,
        "num_comments": 31,
        "created_utc": 1763994143.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p5ibhk/hot_take_the_first_10_users_of_any_startup_are/",
        "fetched_at": "2025-11-25T00:57:22.566055"
      },
      {
        "id": "1p5j55a",
        "title": "What 5,000 clients didn’t prepare me for when building SaaS",
        "selftext": "I’ve spent the last decade running an animation studio.  \nAbout 5,000 projects, every type of client you can imagine, every weird request, every last-minute “urgent” change.\n\nNow I’m building a SaaS product (from prompt to a full production-ready video), and the transition has been way more surprising than I expected.\n\nHere are the biggest differences I didn’t see coming:\n\n**• In services, you solve a client’s specific problem. In SaaS, you have to solve a repeatable pattern.**  \nI was used to tailoring things to each client.  \nIn SaaS, doing that is basically shooting yourself in the foot.  \nThe product needs to work for *everyone* (well, the ideal ICP you define), not one person with a unique use case.\n\n**• In services, variety is normal. In SaaS, variety = complexity = pain.**  \nMy instinct was always “sure, let’s support that too.”  \nIn SaaS, every extra option creates support issues, UX issues, and new edge cases.  \nIt took me a while to get used to saying “no.”\n\n**• In services, you can explain your way out of confusion. In SaaS, the product has to do that job alone.**  \nWith clients, I could hop on a call, send examples, clarify scope.  \nSaaS users won’t wait.  \nIf something isn’t obvious in the first 10 seconds, they’re out.\n\n**• In services, deadlines push you. In SaaS, nothing pushes you unless you push yourself.**  \nI was used to clients keeping me accountable just by existing.  \nNow it’s just me, a product, and a blank calendar.  \nDifferent kind of discipline.\n\n**• In services, experience is an asset. In SaaS, it can become a bias.**  \nI assumed I knew what users wanted because I’ve worked with thousands of clients.  \nTurns out that’s not always true.  \nThings that matter a lot to experts don’t matter at all to new users.\n\n**• In services, work equals progress. In SaaS, only user behavior equals progress.**  \nI used to feel “productive” by simply working hard on a project.  \nIn SaaS, you can work for a week and realize you built the wrong thing (happened too often).\n\nThe switch has been both really fun and really uncomfortable, and I’m still unlearning a bunch of old habits.\n\nAnyone else here moved from service business → SaaS?",
        "subreddit": "SaaS",
        "author": "Founder_Guy",
        "score": 60,
        "num_comments": 2,
        "created_utc": 1763996145.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p5j55a/what_5000_clients_didnt_prepare_me_for_when/",
        "fetched_at": "2025-11-25T00:57:20.814985"
      },
      {
        "id": "1p4vhwx",
        "title": "Do we need terms of service and privacy policy before launching? (I will not promote)",
        "selftext": "We're about to go live with our beta next week (project management tool for creative agencies) and someone just asked me where our terms of service and privacy policy are. We've been focused quite  a lot on building the product and not so much when it comes to the legal side of it\n\nI found some free templates online and they seem fine but a lawyer friend of mine told me those generic ones don't actually protect you and we should get them reviewed  \nWhat should I do here? Did yall pay for custom legal docs or just use templates? And is this something that actually matters before launch or can it wait until we have real traction?   \nWe're collecting emails and basic profile info if that changes anything",
        "subreddit": "startups",
        "author": "Asleep-Link-2470",
        "score": 51,
        "num_comments": 29,
        "created_utc": 1763925965.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1p4vhwx/do_we_need_terms_of_service_and_privacy_policy/",
        "fetched_at": "2025-11-25T00:57:22.566091"
      }
    ]
  }
}