{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-28T00:56:10.395415"
  },
  "data": {
    "youtube": [
      {
        "videoId": "Q1tCEvqakUo",
        "title": "Fastest Editing Workflow in DaVinci Resolve! - Perfect for Tutorials and How To Vids!",
        "description": "Get the FREE practice media here: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2025-10-14T14:00:41Z",
        "url": "https://www.youtube.com/watch?v=Q1tCEvqakUo",
        "fetched_at": "2025-11-28T00:56:00.291580"
      },
      {
        "videoId": "_XySZQrHPCE",
        "title": "Steal This Easy Vlog Editing Workflow, It&#39;ll Simplify Everything",
        "description": "Get 2 extra months free on an annual plan from Motion Array https://geni.us/tEEoIY 🎞️ New to video editing? Learn the ...",
        "channelTitle": "Tamara Gabriel",
        "publishedAt": "2025-07-18T11:18:22Z",
        "url": "https://www.youtube.com/watch?v=_XySZQrHPCE",
        "fetched_at": "2025-11-28T00:56:00.291590"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-28T00:56:00.571563"
      },
      {
        "videoId": "mjiT0g3mYgw",
        "title": "9 Editing Tips To Save HOURS in DaVinci Resolve!",
        "description": "9 Editing Tips in DaVinci Resolve you probably didn't know! In this DaVinci Resolve tutorial, I'm going to show you 9 powerful ...",
        "channelTitle": "Sightseeing Stan",
        "publishedAt": "2025-05-26T14:01:15Z",
        "url": "https://www.youtube.com/watch?v=mjiT0g3mYgw",
        "fetched_at": "2025-11-28T00:56:00.291587"
      },
      {
        "videoId": "NIf8S185ONk",
        "title": "The iPad Pro is Ready for Video Editing",
        "description": "using the iPad Pro and speed editor with Davinci Resolve to edit and color grade an entire video for YouTube. iPad Pro M4 13” ...",
        "channelTitle": "Tommirock",
        "publishedAt": "2025-05-16T22:50:24Z",
        "url": "https://www.youtube.com/watch?v=NIf8S185ONk",
        "fetched_at": "2025-11-28T00:56:00.291599"
      },
      {
        "videoId": "8MQfZTjbvPw",
        "title": "🔥 This FREE plugin will change your video editing workflow FOREVER!",
        "description": "Say hello to Premiere Composer, packed with transitions, sound effects, and motion graphics #videoeditingtips #premierepro ...",
        "channelTitle": "Sebastien Jefferies",
        "publishedAt": "2025-04-15T17:21:05Z",
        "url": "https://www.youtube.com/watch?v=8MQfZTjbvPw",
        "fetched_at": "2025-11-28T00:56:00.291594"
      },
      {
        "videoId": "DYOPXAmwHgA",
        "title": "Final Cut Pro 11: Boost Your Workflow with AI Magic! |@TECHSENSEI24",
        "description": "Final Cut Pro 11: Boost Your Workflow with AI Magic! Join Marques Brownlee, Andrew Manganelli, and David Imel in this ...",
        "channelTitle": "TECH SENSEI",
        "publishedAt": "2024-11-17T14:30:09Z",
        "url": "https://www.youtube.com/watch?v=DYOPXAmwHgA",
        "fetched_at": "2025-11-28T00:56:00.291603"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-28T00:56:00.291559"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-11-28T00:56:00.291565"
      },
      {
        "videoId": "QIJPxeI--QQ",
        "title": "Effective Editing Workflow that can save you hours! Davinci Resolve Beginner Tips",
        "description": "Download the HeartSupport Media files here: https://www.groundcontrol.film/heartsupport And you can download my Keyboard ...",
        "channelTitle": "MrAlexTech",
        "publishedAt": "2024-05-27T22:41:51Z",
        "url": "https://www.youtube.com/watch?v=QIJPxeI--QQ",
        "fetched_at": "2025-11-28T00:56:00.291585"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 482,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-28T00:56:09.393980"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 275,
        "num_comments": 96,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-11-28T00:56:09.393990"
      },
      {
        "id": "1p7ij2q",
        "title": "I just hired my uber driver",
        "selftext": "About a month ago, I got a ride from a bright and starry-eyed 20s-something who had just moved to my city. He left his family behind, some 1,500 miles away - said he wanted to make it and seek out opportunity.\n\nWe got to chatting, told him a bit of my backstory selling across FAANG, some startups, and now being a founder. Turns out he has a background in sales and is hungry for knowledge + experience. I've been wanting to mentor a seller since I never had one myself (apart from the books I read), and this is the first time someone has actually taken me up on the offer. It's crazy considering how many people say they want to make it but don't take any initiative.\n\nI'm giving him a chance in hopes that grit and sheer determination outperform pedigree (we typically recruit from Ivy League and technical universities). I've always held the hypothesis that many people have the drive to better their lives, but not everyone has the opportunity. Now we get to test it. Anecdotally there seem to be three core elements to success in entry-level B2B; the \"Want\"; the intelligence filter; and the execution filter.\n\nI've hired him on as a BDR on a 6 month contract. By my calculations, if he's even 60% as good as I am at setting appointments, both the company and he will have positive financial outcomes.\n\nI look forward to updating the group as this progresses, and I hope this serves as a gentle reminder to take a chance on the underdog.\n\nHappy U.S. Thanksgiving to those that observe.",
        "subreddit": "Entrepreneur",
        "author": "WAp0w",
        "score": 272,
        "num_comments": 38,
        "created_utc": 1764188843.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p7ij2q/i_just_hired_my_uber_driver/",
        "fetched_at": "2025-11-28T00:56:01.362111"
      },
      {
        "id": "1p7skdk",
        "title": "For those of you who grew up poor but became rich. How did you actually do it?",
        "selftext": "I’m 18 and grew up without much money, and I’ve always wanted to invent something or start some type of business. The hard part is that almost every market looks either overcrowded or completely dead. I’m also income-restricted right now, I don’t have a high-paying job, and I’m honestly not great at saving (I’m working on that though).\n\nSomething else worth mentioning! \nI work in a pretty wealthy area, so I deal with rich customers every day. I see the lifestyle up close. The cars, the casual spending, the confidence, but I don’t know how they got there. And it makes me wonder what their starting point looked like.\n\nSo I want to ask the people here who actually lived it. If you grew up poor and became rich, what did you specifically do to get there?\nWhat steps did you take, what choices mattered most, and how did you break out of the cycle when you didn’t have money, connections, or a safety net?\n\nI’m not looking for generic answers like “just work hard.” I mean the real, practical path you took. Especially during those early years when you were broke and everything felt impossible.\n\nThanks to anyone willing to share. I really appreciate it.",
        "subreddit": "Entrepreneur",
        "author": "Exotic-Call-4906",
        "score": 248,
        "num_comments": 124,
        "created_utc": 1764216489.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1p7skdk/for_those_of_you_who_grew_up_poor_but_became_rich/",
        "fetched_at": "2025-11-28T00:56:01.362087"
      },
      {
        "id": "1p7vmr2",
        "title": "Why everyone here is acting like they are multi millionaires…",
        "selftext": "Whenever I read something on here like comments, “advices”. Everyone is acting like they have some crazy successful businesses and generates them millions of dollars in profit every year. Is it true or is it the same concept that all men on reddit are 6’2” stud and have 8 inches?  \n\nIt seems like they all don’t have any issues with their businesses, just being here to judge people, all the advices here I see is “why didn’t you just do the right thing?” \n\nSometimes I forgot this is “small” business subreddit when I read things on here. Feels like you all should be on millionaire subreddit not here. ",
        "subreddit": "smallbusiness",
        "author": "No_Dirt_8834",
        "score": 167,
        "num_comments": 160,
        "created_utc": 1764226710.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p7vmr2/why_everyone_here_is_acting_like_they_are_multi/",
        "fetched_at": "2025-11-28T00:56:07.547558"
      },
      {
        "id": "1p7irop",
        "title": "Who actually does business with those random texts and phone calls we all get “you’ve been approved for $256,000 for your business”",
        "selftext": "Part of me really wants to mess around with some of them just to see how far along they will go or if it’s just a scam to get my ACH information. I don’t know how the hell I got on a business owner phone list but I get at least three or four texts a day and probably another two or three voicemails every day about business funding for my business. If they reach me, I try to tell him I don’t have a business I never have and I don’t know why they have my information, but it doesn’t reduce the number of calls I get. I wonder if they actually do any business and find people desperate enough for these kinds of Loans?\n\nOne I got a text for approval of a random number like $276,500.  I responded with, “gosh sorry I only need $260,000” and INSTANTLY got a call from a dude based in US that didn’t sound overly scammy.  I listened to his spiel then told him I had zero interest doing business with someone who cold texts me, and to stop calling and texting me",
        "subreddit": "smallbusiness",
        "author": "bluegrass__dude",
        "score": 164,
        "num_comments": 58,
        "created_utc": 1764189420.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1p7irop/who_actually_does_business_with_those_random/",
        "fetched_at": "2025-11-28T00:56:07.547579"
      },
      {
        "id": "1p7yuy8",
        "title": "How I hijack \"Engagement Farming\" posts on LinkedIn to generate leads",
        "selftext": "You have likely seen those engagement farming posts on LinkedIn where the author asks everyone to comment a specific keyword to get a resource. The problem is that the author is often just looking for engagement and never actually sends the promised book or answer.\n\nI found a way to take advantage of these posts to extract leads and get crazy results in my outreach.   \n  \nStep 1: Find a post with tons of engagement in your niche. If the author isn’t replying to comments, that’s a good sign, go for it.  \n  \nStep 2: Extract everyone who liked or commented. You can do it with a tool.   \n  \nStep 3: Send them a LinkedIn message and an email saying: “I saw you commented on a post to receive a resource about (topic). Did you get it?”  \n  \nThey’ll say no, and then you simply send them your own guide.  \n  \nI started doing this a few days ago and I’ve never seen better results in cold outreach.  \n  \nGood luck, and go get them!\n\nI made a video showing exactly how to do this [https://www.youtube.com/watch?v=0cmJH8nCeeM](https://www.youtube.com/watch?v=0cmJH8nCeeM)",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 87,
        "num_comments": 25,
        "created_utc": 1764238939.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p7yuy8/how_i_hijack_engagement_farming_posts_on_linkedin/",
        "fetched_at": "2025-11-28T00:56:03.187805"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 74,
        "num_comments": 50,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-11-28T00:56:09.394014"
      },
      {
        "id": "1p8a9z3",
        "title": "Customer paid $2400 upfront for annual plan. Emailed 3 days later asking for refund.",
        "selftext": "Thought I'd won the lottery when I saw that Stripe notification. Annual plan. Full year paid. $2400.\nSent them a welcome email, got their account set up, even recorded a personal walkthrough video.\nDay 3: \"Hey, this isn't what I thought it was. Can I get a refund?\"\nProcessed it immediately. Asked what went wrong.\n\"I thought it did [completely different thing that was never mentioned anywhere on the landing page].\"\nI have no idea where they got that idea. My landing page is pretty clear. Demo video shows exactly what it does.\nBut whatever. They're gone. I'm out $2400 and like 4 hours of onboarding time.\nThe annoying part is I can't even learn from it. They misunderstood something fundamental that I can't figure out how to make clearer.\nThis happen to anyone else? Big payment followed by immediate regret?\n",
        "subreddit": "SaaS",
        "author": "Bulky-Economy-6746",
        "score": 71,
        "num_comments": 46,
        "created_utc": 1764270246.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p8a9z3/customer_paid_2400_upfront_for_annual_plan/",
        "fetched_at": "2025-11-28T00:56:03.187799"
      },
      {
        "id": "1p7zs07",
        "title": "After 12 failed side projects in 2024 and 2025, I finally figured out the real reason most of us never make it",
        "selftext": "I have wasted the last 18 months starting and abandoning projects.  \n2025 was going to be the same until I had a stupidly obvious realization that changed everything.The difference between people who make it and people who dont isnt:\n\n* Better ideas\n* More money\n* Knowing the right framework\n* Being a 10x engineer\n\nIt’s literally just this:\n\nThey finish the ugly v1 and ship it while the rest of us are still polishing the landing page.\n\nThat’s it. That’s the whole cheat code. I used this same strategy for [my saas](https://bigideasdb.com).\n\nOnce I accepted my first version would suck, everything became 10x easier. Stopped caring about perfect design, perfect name, perfect tech stack. Just shipped something that barely worked and fixed it in public. If you are stuck right now, do this today:\n\n1. Pick your dumbest, most boring idea\n2. Give yourself exactly 14 days\n3. Ship it even if you hate it\n\nYou will either make something people want or you will finally kill the idea and move on.\n\nEither way you win. Currently on weekend #3 of forcing myself to follow my own advice. Feels terrifying. Feels amazing.\n\nWho’s with me?",
        "subreddit": "SaaS",
        "author": "Important_Word_4026",
        "score": 66,
        "num_comments": 28,
        "created_utc": 1764242288.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1p7zs07/after_12_failed_side_projects_in_2024_and_2025_i/",
        "fetched_at": "2025-11-28T00:56:03.187807"
      }
    ]
  }
}