{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-17T16:14:41.395337"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-17T16:14:33.454871"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-17T16:14:33.134422"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-17T16:14:33.134414"
      },
      {
        "videoId": "itpCtsopKTI",
        "title": "Bookkeeping Basics for Small Business Owners (free template!)",
        "description": "Start using Melio for FREE at https://go.melio.com/gillian You can download the Google Sheets template I'm using in this video ...",
        "channelTitle": "Gillian Perkins",
        "publishedAt": "2023-08-01T15:00:40Z",
        "url": "https://www.youtube.com/watch?v=itpCtsopKTI",
        "fetched_at": "2025-09-17T16:14:33.454874"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-17T16:14:33.134402"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-17T16:14:33.454869"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-17T16:14:33.454873"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-17T16:14:33.134418"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-17T16:14:33.454858"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-17T16:14:33.134420"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 452,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-17T16:14:40.393905"
      },
      {
        "id": "1nj421k",
        "title": "This is fucking too hard.",
        "selftext": "I thought Entrepreneurship will be somewhat okay, yes, I'm expecting it to be hard, but fuck it's HARD. \n\nI wanted to start a business to escape being an employee and earn \"freedom\" and what I got is fucking sleepless nights, panic attacks, isolation, budget I cannot spend for some travel to live life (reinvesting it to business), failures, fatigue, and loneliness.\n\nInstead of freedom, what I got is fucking headache, and no time for myself. Being available at all times(except sleeping), and fucking I can't even have clarity on what to do next. FUCK.\n\nI wished that it wasn't this hard, but yep, I gotta continue, consistency matters most. It's the hope of freedom that continue me to move.\n\n ",
        "subreddit": "Entrepreneur",
        "author": "OutsmartBetter",
        "score": 343,
        "num_comments": 127,
        "created_utc": 1758084890.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nj421k/this_is_fucking_too_hard/",
        "fetched_at": "2025-09-17T16:14:33.945312"
      },
      {
        "id": "1nig3hm",
        "title": "Is it dumb to start a side hustle with only $300?",
        "selftext": "I’ve been saving a little from each paycheck and I got around $300 set aside from a win on grizzly's quest. Part of me wants to use it to try something like flipping products or maybe starting a small online store. The other part of me thinks $300 is nothing and I’ll just lose it. Have any of you ever started something with almost no money? Did it actually work?",
        "subreddit": "Entrepreneur",
        "author": "Careless-Fig-2543",
        "score": 212,
        "num_comments": 102,
        "created_utc": 1758025770.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nig3hm/is_it_dumb_to_start_a_side_hustle_with_only_300/",
        "fetched_at": "2025-09-17T16:14:33.945352"
      },
      {
        "id": "1nhq8bf",
        "title": "Am I just bad at this or is founder life actually impossible??  \"i will not promote\"",
        "selftext": "i'm about 18 months into my startup and i feel like i'm drowning every single day. i genuinely can't keep up with all the random shit that needs to get done. my typical day: answer slack messages, put out fires, realize i forgot to invoice someone from last month, deal with a customer complaint, try to work on actual product development for maybe 30 mins before another crisis hits. by the end of the day i'm fried and i haven't accomplished anything that actually moves the business forward.\n\nthe weird part is i LOVE the vision. i love building something new and solving big problems. but 90% of my time is spent on administrative bullshit. i see other founders posting about their wins on twitter and linkedin and i'm over here like... how tf do you people have time to even think strategically?? am i just terrible at this or is everyone else faking it til they make it too?? thinking about hiring help but also feels like admitting defeat. shouldn't i be able to handle this myself?",
        "subreddit": "startups",
        "author": "Lettil96",
        "score": 151,
        "num_comments": 93,
        "created_utc": 1757952858.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1nhq8bf/am_i_just_bad_at_this_or_is_founder_life_actually/",
        "fetched_at": "2025-09-17T16:14:37.110858"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 146,
        "num_comments": 177,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-17T16:14:40.393953"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 120,
        "num_comments": 33,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-09-17T16:14:40.393916"
      },
      {
        "id": "1niue48",
        "title": "How would you make 100k in one year?",
        "selftext": "How would you do it? No drop shipping, selling guides, ai get out of work crap. If you had to, in the real world, how would you do it? ",
        "subreddit": "Entrepreneur",
        "author": "Key-Tie1484",
        "score": 119,
        "num_comments": 227,
        "created_utc": 1758058149.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1niue48/how_would_you_make_100k_in_one_year/",
        "fetched_at": "2025-09-17T16:14:33.945327"
      },
      {
        "id": "1nj9z05",
        "title": "found an interesting tool on hugging face that removes watermarks",
        "selftext": "I was going down a rabbit hole on hugging face the other day and stumbled on a project called NoWatermark. it’s basically an ai tool that takes in an image and removes the watermark from it. the crazy part is that it actually does a decent job on most images i tested.\n\nmade me think about how fast these little experiments are turning into products. hugging face spaces makes it super easy for devs to launch something that looks and feels like a live tool without worrying much about infra. even if the project is small, it shows how quickly an idea can be put in front of users.\n\nthe link if you wanna check it out: https://huggingface.co/spaces/abdul9999/NoWatermark\n\ncurious what you all think about tools like this in the context of saas. do you see something like watermark removal being turned into a legit service (for photographers, designers, or even cleaning up old archives), or do you think it always runs into copyright/legal walls? feels like there’s a fine line between useful and misuse here.\n\nalso wondering how people approach the “ethics vs demand” problem when building tools. like, just because you can build it and people will use it, should you?\n\nwould love to hear your thoughts.",
        "subreddit": "SaaS",
        "author": "krispwah_destination",
        "score": 115,
        "num_comments": 3,
        "created_utc": 1758106808.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1nj9z05/found_an_interesting_tool_on_hugging_face_that/",
        "fetched_at": "2025-09-17T16:14:35.553133"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 111,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-17T16:14:40.393957"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 95,
        "num_comments": 59,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-17T16:14:40.393938"
      }
    ]
  }
}