{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-04T08:15:10.017031"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-04T08:15:03.120694"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-09-04T08:15:03.120698"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-04T08:15:02.765588"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-04T08:15:02.765579"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-04T08:15:02.765566"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-04T08:15:03.120692"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-04T08:15:03.120696"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-04T08:15:02.765584"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-04T08:15:03.120681"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-04T08:15:02.765586"
      }
    ],
    "reddit": [
      {
        "id": "1n7kwaj",
        "title": "Automated local newsletter makes $500k/year",
        "selftext": "Hi all - I'm an economist studying and building automations for media operators.\n\nI just did an analysis of a local newsletter in Salina, Kansas with fully automated content on track for $500k revenue in 2025.\n\nI think especially with the death of standard niche sites - this will be an interesting case study to get you guys thinking of new possibilities.\n\n## Basic Details\n- The newsletter is **Salina311**, a local newsletter in Salina, Kansas.\n- Did $400k in 2024, on track for $500k in 2025\n- 27k free subscribers, 2.5k paid subscribers\n- Started by Matt Moody, a serial AI/ML entrepreneur, in 2021\n- **All the content is automated** by various AI agent/workflows (described below)\n\n## Revenue Streams\n\n- Advertising: $180k\n- Subscriptions: $220k (digital & print)\n- Events: $12k (I'll describe this below)\n- Legal notices: $95k (this too)\n\n## Content Automation\n\nThe content in Salina311 is all automated by specialized agents. Some examples:\n\n- **Public Meeting Agent**: Transcribes public meetings on YouTube with OpenAI Whisper, identifies key points, turns key points into headlines, writes articles and sends to Ghost by API, sends Matt a text message to review (by Twilio)\n- **Interview Agent**: Uses Gmail API to conduct back and forth async interviews with public figures. Once interview is finished, drafts article, sends to Ghost by API, and sends Matt a text message to review:\n\nThere are also other less agentic content automations, for example:\n\n- Scraping crime statistics and local crimes committed into a weekly crime newsletter\n- Scraping obituaries posted elsewhere and parsing those submitted by forms into a weekly obituaries section\n\n## Ad Sales\n\nSince all the content is automated, Salina311 both gets a ton of ad slots, and Matt can devote energy to selling out ads.\n\nIn August 2025, the top slot in the daily newsletter was sold out on all days except one.\n\nIn 2025, he's on track for **$180k from ad sales**.\n\n## Subscriptions\n\nSalina311 has 2500 paid subscribers. While most of the paid subscribers are digital subscribers, most of the revenue comes from the print subscribers.\n\nHowever, supporting about ~1k print subscribers has significant up front and variable costs which aren't the case for digital subscribers.\n\nWhat makes the print edition actually worth it to Matt is the **public and legal notices** revenue.\n\n## Legal Notices\n\nMany jurisdictions (cities/counties) around the United States require that public notices be printed in some local newspaper.\n\nThe designated newspaper is called the **Newspaper of Record**.\n\nMany weekly newspapers in small US communities are **ghost newspapers** which have almost no real content other than public and legal notices.\n\nSalina311 is locally owned, and despite being fully automated, produces real content meeting community needs. For these reasons, Matt was able to win in 2023 the rights to be the Newspaper of Record for Saline County, Kansas over a non-locally owned incumbent.\n\nBetween a fixed fee coming from Saline County and variable fees for legal notices (e.g. LLC formation) from the community, Salina311 collects $95k in legal and public notices revenue.\n\n## Boosted Events\n\nThe content automations also free up Matt to experiment with new revenue streams. \n\nIn June, Matt launched an events calendar where community members can submit events and pay for them to be featured on the site and in the newsletter.\n\nThe events calendar is bringing in about $1k/month.\n\n## Additional Details\n\nI'm going to interview Matt soon for my YouTube channel/site, so LMK if you have any questions you'd like me to ask him!",
        "subreddit": "Entrepreneur",
        "author": "MiltonWatterson",
        "score": 684,
        "num_comments": 96,
        "created_utc": 1756919878.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n7kwaj/automated_local_newsletter_makes_500kyear/",
        "fetched_at": "2025-09-04T08:15:03.546682"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 447,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-04T08:15:09.015649"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 273,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-09-04T08:15:09.015705"
      },
      {
        "id": "1n6z4bu",
        "title": "DO NOT be scammed into joining the BBB.",
        "selftext": "This is a lessons learned I wish I didn't have to share.\n\nA few months ago, I started a simple creative solo local business as a side gig, and as soon as I had joined my local Chamber of Commerce, I got spammed with calls from the BBB that made me think I was missing out. Their salesman was very good in making me feel like there was an urgency to address this.\n\nAfter a lot of back and forth, I hate to admit that I got ~~coerced~~  convinced into getting a membership with them. They charged me for a full years amount even though I asked for a monthly (to test it out). After a very angry phone call, I convinced them to refund me the full amount and put me on a monthly plan, again to test it out. However, my instincts made me INSIST on having a written confirmation by the salesman that I have 120 days to cancel and have a full refund emailed to me. I'm so glad I did.\n\nI put a calendar reminder in about 3 months to cancel the membership (because the plan was always to get out of this mess). The time has come, and after replying to that same email confirmation of a refund, I gave them a call to start the process. The same guy tried to pull on the sleazy salesman tactic, which I was having none of, and he was trying very hard to get me off the phone call. First by saying I actually OWED them hundreds of dollars for the remainder of the year, then switched to saying they'll leave me active for another month and then maybe cancel, neither of which he had any ground to stand on.\n\nFinally, when he said they'll just cancel the membership with no refund it's been over 90 days, I asked him to help me understand what part of (copy/pasta from the email) \"*If you decide to cancel your membership, we will refund the dues that you have paid, up to 120 days. Any cancellation beyond 4 months, no refund will be given on any dues paid to that point*\" does this apply to? He flat out asked me if I have that in writing, to which I pointed back to the very email he wrote to me and I replied to.\n\nThis sleazy salesman said they'll cut me a check, he's very busy and has to get back to work, then ended the call immediately before I said another word.\n\nI'm now keeping my eye on my credit cards, waiting to confirm my cancellation, and then will block every BBB number that calls me.\n\nTHE BETTER BUSINESS BUREAU IS A SCAM ORGANIZATION. DO NOT EVER BECOME A BUSINESS MEMBER.",
        "subreddit": "smallbusiness",
        "author": "Unsilent_SoCalipede",
        "score": 264,
        "num_comments": 72,
        "created_utc": 1756855783.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n6z4bu/do_not_be_scammed_into_joining_the_bbb/",
        "fetched_at": "2025-09-04T08:15:07.764571"
      },
      {
        "id": "1n7xpo3",
        "title": "Hired a Freelancer. It’s not going well.",
        "selftext": "I hired a freelancer off of Fiverr to set up automated workflows in my CRM. I have a template provided by the CRM company to that I used when I thought I would do it myself. I had a lot done but didn’t have all the canned emails written. \nFreelancer shared a a draft. I made a bunch of revisions because he doesn’t look like he used the template at all. And none of the emails he drafted even have my company logo/email signature on them. \nWe met again today to talk about it and for me to explain the revisions I needed. I left the meeting feeling pretty discouraged. \nThen later today another client emails me confused because they’d just gotten an (automated) email that doesn’t have anything to do with where they are in my process (this client is booked and paid already and the email they received was about proposals). This is the third client to get that email in the last two weeks!\n\nI’m frustrated and worried. I want to give the guy time to work it out but also I want to cut my loses. Do I have too much of a “if you want something done right you’ve got to do it yourself” attitude or is this really not working out?",
        "subreddit": "smallbusiness",
        "author": "-me-myself-",
        "score": 168,
        "num_comments": 30,
        "created_utc": 1756951173.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n7xpo3/hired_a_freelancer_its_not_going_well/",
        "fetched_at": "2025-09-04T08:15:07.764527"
      },
      {
        "id": "1n77hsl",
        "title": "Competitors are slashing prices aggressively. It’s hard to understand how they’re sustaining these cuts.",
        "selftext": "I’ve got a small subscription business with around 850 paying users and a MRR of approximately $17k. To maintain my business, I’ve borrowed heavily since my AWS and other bills add up to around $40k a month.\n\nI’ve got a competitor who for the last 5+ years has managed to drop their price to 18 dollars a month. There is no way a company my size can make a profit off of these prices. Pricing this low would kill the company.\n\nI am starting to consider shutting down. I’ve gone pretty deep into debt and I am wondering how do these large players afford to price their products so low?",
        "subreddit": "Entrepreneur",
        "author": "Ashwinsuriya",
        "score": 148,
        "num_comments": 158,
        "created_utc": 1756881213.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n77hsl/competitors_are_slashing_prices_aggressively_its/",
        "fetched_at": "2025-09-04T08:15:03.546714"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 147,
        "num_comments": 173,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-04T08:15:09.015684"
      },
      {
        "id": "1n75qm7",
        "title": "I’m getting extorted for fake Google reviews",
        "selftext": "I’m a small business owner barber, young 20s. I got a call from a person who offers social media marketing . I offered him a free haircut. He gave his prices for the service and I just couldn’t afford it. Next thing I know I’m getting  random Google 1star reviews, 4 so far on my Google page. I’m just at 50 reviews and have worked really hard for my 5 star rating. What should I do.? I tried reporting the reviews what else can I do?\n\n\nHe’s still leaving 1star reviews :(((((",
        "subreddit": "smallbusiness",
        "author": "luckypains",
        "score": 121,
        "num_comments": 63,
        "created_utc": 1756874889.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n75qm7/im_getting_extorted_for_fake_google_reviews/",
        "fetched_at": "2025-09-04T08:15:07.764557"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 107,
        "num_comments": 55,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-04T08:15:09.015688"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 98,
        "num_comments": 57,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-04T08:15:09.015670"
      }
    ]
  }
}