{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-24T16:14:54.867434"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-24T16:14:46.435388"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-24T16:14:46.034552"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-24T16:14:46.034543"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-24T16:14:46.034531"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-24T16:14:46.435383"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-24T16:14:46.435385"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-24T16:14:46.435390"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-24T16:14:46.034548"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-24T16:14:46.435371"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-24T16:14:46.034550"
      }
    ],
    "reddit": [
      {
        "id": "1not590",
        "title": "I sell a private jet flights to people who only want to look rich",
        "selftext": "When I first got into the private jet business (no, I don’t own a jet), I thought I’d be selling these private jet flights to celebrities, billionaires, CEO’s etc. What I didn’t expect was the surging client base of Gen-Z’s, influencers, online gurus and dropshipping coaches. \n\nThe funny thing is that most of these people don’t even care about getting from A to B, most of them book the shortest route and some of them don’t even leave the ground… they just want pictures, and videos of them on the jet sipping champagne lol\n\nAt first this was extremely weird and I “judged” these people. Like why would they spend money just to flex on Instagram? It felt fake, very shallow. \n\nBut over time i realized that this was the product. The private jet is what people REALLY want. But they aren’t buying transportation, they are buying an image, a story of showing everyone “I made it” for most of them, painting this picture is more valuable than the jet itself. \n\nThe crazy is the absurdly MASSIVE demand for these fairly cheap private jet flights. I never imagined an entire market of people who aren’t rich but desperately want to LOOK rich. \n\nBut honestly, this was the best thing that could have happened to me because I don’t have to convince anyone to buy. The product (which is the jet flight) sells itself and I close those deals with little to no effort. \n\nThe lesson: sales isn’t always about the product you’re selling. It’s more about selling the feeling behind it and getting people emotionally invested. If you understand ego, you’ll understand markets. \n\n ",
        "subreddit": "Entrepreneur",
        "author": "Born_Celebration_950",
        "score": 1589,
        "num_comments": 223,
        "created_utc": 1758660931.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1not590/i_sell_a_private_jet_flights_to_people_who_only/",
        "fetched_at": "2025-09-24T16:14:47.121265"
      },
      {
        "id": "1noer7j",
        "title": "Just got a letter saying my website violates ADA… Totally lost here 😭",
        "selftext": "Hey everyone,\nI run a small online boutique and today I received a demand letter claiming that my website isn’t compliant with the ADA and WCAG standards.\nThey’re threatening to sue unless I either pay a settlement or fix the issues right away.\nThe problem is, I honestly didn’t even know this was a requirement. After some frantic Googling, I learned about WCAG levels, accessibility rules like alt text, keyboard navigation, and color contrast but honestly, it’s all overwhelming.\nI don’t have the budget to hire an expensive developer right now. Has anyone been through this before? What’s a realistic way to handle this situation without going completely broke?",
        "subreddit": "smallbusiness",
        "author": "BlueDolphinCute",
        "score": 567,
        "num_comments": 358,
        "created_utc": 1758626763.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1noer7j/just_got_a_letter_saying_my_website_violates_ada/",
        "fetched_at": "2025-09-24T16:14:52.214848"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 454,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-24T16:14:53.866015"
      },
      {
        "id": "1nogfv7",
        "title": "Weirdest thing that motivated me to start",
        "selftext": "I used to procrastinate for months, always telling myself I’ll start my business later. Then one random day my friend jokingly said “you talk more about starting than actually doing.” I was literally playing on Stаke at the time and for some reason that burned me and I stayed up all night building my first website. Sometimes it just takes the smallest trigger. Anyone else had a strange moment that pushed you into action?",
        "subreddit": "Entrepreneur",
        "author": "RustyCompass44",
        "score": 303,
        "num_comments": 78,
        "created_utc": 1758631617.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1nogfv7/weirdest_thing_that_motivated_me_to_start/",
        "fetched_at": "2025-09-24T16:14:47.121287"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 168,
        "num_comments": 43,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-09-24T16:14:53.866034"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 147,
        "num_comments": 178,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-24T16:14:53.866066"
      },
      {
        "id": "1noylg4",
        "title": "My first startup fixed interview prep,  Now my second is replacing interviews - already $75K MRR before Launch",
        "selftext": "Hi everyone, I’m Michael. Two years ago my co-founder and I hacked together a prototype called Meeting Copilot. It listened in on Zoom calls and suggested prompts. One user asked if it could help him in an interview ten minutes later. I said yes, charged him $99, and he paid on the spot. That was the spark.\n\nFrom there we built Final Round AI, an AI copilot for interviews. People called it cheating, we called it the future. One user had been unemployed for eight months but with us, he landed a job in 17 days.\n\nWe joined a growth bootcamp, shipped thousands of SEO pages, ran a thousand experiments, and grew from nothing to $10M ARR and seven million users in under two years. Along the way we raised a $7M seed, but the truth is most of the growth came from compounding small wins and killing the 90 percent of things that didn’t work.\n\nBut that journey revealed a bigger truth. Interviews don’t show you the truth. Real work does. Inside our own team, the best hires came from people who worked with us directly, not from polished resumes or interviews.\n\nSo we started doing something different - Paid Work Trial. Candidates would spend a day or a week actually working with us. It worked so well we stopped doing interviews completely. And that’s what became our next product.\n\n[Work Trial AI](https://worktrial.com/) lets companies run short paid work trials. In seconds you can launch a real-world sandbox where candidates solve real problems alongside AI colleagues and real team members. Every trial is different, no scripts, just raw proof of ability. Companies get a clear view of how someone communicates, solves problems, and works with others.\n\nOver the last six months we’ve been running Work Trial AI with B2B companies we got connected to through our network of VCs and founders we already knew. The feedback has been amazing, faster decisions, stronger hires, and far less wasted time.\n\nToday we’re finally launching it for every company. We’ve already grown to $75K MRR, but it’s not about the numbers. The mission is bigger. We want to reinvent how hiring works.\n\nHere are a few lessons that helped me along the way:\n\n* Don’t wait for the perfect idea. The spark often comes from a user doing something you didn’t expect.  \n* Raise your prices earlier than you think. If you’re delivering real value, people will pay.  \n* Run a lot of small experiments. Growth doesn’t come from one big hack, it compounds from hundreds of small wins.  \n* Network more than you feel like. Our earliest traction came from founders and VCs we already knew.  \n* Focus on solving real problems. If the pain is real, the product almost sells itself.\n\nOur first startup showed us the cracks in the hiring process. This next one is our attempt to fix them. Sometimes the first product gives you momentum, but the second one helps you solve the bigger problem.If you also believe hiring should be based on real work instead of guesswork, I’d love to hear your thoughts.\n\n",
        "subreddit": "SaaS",
        "author": "Interesting-Act-7727",
        "score": 135,
        "num_comments": 32,
        "created_utc": 1758675052.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1noylg4/my_first_startup_fixed_interview_prep_now_my/",
        "fetched_at": "2025-09-24T16:14:49.122669"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 115,
        "num_comments": 39,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-09-24T16:14:53.866025"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 112,
        "num_comments": 56,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-24T16:14:53.866070"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 99,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-24T16:14:53.866053"
      }
    ]
  }
}