{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-05T00:58:41.444356"
  },
  "data": {
    "youtube": [
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-11-05T00:58:32.268642"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-05T00:58:32.268637"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2025-11-05T00:58:32.789557"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-05T00:58:32.268622"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-05T00:58:32.789553"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-05T00:58:32.789559"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-05T00:58:32.789555"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-05T00:58:32.268639"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-05T00:58:32.789544"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-05T00:58:32.268635"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 476,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-05T00:58:40.442982"
      },
      {
        "id": "1oo6k1v",
        "title": "Owning a business in Texas made me think differently about marriage",
        "selftext": "I run a small design business here in Texas, nothing crazy but it’s finally doing well after a few rough years. The weird part is, the more it grows, the more I’ve started thinking about how tied up my personal life is with all of it.   \nI’ve seen friends lose half their business after a divorce, and it honestly freaked me out a bit. It’s not even about trust it’s just realizing how fast something you built from scratch can get tangled up in stuff that has nothing to do with work.   \nI’m in a serious relationship now and things are good, but for the first time, I’ve actually caught myself thinking about stuff like prenups or protecting ownership. Never thought I’d be that person, but here we are.\n\nAny other business owners hit that point where you start looking at marriage a little differently once there’s a company involved?",
        "subreddit": "Entrepreneur",
        "author": "Extreme-Eagle-3555",
        "score": 425,
        "num_comments": 161,
        "created_utc": 1762261540.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oo6k1v/owning_a_business_in_texas_made_me_think/",
        "fetched_at": "2025-11-05T00:58:33.504188"
      },
      {
        "id": "1oo8c9v",
        "title": "I dont understand why people keep trying to open businesses in spots where countless have failed.",
        "selftext": "My store is near a huge flea market. There is a small Cafe inside the grounds. In my 15 years at this location I have seen probably 10 different cafes open and close yet every year somebody tries to open another one.\n\nWhy? Wouldn't you look at the 9 other failures and think its not the best idea?",
        "subreddit": "smallbusiness",
        "author": "Comfortable_Dish5217",
        "score": 342,
        "num_comments": 150,
        "created_utc": 1762265928.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oo8c9v/i_dont_understand_why_people_keep_trying_to_open/",
        "fetched_at": "2025-11-05T00:58:38.235639"
      },
      {
        "id": "1onkt20",
        "title": "hired my first employee and immediately understood why companies have so many stupid rules",
        "selftext": "I'm that company now\n\n\"Please track your hours\" - because I need to know what we're spending time on. Update the project board,\" - because I can't read your mind.Writee docs for your work,\" - because you might get hit by a bus\n\nEvery dumb corporate policy comes from one person who did one thing that broke everything\n\nI'm creating bureaucracy in real-time,andi I hate it, but also it's necessary Becoming what you hate speedrun any%\n\n",
        "subreddit": "SaaS",
        "author": "Several_Function_129",
        "score": 297,
        "num_comments": 80,
        "created_utc": 1762196850.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1onkt20/hired_my_first_employee_and_immediately/",
        "fetched_at": "2025-11-05T00:58:35.109029"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 181,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-05T00:58:40.443025"
      },
      {
        "id": "1onlwp1",
        "title": "A customer got upset with me, saying I was not being transparent.",
        "selftext": "I run a boat rental business and recently partnered with an insurance company to offer optional rental insurance. I made it optional because I did not want to force customers to buy it, even though it costs me a lot to provide the option. I already carry liability insurance, but if a customer damages the boat, they are responsible for those costs. The rental insurance offers several affordable plans to give customers extra peace of mind.\n\nAfter this customer made his reservation, I called him to review the meeting location and details, which are also included in the confirmation email. I like to do this personally to make sure everything is clear and to answer any questions.\n\nI also explained that he would receive a second email where he would need to sign the waiver and other documents. After that, the rental insurance page would appear, clearly marked as optional, and he could choose to decline it.\n\nHe became irritated and said I was not being transparent and that he did not appreciate it. I explained that the insurance is completely optional and that we only offer it because other customers have requested it. It is even mentioned at the beginning of the confirmation email.\n\nHe told me I had ruined his fun and said he felt obligated to buy insurance. I repeated that he did not have to purchase it, but he said, “Well, now I am worried something might happen during my trip,” and then he hung up.\n\nI am honestly confused about how I was not being transparent. If you rent a car or book a flight, they always offer optional insurance. It is the same concept. I just want to make sure my customers feel safe and protected, not pressured.",
        "subreddit": "smallbusiness",
        "author": "Pale_Blackberry_4025",
        "score": 173,
        "num_comments": 81,
        "created_utc": 1762199288.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1onlwp1/a_customer_got_upset_with_me_saying_i_was_not/",
        "fetched_at": "2025-11-05T00:58:38.235683"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 172,
        "num_comments": 28,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-05T00:58:40.442997"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 170,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-11-05T00:58:40.443054"
      },
      {
        "id": "1onrl3f",
        "title": "Who has gotten their health insurance plan renewal rates?",
        "selftext": "I’m a small business owner of 25 years. I employ 15 people in a professional consultancy business. I’m at a conference today and one owner got his renewal rates for the coming year from Cigna. It’s a 63% increase. He estimates it will cost him $141k more in premiums for his staff this coming year. My company’s increase last year was 17%. I immediately emailed my PEO rep to get me my renewal rates ASAP. I usually get them in late November or early December. We pay the employee portion and employees who want family plans or employee and spouse pay the difference. I’m building my 2026 budget right now. I’m trying to plan raises. I want to increase my 401k match to our staff from 3% to 6%. What are other small business owners seeing in their renewal rates?",
        "subreddit": "smallbusiness",
        "author": "SevereAtmosphere8605",
        "score": 125,
        "num_comments": 81,
        "created_utc": 1762212267.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1onrl3f/who_has_gotten_their_health_insurance_plan/",
        "fetched_at": "2025-11-05T00:58:38.235663"
      },
      {
        "id": "1onz8r5",
        "title": "I tried starting a clothing brand in college and here’s what actually happened lol",
        "selftext": "\nSo back when I was in my sophomore year, I got this idea to start a small clothing brand. I was broke, drowning in assignments & honestly thought it’d be a fun way to make a little money in college\n\nThe idea was to do retro sports-wear, kinda like those 90s oversized tees with old school fonts and colors. I sketched out a few designs, made a logo on Canva *(yeah I know, rookie move)* & thought I was ready to build a brand overnight 😭\n\nAt first I tried finding local printers but everything was way too expensive. Minimum orders were like 50 shirts and I had no clue if anyone would even buy them. So I started small with print on demand just to test the waters. My friends ordered a few and wore them around campus which actually gave me some confidence\n\nThe hard part wasn’t design, it was figuring out how to get people to care. Marketing was way harder than I expected. I made an Insta page, got like 100 followers, then hit a wall. I didn’t have time to post daily or run ads, and I didn’t wanna beg friends to buy stuff\n\nAfter a few months I basically ran out of steam. I sold maybe 20 shirts total. Nothing crazy but it was fun seeing something I made actually out there in the world\n\nLooking back now, I realize I rushed into it without a real plan. I should’ve done more research on brand positioning and maybe tested more designs before launching\n\nIf any of you have done something similar, what would you have done differently? Like, if you were starting a clothing brand in college today, how would you go about it?",
        "subreddit": "smallbusiness",
        "author": "RobloxSakara",
        "score": 95,
        "num_comments": 24,
        "created_utc": 1762234006.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1onz8r5/i_tried_starting_a_clothing_brand_in_college_and/",
        "fetched_at": "2025-11-05T00:58:38.235647"
      }
    ]
  }
}