{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-26T08:14:31.270610"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-26T08:14:23.119627"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-26T08:14:23.119629"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-10-26T08:14:22.760981"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-26T08:14:22.760974"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-26T08:14:22.760961"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-26T08:14:23.119623"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-26T08:14:23.119625"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-26T08:14:22.760977"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-26T08:14:23.119613"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-26T08:14:22.760979"
      }
    ],
    "reddit": [
      {
        "id": "1of32mn",
        "title": "TIL Jeff Bezos made $280M from a $250k Google investment because an acquisition he made totally flopped",
        "selftext": "Pretty random but thought I’d share (just read the book about Amazon). Bezos made a TON of money as an angel investor into Google.\n\nTLDR: In 1998, Amazon acquired a startup called Junglee and the acquisition was basically a disaster. But one of the employees, Ram Shriram, ended up intro’ing Bezos to Larry Page and Sergey Brin. They show him a prototype, and he wrote a $250k check on the spot into their $1M seed round.\n\nFast forward to Google’s IPO in 2004, that $250k was worth $280M. If he had held on to it, that would have been $20B today (I heard that on the Acquired podcast).\n\nPretty much the reality of investing in startups. If you're already meeting smart people and building relationships, the opportunities show up in your workflow. Not from \"deal hunting.\"",
        "subreddit": "Entrepreneur",
        "author": "b_an_angel",
        "score": 1920,
        "num_comments": 148,
        "created_utc": 1761324939.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1of32mn/til_jeff_bezos_made_280m_from_a_250k_google/",
        "fetched_at": "2025-10-26T08:14:23.861756"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 472,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-26T08:14:30.269210"
      },
      {
        "id": "1oex6aw",
        "title": "[True Story] Non-technical founder tried to sell a 100% AI-generated MVP to a bank - I will not promote",
        "selftext": "Got a call yesterday from someone in my network. Fintech founder, zero technical background. Says she got hacked. As she tells me the story, I can't believe the chain of events.\n\nStarted like many do now: lovable, v0, cursor. Generating screens, connecting APIs. Great for validation at first. Problem is, she kept going. MONTHS wrestling with prompts until she had a monster with:\n\n* Credit scoring\n* AI agents\n* Dashboards\n* Reports\n* And many more\n\nAll prompt-generated. Zero understanding of the code. Shows it to a BANK. They like it. Tell her to move forward (she had a great business network btw). No idea what to do. Hires a team to \"refactor\". Quote: 300+ hours. Basically the cost of building a proper MVP from scratch.\n\nBut wait, it gets better.\n\nThe team she hired ALSO does vibe coding. They set up the server by asking ChatGPT. Result:\n\n* SSH open to the world\n* Root password: admin123 (or something similar)\n* No firewall\n* Nothing\n\nAutomated ransomware encrypted everything. Had to shut down, rotate all API keys (costing $$$), migrate everything.\n\nThe founder lost money on the hack, so much time, credibility with the client and trust in the process.\n\nHere's the thing: Would you send a contract to a client without reading it, just because AI wrote it? Would you send an investor pitch without knowing what it says? Of course not. So why would you run your entire technical infrastructure on code you can't read?\n\nAI amplifies what you already know. If you understand business, AI makes you better at business. If you know code, AI makes you code 10x faster. But if you know nothing about code and try to build a tech product with just prompts, you're not in control of your own company.\n\nThe new reality post-AI: You don't need 10 developers anymore. You need 1-3 people who REALLY know their domain, amplified by AI. That's more powerful than 20 people without AI.\n\nThat's what vibe coding in production is: unsupervised juniors all the way down.",
        "subreddit": "startups",
        "author": "micupa",
        "score": 272,
        "num_comments": 125,
        "created_utc": 1761311004.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oex6aw/true_story_nontechnical_founder_tried_to_sell_a/",
        "fetched_at": "2025-10-26T08:14:27.121477"
      },
      {
        "id": "1ofgxkm",
        "title": "I now Understand why people choose 9-5 Jobs over their own Businesses",
        "selftext": "I have recently started my own small business. I thought it would make me financially independent, as I cannot work in a normal job like everyone else because of my Bipolar Disorder. But the moment I started my business, I began facing many issues.\n\nThe first issue was trusting vendors I met online. I foolishly got scammed by fake vendors who sent me realistic invoices, but the products never arrived. This drained my savings and made my family lose trust in me. So instead of taking a big loan and a big risk, I decided to start a small business with a small loan—without realizing that there would be many gatekeepers, hidden costs, and the challenge of operating without working capital.\n\nI finally found an honest vendor who provided me with my goods, but our definitions of “good quality” were very different due to social status. I wanted to sell to middle and upper-middle-class people, but he thought the same quality applies for all. In India, there is also so much paperwork, and I got scammed by those who handle documentation. I was overcharged by those who made my labels.\n\nI am the first person in generations of my family and caste to ever start a business, so we had no inside knowledge. My own friends who come from business castes acted as gatekeepers—because that’s what they are taught. I tried to find distributors for my product, but most of them first take the product and then pay only if it’s sold. This meant I would have to blindly trust them, because even with proper documentation, no legal authorities would care or intervene if they cheated. They know that, and they take advantage of it.\n\nNow, I have a lot of products and no way to sell them. Social media marketing attracted a few friends and supporters to buy, but then the Postal Department refused to send my product because it’s food. I had to rely on private couriers, which cut all my margins. Nobody reveals where to buy cheap packaging, how to deliver packages at low cost, or how to find honest distributors.\n\nIn India, I think society is designed to keep new entrants out of business and to preserve business opportunities only for certain communities, while keeping the rest of society enslaved to corporates—so they continue buying from these same communities when it comes to small-scale businesses.",
        "subreddit": "smallbusiness",
        "author": "kingkashman",
        "score": 209,
        "num_comments": 120,
        "created_utc": 1761361400.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ofgxkm/i_now_understand_why_people_choose_95_jobs_over/",
        "fetched_at": "2025-10-26T08:14:28.602010"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 178,
        "num_comments": 129,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-26T08:14:30.269228"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 175,
        "num_comments": 50,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-26T08:14:30.269263"
      },
      {
        "id": "1ofcicc",
        "title": "Do you think it's a bad idea for my mom to sell her business for the cost of the location itself, when it makes her over $300k a year?",
        "selftext": "Long story short, over the past decade or so, my mom built a nail business. At the moment she's a nail technician as well, and also takes on the manager role (maintenance, supplies, etc), and she's built up clientele and the like, to the point where she herself is pulling in $300k+ profit herself a year. The thing is, she plans to sell the spot in a couple years, and plans to sell it someone else who will take over it as a nail salon business, but for some reason in her mind it's ingrained to sell it simply at the cost of the location (not accounting for the cost of the business she built up, etc). Is this a bad idea on her part in her opinion? I definitely don't want to think for her, but I was curious about what you guys think\n\n  \nEdit: the new owner would just take on the name and clients, and she'll no longer be in the nail business",
        "subreddit": "Entrepreneur",
        "author": "dreemsequence",
        "score": 170,
        "num_comments": 75,
        "created_utc": 1761348047.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ofcicc/do_you_think_its_a_bad_idea_for_my_mom_to_sell/",
        "fetched_at": "2025-10-26T08:14:23.861782"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 166,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-26T08:14:30.269257"
      },
      {
        "id": "1ogaagi",
        "title": "Ex girlfriend writing fake review on my google business page",
        "selftext": "just as the title states, my ex girlfriend is writing fake reviews on my google page because we broke up and I found another woman. in her google review she states that I gave her an STD and that I cheated on her with a prostitute... none of this is true or has anything to do with my business. How can I get this removed or should I sue for defamation of character?  ",
        "subreddit": "smallbusiness",
        "author": "SpirtualMar",
        "score": 123,
        "num_comments": 47,
        "created_utc": 1761448673.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ogaagi/ex_girlfriend_writing_fake_review_on_my_google/",
        "fetched_at": "2025-10-26T08:14:28.601991"
      },
      {
        "id": "1of7sf0",
        "title": "VCs won't tell you this but half of founders are burnt out right now. ( I will not promote )",
        "selftext": "Your investors don't care about this. They want your growth metrics. They don't want to know you stopped caring about the thing you built.\n\nHalf of all founders go through burnout. Half. But VCs never mention it. They talk about hustle and scaling fast. They don't talk about what happens when your brain actually breaks down\n\nHere's what they won't tell you. You'll lose passion for your startup even though you love the idea. You'll make stupid decisions because you're exhausted. You'll get angry at your team for no reason. You'll think everyone would be better without you running this.\n\nSleep won't help. Eight hours feels like nothing. Your body is just broken from the stress.\n\nYou'll isolate because it feels easier than pretending everything's fine. Simple decisions become impossible. You'll second guess yourself constantly even though you're supposed to be the confident founder.\n\nAnd the worst part is you keep pushing harder because stopping feels like admitting defeat. That's the trap VCs want you in. Keep grinding. Keep sacrificing. Keep ignoring the warning signs.\n\nNobody calculates the cost of burned out founders making bad decisions. They just care about the next funding round.\n\nThat's what VCs won't tell you.\n\nThis is just a serious post, people may agree or not. but this can be true with more than 60% Co-founders.",
        "subreddit": "startups",
        "author": "ksundaram",
        "score": 121,
        "num_comments": 60,
        "created_utc": 1761335938.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1of7sf0/vcs_wont_tell_you_this_but_half_of_founders_are/",
        "fetched_at": "2025-10-26T08:14:27.121473"
      }
    ]
  }
}