{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-15T16:12:31.054190"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-15T16:12:22.690458"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-15T16:12:22.243836"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-15T16:12:22.243841"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-15T16:12:22.243822"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-15T16:12:22.690455"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-15T16:12:22.690461"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-15T16:12:22.690459"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-15T16:12:22.243855"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-15T16:12:22.690449"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-15T16:12:22.243846"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 478,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-15T16:12:30.052912"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 184,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-15T16:12:30.052948"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 178,
        "num_comments": 34,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-15T16:12:30.052930"
      },
      {
        "id": "1ox7uxm",
        "title": "How are you all making 10k+ a month and how much free time do you have",
        "selftext": "I’ve turned 20 this year and I’m a little lost on how I want to go about my life I know I don’t want to be stuck trying to climb the corporate ladder just to work my life away there. I know comparing is the thief of joy but I see all these people my age making more money then I would know what to do with but I’m at a loss to how they do it. I’ve researched all these gurus business models like ecom, day trading, high ticket sales, etc. Some of them seem doable like learning to run ads for people or using AI to help automate things for companies that don’t have it or ecom or real estate but I feel like a lot of these markets are over saturated. I sometimes feel like it might just be easier to go find a good job and try to work your way to the top. Thoughts? Ideas? Anything would be appreciated.",
        "subreddit": "Entrepreneur",
        "author": "Strawhat-Evxn",
        "score": 85,
        "num_comments": 130,
        "created_utc": 1763152709.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ox7uxm/how_are_you_all_making_10k_a_month_and_how_much/",
        "fetched_at": "2025-11-15T16:12:23.374754"
      },
      {
        "id": "1ox0md2",
        "title": "The loneliness of being a solo founder is breaking me",
        "selftext": "I work alone. Eat alone. Stress alone.\r\nNobody to discuss decisions with.\r\nFamily doesn't get it. Friends think I’m “playing startup.”\r\nSome days, I want a normal job just to interact with humans.",
        "subreddit": "SaaS",
        "author": "Rider_947",
        "score": 72,
        "num_comments": 65,
        "created_utc": 1763136522.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ox0md2/the_loneliness_of_being_a_solo_founder_is/",
        "fetched_at": "2025-11-15T16:12:25.023208"
      },
      {
        "id": "1owz8ao",
        "title": "Advice needed: What’s the difference between Gusto v Rippling",
        "selftext": "For the people who have switched payroll systems recently, can someone please tell me what’s the actual differences between Rippling and Gusto? For context, my company is like 30 people across 3 states and a few contractors in Canada. We plan to add significantly more headcount in mid 2026. We were on Paylocity first but it was clunky. So we switched to Gusto but it glitched a few times and trying to get a hold of the support team was really painful and slow. Now Rippling keeps coming up in my LinkedIn feed. I’m trying to decide what’s actually worth the pain of switching. We don’t need everything. I just want something that handles multi-state and international payroll without breaking. All insights are greatly appreciated :)",
        "subreddit": "smallbusiness",
        "author": "Ecstatic-Wish-9634",
        "score": 67,
        "num_comments": 18,
        "created_utc": 1763133446.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1owz8ao/advice_needed_whats_the_difference_between_gusto/",
        "fetched_at": "2025-11-15T16:12:28.230662"
      },
      {
        "id": "1owwodn",
        "title": "How do you compete against a local monopoly who just price matches your bid and gets the contract?",
        "selftext": "This is a very specific industry that consists of pool and bar management at hotels. There is one major player in our area that has bought up a bunch of smaller companies over the years, but they don't have a great reputation with customer service oddly enough. However they are branded well, have multiple officers and warehouses all over the area, you can't even hit a stop light without looking up with one of their vehicles. \n\nI've been tasked to help a company who is taking a slightly different approach to these contracts grow their business but of course that means going after monopoly contracts. These deals are multi-year so when you miss them it could be another 3-5 before you get a chance to bid again. A lot of them also have RFPs, so you can spend a week with a team combing through the details and building a very thought through proposal. \n\nIn the last 4 months, we have been told that we've won 9 contracts that would have been taken from this competitor, however, in every single instance, they had the option in their existing contract to price match and ultimately got to keep it themselves. All the time and effort we put in it just so the big guy can say yeah we'll do that is tiring. \n\nHow can you possibly get past this? \n\nIt's almost all about the money by the way. Corporations, hotel chains, HOA boards are the ones making these decisions. If they can squeak out more money for the deal that's all that matters to them unless someone royally screws up. The little things like we provide better customer service, we're technology focused, increase customer spending etc are all looked at as salesman fluff. \n\nAlso you don't get to meet with the decision makers very easily. Going after a Hilton hotel, the local GM has little say. Going after a neighborhood, there are a dozen people on the HOA board and you may have only spoken to one of them.\n\nWhat can be done here?",
        "subreddit": "smallbusiness",
        "author": "savesheep",
        "score": 66,
        "num_comments": 35,
        "created_utc": 1763127382.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1owwodn/how_do_you_compete_against_a_local_monopoly_who/",
        "fetched_at": "2025-11-15T16:12:28.230673"
      },
      {
        "id": "1o40fm7",
        "title": "As someone who works from home, how do you socialise? or meet new people/make friends?",
        "selftext": "I am working from home, a 27F. Honestly it gets boring and i dont have any friends in here in my hometown. I have lived in hostel since 15 and hence havent made any friends here.\n\nMy hometown is also not a lively place with meetups or activities happening, so it just becomes difficult for me.\n\nAny other way to socialise? maybe any online ways? Please suggest.\n\nUpvote1Downvote1Go to comments  \n",
        "subreddit": "freelance",
        "author": "This-Brief6214",
        "score": 62,
        "num_comments": 64,
        "created_utc": 1760201179.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o40fm7/as_someone_who_works_from_home_how_do_you/",
        "fetched_at": "2025-11-15T16:12:30.052963"
      },
      {
        "id": "1oxh1qv",
        "title": "Averaging 100+ downloads a day is like a dream coming true",
        "selftext": "Averaging a 100+ downloads a day is like a dream coming true\n\nPs: I would’ve shown you the dashboard but this subreddit doesn’t allow images. \n\nI've always seen it online but never thought it would be possible without a huge budget.\n\nMy entire strategy? Post everywhere, every day. That’s it. I write about my apps and make videos about them.\n\nI kid you not ... my ad-spend so far -> $0\n\nI only recently learned about hooks and how to make engaging videos. I’m definitely not the best yet (still have a lot to learn) but even as a complete beginner, I’m getting results like this\n\nKinda wish I started sooner",
        "subreddit": "Entrepreneur",
        "author": "First-Reference3924",
        "score": 55,
        "num_comments": 35,
        "created_utc": 1763176719.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oxh1qv/averaging_100_downloads_a_day_is_like_a_dream/",
        "fetched_at": "2025-11-15T16:12:23.374741"
      },
      {
        "id": "1ox7syx",
        "title": "Why do I quit every project I start? Neurodivergent entrepreneurs, I need your hacks.",
        "selftext": "hey guys, i’m kinda losing my mind with this. i keep trying to start different things (coding, ecommerce, music, all that) and every single time i quit almost right away. it’s like i waste months hyping myself up just to drop it after 2 days. i’m honestly getting tired of myself at this point.\n\ni’m pretty sure i have some kind of neurodivergent thing going on (adhd/autism or something, i’m getting checked soon). it’s not that i don’t have ideas or that i’m dumb, my brain just doesn’t know how to function unless everything is super structured. i legit feel like i need to be a robot to actually do anything, but entrepreneurship is all about being flexible and making decisions and that’s literally what shuts me down.\n\ni can’t start things, i can’t stay consistent, even when i know exactly what i should be doing my body just freezes. then randomly i’ll work for like 10 hours straight in one day and not touch it again for two weeks. flexible schedules don’t work for me at all, i need someone or something telling me “do this, then this, then this.” if there’s too much room to decide, my brain taps out.\n\nanother thing is motivation. if i don’t see results instantly i fall off. i need little wins or progress to keep going but most business stuff takes months to years before anything happens and it just destroys me.\n\nso i’m just wondering if there’s any other neurodivergent founders here that found a way to work around this. like what actual systems or habits you use in real life, not generic advice. do you use a strict daily checklist or an app that tells you the next step so there’s no thinking involved? how do you deal with losing momentum? cause one day off for me and it’s like the whole project is dead. how do you restart without overthinking it?\n\nand how do you trick your brain into handling delayed gratification? do you use fake rewards or tracking or some kind of gamification to get that dopamine hit? also how do you deal with that paralyzed feeling when you need to start a task and your brain just refuses?\n\nany real advice would help. i’m just tired of repeating the same cycle and i want to actually build something without falling apart every time. thanks.\n\n**tldr:** i can’t stick to any of my business ideas because my brain shuts down without strict structure, and i’m pretty sure it’s ADHD/autism related. i need “robot mode” systems, fake dopamine rewards, and ways to rebuild momentum because even one day off kills everything. any neurodivergent entrepreneurs got real tips that actually work?",
        "subreddit": "Entrepreneur",
        "author": "Single-Marionberry79",
        "score": 47,
        "num_comments": 77,
        "created_utc": 1763152578.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ox7syx/why_do_i_quit_every_project_i_start/",
        "fetched_at": "2025-11-15T16:12:23.374778"
      }
    ]
  }
}