{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-10T16:14:39.950293"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-10T16:14:31.068160"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-10T16:14:31.068162"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-10T16:14:30.738554"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-10T16:14:30.738541"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-10T16:14:31.068155"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-10T16:14:31.068157"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-10-10T16:14:30.738559"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-10T16:14:30.738556"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-10T16:14:31.068146"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-10T16:14:30.738557"
      }
    ],
    "reddit": [
      {
        "id": "1o2blbe",
        "title": "My “crazy” idea worked. Now they’re calling it teamwork.",
        "selftext": "So a while ago I pitched this “crazy” idea at work like what if we just start seeding our product on LinkedIn? nothing big, just testing quietly, seeing reactions, and then building from there\n\neveryone brushed it off\ntoo risky, not scalable, and apparently I’m too “junior” to handle it lol\nso I just stayed quiet\n\nthen I went ahead and did it anyway\nstarted small, posted here and there, talked to people, tested a few things\nand within a week, boom traffic went up, people started noticing, actual results\n\nsuddenly my boss is super interested\nwait, who did this?\n\nand now it’s all we did this our strategy worked, great teamwork\n\nsame idea, same plan, same execution\nexcept now everyone’s taking the credit\n\nfunny how last week I was the junior one with risky ideas\nand this week it’s all “we really nailed it together” ",
        "subreddit": "Entrepreneur",
        "author": "Zealousideal_Self678",
        "score": 480,
        "num_comments": 81,
        "created_utc": 1760029525.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o2blbe/my_crazy_idea_worked_now_theyre_calling_it/",
        "fetched_at": "2025-10-10T16:14:31.906021"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 461,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-10T16:14:38.948971"
      },
      {
        "id": "1o2zwi7",
        "title": "I think AI slop killed my business.",
        "selftext": "We do production for creators and this year we only signed 2 big industry players. We didnt sign any small and medium sized clients. It appears the entire middle market got destroyed by AI slop and low efort podcasts and generally there is a fear of income loss for any production.\n\nCreators spend a ton on production and editing etc and they are losing views and engagement to AI shorts about women washing dishes in the olympics. 4 millions likes that short got. There are clients with 10m+ subs getting less than 100k views now. So, its clear, AI will kill jobs in code generation and content creation.\n\nWhat exactly is going to pay everyone's bills??? Id love to know how everyone else is handling this.",
        "subreddit": "Entrepreneur",
        "author": "Ashleyosauraus",
        "score": 211,
        "num_comments": 160,
        "created_utc": 1760100338.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1o2zwi7/i_think_ai_slop_killed_my_business/",
        "fetched_at": "2025-10-10T16:14:31.906005"
      },
      {
        "id": "1o2o3wx",
        "title": "Customer suddenly putting over $20k on credit in the past 25 days (and they're on NET30)...how do I find out if they're planning on paying or not, without being annoying?",
        "selftext": "They've bought a few times before, max $1500 purchase, and never had more than $2k in outstanding invoices...suddenly over the past month they've cracked up over $20k for just a certain item. It could very well be they just switched to using us for that item now and they go through a LOT of them, but I'm kinda getting nervous that they're not gonna pay for them...(It's a consumable item btw, something that they constantly need to serve their customers)",
        "subreddit": "smallbusiness",
        "author": "VirtualMacaroon64t",
        "score": 174,
        "num_comments": 78,
        "created_utc": 1760060588.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o2o3wx/customer_suddenly_putting_over_20k_on_credit_in/",
        "fetched_at": "2025-10-10T16:14:37.082102"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 173,
        "num_comments": 47,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-10T16:14:38.948999"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 164,
        "num_comments": 54,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-10T16:14:38.948988"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 150,
        "num_comments": 180,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-10-10T16:14:38.949029"
      },
      {
        "id": "1o2em6x",
        "title": "Client scolded me for keeping him in the \"To\" field",
        "selftext": "I offer marketing services as a small self-employed hustle. I’m not looking to expand or hire staff, so over time I’ve learned to let go of clients who bring more stress than they’re worth.\n\nMy longest-serving client has started acting oddly and being unprofessional with one of our vendors, which is making me think it’s time to part ways. One incident that stands out happened two weeks ago when he scolded me for leaving him in the “To” field of an email.\n\nHere’s what happened:\nHe sent an email to a vendor, addressed to them with me on cc. I wanted to add some extra info for the vendor, so I hit reply all. In doing so, my client ended up in the “To” field and the vendor in “cc.” Later that week, he actually scolded me for it on a call.\n\nI was surprised because I can’t see how that would have had any practical effect. The vendor still got the message and replied to it. I get that it’s a small etiquette thing, but to me it feels like a non-issue.\n\nNow he’s also started raising his voice at the vendor on calls, accusing them of being unprofessional when I honestly think they weren’t. I’m leaning toward ending the relationship, but I’d like to sanity-check myself first.\n\nWas I really out of line with that email, or is this just another sign that the client is being unreasonable?",
        "subreddit": "smallbusiness",
        "author": "hopium_od",
        "score": 106,
        "num_comments": 66,
        "created_utc": 1760036403.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1o2em6x/client_scolded_me_for_keeping_him_in_the_to_field/",
        "fetched_at": "2025-10-10T16:14:37.082120"
      },
      {
        "id": "1o2vs66",
        "title": "How I made $300K from an open-source side project in less than 4 years.",
        "selftext": "Hi Everyone.\n\nI made over $300K from a simple JavaScript project called [lightGallery](https://www.lightgalleryjs.com/) using dual licensing. Here is everything you need to know about monetizing your open-source project using dual licensing.\n\nDual-licensing is a business model where you offer your software under two different licenses\n\n* A free, open-source license (GPL or AGPL)\n* A paid, commercial license\n\nWhen software is dual-licensed, users can choose the terms under which they want to use the software\n\n# How does this work?\n\nIf you choose the free GPL license and use the GPL-licensed code in your project, as per GPL terms, you'll have to open-source your entire project.\n\nFor instance, if a company uses your GPL-licensed JavaScript on their website, they must release their entire website's source code.\n\nMost companies cannot do this. So, they purchase a commercial license from you, which gives them the right to use the code in closed-source projects.\n\nThat is the core of the business model.\n\n# Choosing the Right License: GPL vs. AGPL\n\nThe key is understanding what triggers the open-source rules.\n\n**GPLv3:** Best for libraries and frameworks. It is triggered by distribution. If someone includes your GPL'd JavaScript on their public website, they must open-source their entire site.\n\n**AGPLv3:** Best for SaaS products. It closes the \"SaaS loophole\" where code is used on a server but never distributed. AGPL is triggered when a user interacts with the software over a network\n\n# Handling Contributions\n\nYou cannot sell or relicense code you don't own. When others contribute, you need the legal rights to their code.\n\nYou have two main options:\n\n* **CLA (Contributor License Agreement):** Contributors let you use their code. They still own it.\n* **CAA (Copyright Assignment Agreement):** Contributors transfer ownership of the code to you.\n\nFor a dual-licensing model, the CAA is the safest option. You can use bots like [CLA Assistant](https://cla-assistant.io/) on GitHub to automate signing before you merge any pull requests.\n\n# Switching an Existing Project to Dual License\n\nIf you have other contributors, you must get their permission to re-license their code. If they refuse or don't reply, you have to remove their contributions.\n\nRelease the new version under a new major version (e.g., v3.x → v4.0). This prevents users from accidentally breaking license compliance when using package managers like NPM.\n\nOld versions remain free under the old license. Give people a strong reason to upgrade by shipping the new version with an exclusive set of new features.\n\nDual licensing is a proven strategy, used for decades by major players like Oracle. It is a reliable business model you can confidently apply to your own projects.\n\n  \n  \nIncome from lightGallery helped me focus on my main project without worrying about runway when I quit my job. I'm now building [ParityDeals](https://www.paritydeals.com/) to make pricing and usage-based billing simple for SaaS.\n\nIf you need any help monetizing your open-source project, feel free to DM me. I'll try to help as much as I can.",
        "subreddit": "SaaS",
        "author": "sachinchoolur",
        "score": 98,
        "num_comments": 25,
        "created_utc": 1760086796.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1o2vs66/how_i_made_300k_from_an_opensource_side_project/",
        "fetched_at": "2025-10-10T16:14:33.679486"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 98,
        "num_comments": 60,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-10-10T16:14:38.949014"
      }
    ]
  }
}