{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-12T08:17:29.407441"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-12T08:17:21.114369"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-12T08:17:20.781543"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-12T08:17:20.781535"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-12T08:17:20.781521"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-12T08:17:21.114363"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-12T08:17:21.114367"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-12T08:17:21.114365"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-12T08:17:20.781540"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-12T08:17:21.114353"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-12T08:17:20.781538"
      }
    ],
    "reddit": [
      {
        "id": "1otuw7c",
        "title": "I mentally cannot do another 9–5 desk job. I have $70k saved and need to build something of my own. What can I realistically do?",
        "selftext": "Hi everyone. I’m hoping for some guidance across a few subreddits because I feel like I'm at a breaking point.\n\nI’m almost 40 and make about $70k a year, but after a lot of self-reflection and working with a professional, I’ve confirmed that my mental health issues are coming directly from the work itself. I’ve tried switching jobs, but everything I’m qualified for ends up being another desk job. And I just can’t do it anymore.\n\nI’d rather work 60+ hours a week *for myself* than keep forcing myself through a 9–5 where I’m chained to a computer. I don’t need to be rich—I just need to be stable and sane.\n\nI live in a rural area (Sayre, PA). Here, everyone and their cousin runs a handyman service, landscaping business, or garden business—so breaking into those feels like fighting over scraps. I don’t have a trade license, and I can’t afford to reboot a whole career while paying my mortgage.\n\n**But I** ***do*** **have $70,000 saved right now that I can put toward building something of my own.**\n\nMy question is:  \n**What can someone in my position reasonably do with $70k to break free from traditional office work and build a self-sustaining career?**\n\nI’m open to:\n\n* Service-based businesses\n* Mobile businesses\n* Online/remote businesses that *aren’t* corporate desk jobs\n* Buying equipment and starting something myself\n* Anything that gets me out of a cubicle and gives me control over my schedule\n\nI’m not afraid of long hours. I’m not afraid of hard physical work. I just need something that isn’t slowly destroying my mental health.\n\n**If you were in my situation—rural area, almost 40, $70k saved, burned out from office life—what would you do? What opportunities am I not seeing?**\n\nAny real-world advice or ideas from people who’ve made a similar transition would mean a lot.\n\nThank you.",
        "subreddit": "smallbusiness",
        "author": "nkb6478",
        "score": 556,
        "num_comments": 562,
        "created_utc": 1762820507.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1otuw7c/i_mentally_cannot_do_another_95_desk_job_i_have/",
        "fetched_at": "2025-11-12T08:17:26.613082"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 475,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-12T08:17:28.406052"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 186,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-12T08:17:28.406087"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 184,
        "num_comments": 33,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-12T08:17:28.406070"
      },
      {
        "id": "1oucdat",
        "title": "If you're a small business do you start directly with GDPR and SOC2 compliances while landing customers?",
        "selftext": "Hi all\n\n  \nI've been running a small software company for 10 months with two friends and right now we got about 25 customers (mostly small businesses). We keep getting leads from bigger companies with actual budgets but they all send these vendor questionnaires asking about SOC 2 and GDPR\n\n  \nI asked in a founders group and got completely different advices because half said you HAVE to get SOC 2 before enterprise or you're wasting time and the other half said focus on product first and do compliance when forced to. When did you actually tackle this stuff? Year one? Only after hitting certain revenue? I just need to know if we're behind or if this is normal. Appreciate it!",
        "subreddit": "smallbusiness",
        "author": "VividRecover7750",
        "score": 114,
        "num_comments": 35,
        "created_utc": 1762874943.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oucdat/if_youre_a_small_business_do_you_start_directly/",
        "fetched_at": "2025-11-12T08:17:26.613070"
      },
      {
        "id": "1outqcx",
        "title": "What’s a book that millionaires and billionaires often credit with helping them succeed early on?",
        "selftext": "I keep hearing successful people say that success is \"all mental,\" about mindset, perspective, and thinking differently. But honestly, it's not that easy. You can tell yourself to \"think bigger\" or \"change your mindset,\" but actually doing it feels like trying to rewire your brain.\n\nI’ve been wondering if certain books helped people make that mental shift early on, something that actually clicked for them, not just motivational fluff.\n\nSo I’m curious: what’s a book that millionaires, billionaires, or even just successful people often say helped them think differently and build their success early on?",
        "subreddit": "Entrepreneur",
        "author": "Training-Ad4262",
        "score": 102,
        "num_comments": 145,
        "created_utc": 1762915973.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1outqcx/whats_a_book_that_millionaires_and_billionaires/",
        "fetched_at": "2025-11-12T08:17:21.742376"
      },
      {
        "id": "1ou7oft",
        "title": "The demise of the penny",
        "selftext": "Good morning Reddit!\n\nI run a smallish chain of coffee shops. My bank told me today that they will no longer be giving out pennies to their business accounts due to the fact that they are not being made anymore.\n\nI know McD (at least in my area) is already saying the same thing, that they are rounding their change off of the nickel now. Has anyone else run into this yet and if so, what is your plan for this? \n\nIn theory, I'm okay with my cashiers just rounding the totals, but to be honest they freak out when someone gives them extra money just to round out their change. \n\nWe've floated the idea of changing our pricing to be tax inclusive, but that means redoing all the pricing and I'd rather not have to do this if it's not necessary. Any suggestions would definitely be helpful!",
        "subreddit": "smallbusiness",
        "author": "AgreeableAir8048",
        "score": 83,
        "num_comments": 82,
        "created_utc": 1762862613.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ou7oft/the_demise_of_the_penny/",
        "fetched_at": "2025-11-12T08:17:26.613078"
      },
      {
        "id": "1ou4mcv",
        "title": "The \"go independent\" advice is missing the part where you eat ramen for 6 months",
        "selftext": "Everyone on here: \"Quit your job! Go independent! I make $400k!\"\n\nNobody: \"You'll make $0 for the first 4-6 months and question every life decision.\"\n\nI'm 8 months into independent recruiting. First 4 months were brutal. Zero revenue. Living off savings. Constant anxiety.\n\nMonth 5 I closed my first deal. $18k. Literally cried.\n\nMonths 6-8 things picked up. Around $25k/month now. Finally feels sustainable.\n\nBut those first months? Nobody warns you. Everyone just posts their success screenshots.\n\nIf you're thinking about going independent:\n\n- You need 6-9 months runway minimum\n- Your network probably isn't as good as you think\n- Cold outreach sucks but it's necessary\n- Rejection is constant at first\n- The uncertainty is mentally exhausting\n\nStill glad I did it. But the \"just go independent\" advice without context is dangerous.\n",
        "subreddit": "Entrepreneur",
        "author": "Temporary-Ad8735",
        "score": 74,
        "num_comments": 24,
        "created_utc": 1762851510.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ou4mcv/the_go_independent_advice_is_missing_the_part/",
        "fetched_at": "2025-11-12T08:17:21.742401"
      },
      {
        "id": "1ouc5l9",
        "title": "Just launched my new SaaS that teaches you how to vibe code better",
        "selftext": "Hello r/SaaS,\n\n  \nI just launched a new SaaS named [StartCod.ing](http://StartCod.ing) (which teaches you how to vibe code like a master)\n\n  \nMy name is CJ, and I am a creator, and this is what I made:\n\n\\- A course with short videos\n\n\\- Each video lesson has got text content below it\n\n\\- Each lesson has got a quiz to push your limits\n\n\\- Around 100 videos (released incrementally)\n\n\\- 16 beta users and they love it.\n\n  \nI have not implemented preview feature yet, but if you need any, feel free to DM.\n\nAlso; I've put my time and effort in design as well, please let me know what do you think about that.\n\n  \nThanks",
        "subreddit": "SaaS",
        "author": "Square-Badger-2828",
        "score": 67,
        "num_comments": 32,
        "created_utc": 1762874447.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ouc5l9/just_launched_my_new_saas_that_teaches_you_how_to/",
        "fetched_at": "2025-11-12T08:17:23.454011"
      },
      {
        "id": "1ou8i6m",
        "title": "What SaaS product are you building and how many users do you have?",
        "selftext": "In the spirit of just joining this community I want to have a thread where people can pitch what they're building and share their current user count.\n\nI'll go first:\n\n[matchya](https://matchya.app/) \\- An AI companion that helps you work through life’s challenges using evidence-based therapy styles like CBT, IFS, ACT, and DBT.\n\nNow I'm curious... **what are you building?**",
        "subreddit": "SaaS",
        "author": "Ok-Notice-5189",
        "score": 67,
        "num_comments": 167,
        "created_utc": 1762865143.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ou8i6m/what_saas_product_are_you_building_and_how_many/",
        "fetched_at": "2025-11-12T08:17:23.454017"
      }
    ]
  }
}