{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-05T00:59:27.283618"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-05T00:59:18.612103"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-05T00:59:18.286074"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-12-05T00:59:18.286082"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-05T00:59:18.286076"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-05T00:59:18.286061"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-05T00:59:18.612100"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-05T00:59:18.612108"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-05T00:59:18.612105"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-05T00:59:18.612089"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-05T00:59:18.286078"
      }
    ],
    "reddit": [
      {
        "id": "1pdax88",
        "title": "I caught an employee submitting fake expense reports",
        "selftext": "Last week I'm covering for our bookkeeper who's out on maternity leave and I'm going through expense reports from the last few months. I notice that one employee submitted the exact same Uber receipt twice (same ride and same amount 38 bucks) once in February and again in April. at first I figured it was just a mistake like maybe they just accidentally uploaded the same photo twice or something\n\nI then started actually looking at their other submissions and that's when I was able to figure it out. Personal grocery runs labeled as 'office supplies' dinner with their friends labeled as 'client meeting' and I'm pretty sure some of the receipt screenshots were edited because the fonts looked off and dates didn't line up with the transaction amounts\n\nI went back through about 6 months of their reports and conservatively they probably stole around $2500 (2544 bucks to be exact) from us. When I confronted them they got immediately defensive and tried to say it was \"unclear what counted as a business expense\" and then quit on the spot. Yes they quit on the spot  \n  \nYesterday I got paranoid cuz I started thinking of all the people that could have been doing this too and I just never noticed because I've never dealt with expenses  \nI don't want to become some paranoid micromanager who audits every coffee purchase but I also clearly can't just operate on the honor system anymore. I feel like I need some kind of actual system but I also don't know what's reasonable for a company our size (19 people and maybe 25 on January)",
        "subreddit": "smallbusiness",
        "author": "FarEntrepreneur5679",
        "score": 541,
        "num_comments": 190,
        "created_utc": 1764783748.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pdax88/i_caught_an_employee_submitting_fake_expense/",
        "fetched_at": "2025-12-05T00:59:24.450779"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 481,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-05T00:59:26.282259"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 429,
        "num_comments": 125,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-05T00:59:26.282284"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 72,
        "num_comments": 53,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-05T00:59:26.282307"
      },
      {
        "id": "1pdrrhq",
        "title": "I paid Twitter influencers with 640k+ combined followers to promote my SaaS. Here is the brutal reality of what $750 got me. (With Proof inside)",
        "selftext": " We’ve been successfully growing our SaaS using our own method: \"High Agency\" Founder-Led Growth (using AI to build relationships and find leads). It works, and the leads are high quality.\n\nBut as a founder, I had to ask: Are we doing it the hard way? Could we just throw money at the problem and get faster results?\n\n\n\nSo, we decided to run an A/B Test:\n\n\\- Option A (The \"Easy\" Way): Pay big influencers to blast our product to 640k+ people.\n\n\\- Option B (The \"Holaboss\" Way): Stick to our AI agent that builds personal influence and finds high-intent leads one by one.\n\nI put $750 into Option A to see if it could beat our internal benchmarks. Here is exactly what happened.\n\n\n\n**Step 1: The Setup (Giving Option A a fair fight)**\n\nWe didn't want to set this up to fail. We targeted the AI/Tech niche on Twitter, our exact demographic. We even wrote the threads ourselves to ensure the messaging was perfect.\n\nWe picked three influencers:\n\n\\- Influencer A: 77.4k followers - Cost: $150\n\n\\- Influencer B: 153.8k followers - Cost: $250\n\n\\- Influencer C: 408.9k followers - Cost: $350\n\nTotal Reach: \\~640,000 followers. Total Spend: $750.\n\n\n\n   **Step 2: The Expectation vs. Reality**\n\nThe posts went live. The vanity metrics exploded. Huge views. Massive likes and retweets. Visually, it looked like a viral launch. We expected hundreds of signups to pour in.\n\n\n\n   **Step 3: The Results (The Brutal Truth)**\n\nHere is the cold shower. Those 640,000 \"followers\" generated:\n\n\\- **103 Unique Visitors.**\n\n\\- **60 Total Signups.**\n\nThat’s a Customer Acquisition Cost (CAC) of $12.50 per free signup. For a bootstrapped team, this is a disaster.\n\nThe engagement was likely from \"pods\" (engagement groups). They hype each other up, but they don't click, they don't read, and they definitely don't buy.\n\n\n\n**Step 4: The Conclusion (Founder-Led Growth Win)**\n\nThis experiment was an expensive way to validate what we already suspected: **You cannot \"rent\" trust.**\n\nWhile we burned $750 for 60 low-intent signups via influencers, our own tool (Holaboss) continued to run in the background. It was generating steady, high-intent leads by actually engaging with people and solving problems, for a fraction of the cost and zero \"fake\" hype.\n\n\n\nHere is the [proof of this campaign](https://www.notion.so/Proof-of-influencer-campaign-2bd506c7667d80f2a4dbfaab3c066e82?source=copy_link)\n\n\n\n**The Lesson for Indie Hackers**\n\nIf you are thinking of taking the influencer shortcut, here is my advice (learned the hard way):\n\n1. Negotiate hard. Prices are made up. Push for 2-3x lower.\n\n2. Avoid fake influencers. High follower counts often mean nothing but bot farms/pods.\n\n3. The \"Link in Bio\" trap. Ensure they reply to every comment with your link.\n\n4. Pay after posting. Never upfront.\n\nFor us? We are done with \"rented\" audiences. We are sticking to building real influence on our own AI.\n\nHas anyone else successfully A/B tested Influencers vs. Organic/Founder-led growth? I’d love to know if I just got unlucky, or if this is the standard now.\n\n\n\nIf you are interested in Founder-led growth, try: [Holaboss.ai](http://www.holaboss.ai/)",
        "subreddit": "SaaS",
        "author": "Remarkable_Quit_2928",
        "score": 66,
        "num_comments": 38,
        "created_utc": 1764826010.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pdrrhq/i_paid_twitter_influencers_with_640k_combined/",
        "fetched_at": "2025-12-05T00:59:21.098919"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 60,
        "num_comments": 53,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-12-05T00:59:26.282311"
      },
      {
        "id": "1pds18g",
        "title": "Huge logic hole in the “AI will end software engineering”",
        "selftext": "Was just watching a YouTuber (IYKYK) and he made a point I never thought of before:\n\n1) If all of these big $ guys are pushing for AI to get good enough to completely wipe out SE, then their entire portfolios would tank. Think about it: how many portfolio investments do these guys have in saas products? \n\nSo when the day comes that AI can just build any app you want on demand, why would I need saas XYZ? I’ll just tell my AI agent to build it for me. Why would I keep my subscription to that service? When that happens, these guys’ portfolios tank.\n\n2) Along the same line of logic, if AI reached that point, why don’t I just use Claude and tell it to build me my OWN version of Claude, called Plaude? The AI is powerful enough now right? Now I can sell Plaude to my customers and compete directly with Claude. Now we have Plaude, Slaude, Vlaude and Zlaude out there on the market. Why would anyone pay for any of them when you can just make your own? \n\nThis whole thing falls apart.\n\n——-\nEdit\n——-\n\nCool to see everyone’s unique take on this! Thanks for all the replies.\n\n\nJust to address the shortsighted “but hardware!” comments though: If company A has a product and company B with their own massive infrastructure decides to just use AI to copy…what’s the moat? You can’t say hardware anymore because these giant companies have big access.\n\nThe point is, if AI gets to the point where “software engineering is dead”, implying AI can do everything deterministically (I’m not making that claim, they are), then major corporations and investors in these products are screwed.\n\nLet’s use a simple example. It’s a long time ago, and some guy is invested in this little hut company A in the village that digs up and sells gold. They’re making bank…awesome returns. Now company B, C, D, E and F turn up one day with the exact same product, copied perfectly, with very very little cost (did not have to be first to the table and had this magical genie that could interpret everything and put together the product faster than the years of manual labor it took to create A). \n\nThe market doesn’t care how long it took you to create your product. It’s a nice “about us” page story, but at the end of the day they just care about the result.\n\nWhat do you think happens to company A’s stock? Does it just coast on like nothing happened? Does it suddenly sky rocket? Absolutely not. The market share has just been suddenly divided. At this scale we’re talking hundreds of millions of dollars. \n\n",
        "subreddit": "SaaS",
        "author": "Intelligent-Win-7196",
        "score": 59,
        "num_comments": 92,
        "created_utc": 1764826865.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pds18g/huge_logic_hole_in_the_ai_will_end_software/",
        "fetched_at": "2025-12-05T00:59:21.098900"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 58,
        "num_comments": 19,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-05T00:59:26.282280"
      },
      {
        "id": "1pduyyj",
        "title": "Started a business",
        "selftext": "So i started a business in UAE and it’s mainly marketing different clients so i got know Reddit is a great place to multiply my clients but the thing is i have no idea how to pull clients from this platform so if there’s anyone with experience do help me out",
        "subreddit": "Entrepreneur",
        "author": "Shogun547",
        "score": 52,
        "num_comments": 33,
        "created_utc": 1764837567.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pduyyj/started_a_business/",
        "fetched_at": "2025-12-05T00:59:19.379609"
      },
      {
        "id": "1pe69to",
        "title": "Can people really work on their SaaS at night after 9-5?",
        "selftext": "I don't really get it, where do people get the energy from, unless they are sacrificing other essentials like sport and taking rest?\n\nI can work on my SaaS from time to time if I don't have a lot of work during the day, but if I have many tasks and I wrap things up by evening, I can't really force myself to work on my SaaS anymore (sometimes I can if I have excess of energy). After 9-5 I need to go to gym or for a run to unwind, then I'm back and I'm having dinner and taking some mental rest by reading a book or watching something with my wife.\n\nAm I just not resilient enough? Do people really have the energy to do 9-5, and then easily switch the context to continue working on their SaaS? Or do they simply lie about the state of things?\n\nJust seeing such posts every now and then and it kinda makes me wanna quit because how can I compete with someone who doesn't need to take rest and who can just work apparently without any breaks?",
        "subreddit": "SaaS",
        "author": "velinovae",
        "score": 52,
        "num_comments": 84,
        "created_utc": 1764869803.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pe69to/can_people_really_work_on_their_saas_at_night/",
        "fetched_at": "2025-12-05T00:59:21.098878"
      }
    ]
  }
}