{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-06T16:16:00.162704"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-06T16:15:51.509081"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-11-06T16:15:51.509077"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-06T16:15:51.092536"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-06T16:15:51.092530"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2025-11-06T16:15:51.509079"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-06T16:15:51.092511"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-06T16:15:51.509075"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-06T16:15:51.092532"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-06T16:15:51.509064"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-06T16:15:51.092527"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 477,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-06T16:15:59.161302"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 183,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-06T16:15:59.161331"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 177,
        "num_comments": 28,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-06T16:15:59.161315"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 166,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-11-06T16:15:59.161359"
      },
      {
        "id": "1opmdh8",
        "title": "My client wants to buy exclusivity - what do we think?",
        "selftext": "\nMy business partner and I run a social media content  agency (2 years old, 17 active clients). One of our founding clients has approached us about going exclusive - they want us to dissolve our agency and work only for them as their dedicated in-house marketing team.\n\n**Current Situation:**\n- 17 clients generating solid revenue ($48K per month) \n\n- 9-person team (2 partners + 7 staff)\n\n- Client proposing exclusive deal has been with us since Year 1 (currently paying $9500/mo) \n\n- They've grown significantly with us (but only getting ~15-20% of our bandwidth currently)\n\n- They're our largest single client but represent <20% of our revenue \n\n**The Proposal:**\n- 12-month exclusive contract\n- We'd reduce from 9 to 4 people (me, business partner, 2 key team members)\n- Compensation: Base monthly retainer + 10% commission on their course/digital product sales\n- Scope: Personal brand, company brand, course business, potential support for spouse's brand\n- We'd be walking away from 80%+ of our current revenue to take this\n\n**The Numbers Being Discussed:**\n- $379K for the 4 person team ($144k yearly salary  for me and my partner each) \n- Commission could add $10-50K+ if we scale their course business\n- This would roughly match our current personal income but with commission upside (currently making $7k a month + building cash reserve for agency) \n- We'd go from managing 17 clients to 100% focus on one brand ecosystem\n\n**What We're Torn On:**\n\nPros:\n- Simplified operations (1 client vs 17)\n- Higher personal income potential with commission structure\n- Deep partnership with someone we've proven success with\n- 12-month contract = stability\n- Elimination of constant sales/client management\n- Can build elite expertise in one vertical\n\n**Cons:**\n- 100% concentration risk\n- Walking away from $460K+ annual revenue from other clients\n- Pausing agency growth trajectory (we could hit $1M+ in 3-5 years)\n- If it fails, we rebuild from zero\n- Letting go of 5 team members\n- No diversification\n\n**Questions for You:**\n\n1. **Has anyone made a similar pivot?** How did it turn out?\n\n2. **Is $30-32K/month + 10% commission fair** for dissolving a multi-client agency and going exclusive? Or are we undervaluing ourselves?\n\n3. **Red flags we should watch for?** Client has been great for 2 years, but exclusive relationships can change dynamics.\n\n4. **Contract terms we absolutely need?** We're thinking 12-month minimum, quarterly advance payments, 90-day notice. What are we missing?\n\n5. **How do you value opportunity cost?** Is the simplified life worth the concentration risk?\n\n6. **Anyone regret going exclusive?** What would you do differently?\n\n**Additional Context:**\n- Client is ready to scale (proven product-market fit with their course)\n- They have budget and seem committed\n- We'd still own our systems/processes\n- Could theoretically rebuild agency if this ends\n\n**The Real Question:**\nAre we crazy for even considering this? Or is this the kind of focused partnership that could be more valuable than spreading ourselves thin across 17 clients?\n\nWould love to hear from anyone who's faced a similar decision - especially if you've been on either side of an exclusive arrangement.\n\n**Edit:** To clarify - we're not desperate or struggling. Agency is healthy and growing. This is purely a strategic decision about depth vs. breadth.",
        "subreddit": "smallbusiness",
        "author": "OkRiver3744",
        "score": 140,
        "num_comments": 185,
        "created_utc": 1762394464.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1opmdh8/my_client_wants_to_buy_exclusivity_what_do_we/",
        "fetched_at": "2025-11-06T16:15:57.382336"
      },
      {
        "id": "1opjbjc",
        "title": "I built a product people didn’t want and everything changed",
        "selftext": "Yesterday I launched a cool feature on my side business that I swore users would love. I had data, surveys, screenshots the whole roadmap and within 24 hours it became the feature nobody touched. Click rate was ZERO messages NOTHING. I just sat there thinking how the hell did I miss this.  \nInstead of scrapping it I decided to ask why so I sent a quick survey to some friends I actually trust and their replies were brutally honest, one even said flat out that they just didn’t care lol. That line hit harder than I expected because I realized I’d been building what I wanted to exist not what people actually needed.  \nThis morning I pulled the plug on that feature went back to the core product and scrapped all the next quarter growth plan bullshit. It feels strange to call it progress when it looks like a step back but I’ve never been this sure about where to go next.  \nFor anyone building something when’s the last time you asked your customers not what’s new but what’s broken for them right now?",
        "subreddit": "Entrepreneur",
        "author": "GhostLion296",
        "score": 138,
        "num_comments": 51,
        "created_utc": 1762386336.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1opjbjc/i_built_a_product_people_didnt_want_and/",
        "fetched_at": "2025-11-06T16:15:52.314420"
      },
      {
        "id": "1opp9eh",
        "title": "Why I Rebuilt My SaaS Stack for 2025 (and the Tools I’m Sticking With)",
        "selftext": "Last month I decided to clean up my SaaS project stack, it had grown messy over time, full of legacy tools and workarounds. I wanted something faster, more type-safe, and easier to maintain with a small remote team.\n\nAfter a few weeks of trial and error, here’s what I ended up with (and what I’d actually recommend):\n\n### Core\n- **Next.js** + **tRPC** for type-safe full-stack work\n- **Drizzle ORM** + **PostgreSQL** for transparent SQL and migrations\n- **TanStack Query** to keep data fetching smooth\n\n### Tooling\nI replaced Postman with **Apidog** for API testing and documentation — it’s been surprisingly good, especially the offline support and Postman import.  \nAlso using **Turborepo**, **pnpm**, **Zod**, and **DeveloperHub.io** for monorepos, package management, validation, and docs.\n\n### UI & Infra\n- **Tailwind CSS** + **shadcn/ui** + **Framer Motion** for design\n- **Vercel**, **Redis**, and **Inngest** for deployment, caching, and workflows\n\nHonestly, this setup has made dev life much smoother. I’m still refining things, but it feels clean and fast again.  \n\nCurious, what’s your current SaaS stack looking like for 2025? Any underrated tools you’re using?",
        "subreddit": "SaaS",
        "author": "Admirable-Item-6715",
        "score": 92,
        "num_comments": 22,
        "created_utc": 1762402671.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1opp9eh/why_i_rebuilt_my_saas_stack_for_2025_and_the/",
        "fetched_at": "2025-11-06T16:15:53.989387"
      },
      {
        "id": "1ooy3c8",
        "title": "How to raise money from VCs at pre-seed. Don’t. <I will not promote>",
        "selftext": "Stop chasing VC money at pre-seed, if you are not prepared. It’s a waste of time.\n\nIn my first startup we raised money from Sequoia, Techstars and SkyDeck. But before that, we wasted the first six months trying to convince investors with nothing to show, just a website and some nice words.\n\nAfter going through several accelerators and meeting hundreds of founders, I realized one thing: raising money too early is one of the biggest mistakes you can make.\n\nAt the pre-seed stage, VCs care about four things:\n\n**Experience**. They want a team with real experience in the field. Not just smart people, but people who understand the industry deeply.\n\n**Traction**. They want to see real growth, something that proves people actually care about what you are building.\n\n**Credibility**. They want to invest in startups that can convince other investors too.\n\n**Progress**. If a VC asks you to keep them updated, do it. It shows that you can set goals and reach them.\n\nNow let’s destroy some myths:\n\n* VCs are not attracted by ideas. Ideas are cheap, execution is everything.\n* VCs are not your friends, even if they smile and follow you on LinkedIn. They invest because they expect a return.\n* VCs are not necessarily looking for profitable startups. They are looking for startups that can be sold. The exit is what matters, which means reaching the next round.\n\nAnd about the pitch deck, it will never raise money by itself. It is just a business card to get a meeting. Focus on clarity and content, not fancy design. YC’s guidelines are still the best reference. Keep it short, direct and free of meaningless buzzwords.\n\nHere are some hard truths most founders learn too late.\n\nThe money you raise is not your money. You will not get rich from funding rounds. In most cases your salary will be the lowest in the company.\n\nFunding is debt. It is high risk, but still debt. No one gives you money for free.\n\nVC's money are for growth, not validation.\n\nThe only reason to raise is to grow faster, not to prove that your idea works.\n\nAnd raising a lot does not mean you are successful. Sometimes it only means you are good at selling dreams. I have seen CEOs raise millions with no traction, no experience and just confidence. They looked arrogant, overly self assured, and VCs loved it. Especially if they were young.\n\nBut success means building a company that creates value for customers and generates real revenue from that. It means reaching break even and becoming self sustaining.\n\nRemember, raising more money often means getting further from profitability.\n\nBefore chasing investors, ask yourself:\n\n* Is my team experienced enough for this industry?\n* Are we credible for the next round? \n* Is my idea already validated?\n* Do I really need to grow fast?\n\nIf your answer sounds like any of these, stop now:\n\nI need money for myself.  \nI need money to validate the idea.  \nI need money to convince my cofounder.  \nI need money to hire someone to build it.  \nI need money to prove the project works.\n\nAnd the worst of all:  \nI need money to get rich.\n\n**Did you ever feel like trying to raise money from VCs was pointless? Why?**",
        "subreddit": "startups",
        "author": "diodo-e",
        "score": 79,
        "num_comments": 45,
        "created_utc": 1762333701.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1ooy3c8/how_to_raise_money_from_vcs_at_preseed_dont_i/",
        "fetched_at": "2025-11-06T16:15:55.739316"
      },
      {
        "id": "1opf6k4",
        "title": "I own an IT company and my marketing is very bad.",
        "selftext": "I'm a local business in Chicago owning an IT company that does website designs, AI integration, Cybersecurity, and helping backups and backend of a business. A B2B business. How do y'all market, the fact this is an entire different sector and so frustrating the amount of hours it takes to learn. I have finally decided it would be better to just hire someone. I'm even thinking to use some of those crazy AI videos for visuals using those new softwares that are coming out. And where do I even look for good marketers, most of my business comes from referrals. I just want a consistent system that brings in leads every week. My work speaks for itself I just need to work for it to speak. I applaud all of your marketing experts honestly because after 4 calls with people on Fiverr I might have lost hope. ",
        "subreddit": "smallbusiness",
        "author": "Diligent-Ad9463",
        "score": 76,
        "num_comments": 58,
        "created_utc": 1762376677.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1opf6k4/i_own_an_it_company_and_my_marketing_is_very_bad/",
        "fetched_at": "2025-11-06T16:15:57.382346"
      },
      {
        "id": "1o40fm7",
        "title": "As someone who works from home, how do you socialise? or meet new people/make friends?",
        "selftext": "I am working from home, a 27F. Honestly it gets boring and i dont have any friends in here in my hometown. I have lived in hostel since 15 and hence havent made any friends here.\n\nMy hometown is also not a lively place with meetups or activities happening, so it just becomes difficult for me.\n\nAny other way to socialise? maybe any online ways? Please suggest.\n\nUpvote1Downvote1Go to comments  \n",
        "subreddit": "freelance",
        "author": "This-Brief6214",
        "score": 63,
        "num_comments": 62,
        "created_utc": 1760201179.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o40fm7/as_someone_who_works_from_home_how_do_you/",
        "fetched_at": "2025-11-06T16:15:59.161349"
      }
    ]
  }
}