{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-03T00:59:02.409239"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-03T00:58:53.636549"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-03T00:58:53.218139"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-03T00:58:53.218141"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-03T00:58:53.218126"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-03T00:58:53.636546"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-03T00:58:53.636554"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-03T00:58:53.636551"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-12-03T00:58:53.218146"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-03T00:58:53.636533"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-03T00:58:53.218143"
      }
    ],
    "reddit": [
      {
        "id": "1pc5ix4",
        "title": "My friend got an ada demand letter and showed me the actual settlement agreement they wanted him to sign, this is insane!",
        "selftext": "My buddy runs a small shopify store, he got hit with an accessibility demand letter last month from some law firm. The initial demand was for $20k settlement plus legal fees, they sent over the actual settlement agreement template and the terms are wild beyond just the money.\nAgreement requires: bringing site into \"substantial compliance\" with wcag 2.2 level aa within the term of agreement, 24 month monitoring period where they can come back and check, if you breach any terms they can reopen the case, strict confidentiality clause so you can't even tell other business owners about the amount or terms.\nThe kicker is buried in section 4 about remediation, you have to make \"good faith efforts\" but there's no clear standard for what that means. So even after paying $20k+ and doing work, they could potentially argue you didn't try hard enough.\nI talked to a lawyer who said these agreements are designed to be vague so they can keep coming back, the confidentiality clause means most business owners can't even compare notes or warn each other.\nAnyone else seen agreements like this? Trying to figure out if these terms are standard or if this firm is extra aggressive.",
        "subreddit": "smallbusiness",
        "author": "Wtf_Sai_Official",
        "score": 737,
        "num_comments": 240,
        "created_utc": 1764672930.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pc5ix4/my_friend_got_an_ada_demand_letter_and_showed_me/",
        "fetched_at": "2025-12-03T00:58:59.503052"
      },
      {
        "id": "1pbqs27",
        "title": "Advice from a 9-figure entrepreneur",
        "selftext": "I started my first business in 2010, and have gone from having about a thousand bucks in my bank account to a paper net worth in the low nine figures (though this will come down to high eight figures after taxes). Here's my advice FWIW:\n\n**1. Learn technical skills.** Unless you're an artist or a restauranteur or something like that, odds are that the majority of your work is going to be done on a computer. As such, you should master keyboard shortcuts, use multiple monitors, set up your workspace in an efficient way, learn basic coding skills (Javascript, HTML, and SQL are all you really need), know how to model things out in spreadsheets, etc. These skills have been instrumental to me in everything I've done as an entrepreneur, and without them there is absolutely no way I would have succeeded. One of my earliest memories of my first business was a friend asking me how I was making money (he was trying something similar and failing); I could see that a lot of the reason he was failing is that he couldn't handle any of the technical aspects of what he was doing himself (eg building a website), and so was paying for someone else do do a third-rate job of it. I said \"learn how to code\" and he responded with \"but that's too hard.\" Yes, learning new things is hard, and he also should have learned how to code. Which brings me to...\n\n**2. Suck it up and do the hard things.** The vast majority of people give up when they hit their first wall. Another huge chunk drop off after the second, third, or fourth. The people who succeed are the ones who suck it up and power through the shitty parts of entrepreneurship (and it's mostly shitty at the start). I learned this during the first year of my third business, and I'm learning it again now as I'm trying to get my philanthropic efforts off the ground: there is just so much stuff when you're starting out that's a pain in the ass, and there's no one to do it but you. If you can muster the mental fortitude to just make yourself do those things, you will separate yourself from 99% of the competition and massively increase your odds of success. As just one example: can you even *imagine* how difficult it must have been to sell books on the internet in 1993? Jeff Bezos must have literally run into thousands of pain-in-the-ass things, any one of which would have deterred a normal person, but he kept at it and now he's Jeff Bezos.\n\n**3. That which gets measured gets improved.** I have kept a side scrolling daily spreadsheet of my company's P&L every single day going back to 2010. If I determine that something is critical to my company's success, I carefully measure it over time, and take note of any initiative that moves the numbers in a positive or negative direction. Even if you're just starting out and there's not much to measure, measure it. Make it a habit. While it's possible to drown yourself in data overload, I think it's much more common for people to be deficient in their data gathering and analysis than to take it too far.\n\n**4. Practice good manners.** It's crazy to have to write this one out, but I can't tell you how many people I come across that don't do this. If someone emails you, respond quickly. If they help you, say thank you (in fact, I recommend signing off on all your emails with \"Thanks, \\[First Name\\]\"). If they ask for a favor that's easy for you to deliver, do the favor. Follow up with people after a good conversation. Remember to always speak to what the *other person* wants, not just what you want. (That's another head-scratcher: the number of people who will say \"Hey Chris, it would really help me if you do X and Y\" without even considering what I want or whether it's in my interest to do what they're asking.)\n\n**5. Be obsessed with your business.** I recently stepped away from my company and handed the reins over to the management team. One of the major differences I've noticed in how they do things vs how I did things is that I was *obsessed* with the business, and they're not (somewhat understandably, obviously, as they don't have my equity stake in it). When you're obsessed with your business, things don't catch you by surprise because you were already worried about them way before they happened. When you're obsessed with your business, you always have a dozen ideas ready to go whenever resources free up. When you're obsessed with your business, you become the ultimate expert at the company across a variety of topics, and can be an invaluable resource to employees / teammates. Get obsessed.",
        "subreddit": "Entrepreneur",
        "author": "chris-abovewealth",
        "score": 553,
        "num_comments": 181,
        "created_utc": 1764627628.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pbqs27/advice_from_a_9figure_entrepreneur/",
        "fetched_at": "2025-12-03T00:58:54.504183"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 482,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-03T00:59:01.407858"
      },
      {
        "id": "1pbiiil",
        "title": "i swear entrepreneurship is just waking up every day and choosing delusion",
        "selftext": "idk who needs to hear this but i’m convinced like 80% of entrepreneurs are just running on pure delusion and caffeine.\n\nlike today i woke up fully convinced i’m gonna scale my business, dominate new markets, maybe even retire early  \nand then by noon i’m sitting on my floor eating cereal straight from the box wondering why nobody replies to my outreach 😭\n\nwhy does this stuff feel so simple in your head but turn into a whole greek tragedy when you try to do it in real life\n\nis this normal or am i just built wrong lol  \nwhat keeps u going when your brain is like pls stop but your soul is like nah we up next?\n\n",
        "subreddit": "Entrepreneur",
        "author": "Fulcilives1988",
        "score": 449,
        "num_comments": 108,
        "created_utc": 1764609213.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pbiiil/i_swear_entrepreneurship_is_just_waking_up_every/",
        "fetched_at": "2025-12-03T00:58:54.504207"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 431,
        "num_comments": 123,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-03T00:59:01.407874"
      },
      {
        "id": "1pcd2ka",
        "title": "Sold 340 lifetime deals for $149 each. 18 months later I regret every one.",
        "selftext": "Needed cash to fund development. Ran a lifetime deal on AppSumo. $149 for lifetime access to a product I was charging $39/month for.Sold 340 deals in 2 weeks. $50,660 in revenue. Felt like winning the lottery.18 months later, here's the math:If those 340 customers paid monthly at even 50% of normal price ($19.50), with average 14-month retention, that's $92,820 in revenue.I left $42,000 on the table. And counting, because lifetime means forever.But the money isn't the worst part.LTD customers are my highest-support users. They submit 3x more tickets than monthly subscribers. They request features constantly. They leave 1-star reviews when I don't build what they want.They have zero incentive to churn, so they stick around complaining instead of quietly leaving.My NPS among LTD customers: 12. Among monthly subscribers: 54.And I can never raise prices on them. They're grandfathered at $0/month for life.What I'd do differently:If you need cash, offer annual plans at a discount. You get money upfront but customers still renew.If you must do LTDs, cap the number ruthlessly. 50 max. Create scarcity.Never offer lifetime on a product that has ongoing server costs. You're signing up to lose money on every user forever.The AppSumo crowd isn't your target market. They're deal hunters who buy everything and use nothing. Not ideal customers for feedback or growth.Still digging out of this hole.Anyone else have LTD regrets?",
        "subreddit": "SaaS",
        "author": "Big_Currency_1805",
        "score": 375,
        "num_comments": 122,
        "created_utc": 1764693198.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pcd2ka/sold_340_lifetime_deals_for_149_each_18_months/",
        "fetched_at": "2025-12-03T00:58:56.173048"
      },
      {
        "id": "1pby9w1",
        "title": "I’m 25, broke, and my launch got 0 paid users",
        "selftext": "Give it to me straight, guys.\n\nI’m 25. Most of the people I went to high school with are planning weddings, having a nice a job or climbing a corporate tree or whatever. meanwhile, I’ve spent the last 8 years in my room learning music production, Svelte, Python, Django, and now LangGraph/LangChain which took a lot of time and energy but i loved every bit of it.\n\nI don’t have a degree. I don't have a girlfriend. And right now, I’m broke.\n\nLast month, I finally launched the MVP of my first serious startup, I poured everything into it. it got 15 free signups. and $0 Revenue\n\nI honestly fell into a depression. I tried to fix it by doing manual cold outreach (pitching via DMs/Email). It didn’t work obviously, because you need volume for that, and I was doing it by hand. I got depressed again.\n\nThen i realized I can't hide behind the code anymore. I have to become a marketer. I’m committing to turning on the camera and building a personal brand on Twitter to drive traffic. I’m also polishing a second app to handle the social media side, while flowjoy handles the search/text side\n\nMy Plan Moving Forward:\n\nStop crying about being 25 and got nothing to show for it\n\nuse my own tool to handle the SEO/Reddit grunt work.\n\nlaunch the my second app to handle instagram/youtube/tiktok.\n\nget on camera and document this messy journey.\n\nThis life feels like a rollercoaster and i don't know if it's just me or is it like this for everyone",
        "subreddit": "Entrepreneur",
        "author": "Kindly-Show3187",
        "score": 125,
        "num_comments": 262,
        "created_utc": 1764647263.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pby9w1/im_25_broke_and_my_launch_got_0_paid_users/",
        "fetched_at": "2025-12-03T00:58:54.504187"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 75,
        "num_comments": 53,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-03T00:59:01.407897"
      },
      {
        "id": "1pbz7hl",
        "title": "I made $1000 from a \"useless\" app in a saturated market. Here's my journey",
        "selftext": "Two months ago, I was mass-DMing strangers on the internet. Today, I have 90+ paying customers.\n\nI launched Vexly (a subscription tracker) on September 20th. I was convinced it would fail because:\n\n* Rocket Money exists and does automation while mine is just manual tracking\n* There are a million free alternatives\n* The market is completely saturated\n\nBut I built it anyway.\n\nMy first strategy was finding people on social media complaining about getting charged for subscriptions they forgot about and DMing them. I DMed 100-200 people in one day. 98% ghosted me. A few replied but zero conversions. Complete waste of time.\n\nThen on September 22nd I decided to just launch publicly. Reddit, HackerNews, ProductHunt. Threw it out there. Within a few hours I got 2 paid users from HackerNews.\n\nThat's when it clicked. Building the product is easy. Distribution is everything.\n\nSo I started sharing everywhere. Not just \"check out my app\" posts, but actually documenting my journey. What I was building, what I was learning, the numbers. By end of October I had around $157 revenue and 20 paid users. Not life-changing but proof that people actually wanted this.\n\nNovember was when things got interesting. I kept doing the same thing, build in public, share the journey. Then a few posts started going viral. With virality came the haters:\n\n* \"AI slop\"\n* \"A subscription to track subscriptions?\" (even though my product is one time payment only but okay)\n* \"Just use \\[free alternative\\]\"\n\nI'd be lying if I said it didn't get to me. But I kept going.\n\nI also got feedback that I was underpricing. So I tested raising prices slowly from $7.50 to $12.50 to $17.50 and finally $22.50. The conversion rate didn't drop at all. Started collecting testimonials and adding them to the landing page which helped a lot too.\n\nEnd result:\n\n* November revenue: $768\n* Total revenue: $1000+\n* Paid users: 90+\n* December so far: already at $100\n\nTwo months ago I was convinced nobody wanted my app. Now 90+ people have pulled out their credit cards to pay for it.\n\nDecember just started. How about you? What's your story?",
        "subreddit": "SaaS",
        "author": "Bubbly_Lack6366",
        "score": 61,
        "num_comments": 47,
        "created_utc": 1764650003.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pbz7hl/i_made_1000_from_a_useless_app_in_a_saturated/",
        "fetched_at": "2025-12-03T00:58:56.173088"
      },
      {
        "id": "1ozc3zq",
        "title": "Lost $2,300 to scope creep on one project. How do you prevent this?",
        "selftext": "Feeling defeated and I need advice from freelancers who've figured this out.\n\nClient hired me for a landing page: $2,000 for 20 hours of work (my rate is $100/hr).\n\nThen the extras started:\n\n\\- \"Can you add a blog section?\" (+10 hours)\n\n\\- \"Actually let's change the entire color scheme\" (+8 hours)\n\n\\- \"One more revision on the copy\" (+5 hours)\n\n\n\nI kept saying yes because I didn't want to lose the client or get a bad review.\n\nFinal tally: 43 hours worked, $2,000 paid.\n\nThat's $2,300 in unpaid work (23 hours × my $100/hr rate).\n\n\n\nFor those who've cracked this - what's your system?\n\n\n\nDo you:\n\n\\- Invoice immediately for every change request?\n\n\\- Have contracts tight enough to prevent this?\n\n\\- Just say no and risk the relationship?\n\n\\- Something else I'm missing?\n\n\n\nI can't keep doing this. Next project I need a better approach.\n\nAny advice appreciated.",
        "subreddit": "freelance",
        "author": "Able_Juggernaut_149",
        "score": 57,
        "num_comments": 51,
        "created_utc": 1763372522.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ozc3zq/lost_2300_to_scope_creep_on_one_project_how_do/",
        "fetched_at": "2025-12-03T00:59:01.407901"
      }
    ]
  }
}