{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-09-04T16:14:20.493229"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-09-04T16:14:12.968790"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-09-04T16:14:12.679122"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-09-04T16:14:12.679114"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-09-04T16:14:12.679104"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-09-04T16:14:12.968787"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-09-04T16:14:12.968794"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-09-04T16:14:12.968792"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-09-04T16:14:12.679118"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-09-04T16:14:12.968775"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-09-04T16:14:12.679120"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 449,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-09-04T16:14:19.492306"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 276,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-09-04T16:14:19.492381"
      },
      {
        "id": "1n7xpo3",
        "title": "Hired a Freelancer. It’s not going well.",
        "selftext": "I hired a freelancer off of Fiverr to set up automated workflows in my CRM. I have a template provided by the CRM company to that I used when I thought I would do it myself. I had a lot done but didn’t have all the canned emails written. \nFreelancer shared a a draft. I made a bunch of revisions because he doesn’t look like he used the template at all. And none of the emails he drafted even have my company logo/email signature on them. \nWe met again today to talk about it and for me to explain the revisions I needed. I left the meeting feeling pretty discouraged. \nThen later today another client emails me confused because they’d just gotten an (automated) email that doesn’t have anything to do with where they are in my process (this client is booked and paid already and the email they received was about proposals). This is the third client to get that email in the last two weeks!\n\nI’m frustrated and worried. I want to give the guy time to work it out but also I want to cut my loses. Do I have too much of a “if you want something done right you’ve got to do it yourself” attitude or is this really not working out?\n\nUpdate: Thank you for your responses I’ve let the freelancer go and am learning a lot from this experience. ",
        "subreddit": "smallbusiness",
        "author": "-me-myself-",
        "score": 235,
        "num_comments": 61,
        "created_utc": 1756951173.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n7xpo3/hired_a_freelancer_its_not_going_well/",
        "fetched_at": "2025-09-04T16:14:18.120869"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 150,
        "num_comments": 173,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-09-04T16:14:19.492347"
      },
      {
        "id": "1n83i6e",
        "title": "It’s FINALLY happening, My SaaS has made over $40k in its first year!",
        "selftext": "Just 1 year ago, I started building a chrome extension to fill the gaps in ChatGPT (added an option to pin chats, create folders and subfolders, save prompts and prompt chains, bookmark chat messages, bulk delete and archive, export chats to files, download messages as an MP3 in 9 different voices, download advanced mode recordings, and many other cool features).\n\nWhat started as a simple idea has taken off in ways I never imagined - over 14000 users and incredible reviews (245 reviews with an average of 4.67/5 stars), all organic, no paid ads. 💪\n\nInitially, the extension was free because I wanted to ensure it was stable. Every few days, I added new features: folder creation, saving prompts for reuse, and much more.\n\nAfter gathering tons of feedback, I realized I’d solved a real problem - one people were willing to pay for.\n\nFinally, I launched the paid version! There are now three tiers: Free, Monthly Subscription, and Lifetime Access.\n\nHere’s the wild part: just minutes after flipping the switch, someone from the U.S. bought a lifetime subscription. Then, someone from Spain grabbed a monthly plan. And it just kept going!\n\nOne year ago, I had an idea. Today, I have paying customers. The sense of fulfillment is absolutely unreal - it’s a feeling that words just can’t capture. 🙌\n\nI think that what really sets me apart is how much I care about my clients. I always make them my top priority, and I try to respond to emails within minutes whenever possible. Providing fast, thoughtful, and reliable support is super important to me because I want my clients to feel valued and taken care of.\n\nIf you are a heavy ChatGPT user, please give it a shot, there is absolutely no way you will regret it.\n\nThis may not exactly be a passive income, but my goal is to get to a larger number of subscribers, and I am working very hard to get there, after that, i hope it will become passive :)",
        "subreddit": "Entrepreneur",
        "author": "Ok_Negotiation_2587",
        "score": 115,
        "num_comments": 79,
        "created_utc": 1756970331.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n83i6e/its_finally_happening_my_saas_has_made_over_40k/",
        "fetched_at": "2025-09-04T16:14:13.749893"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 108,
        "num_comments": 55,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-09-04T16:14:19.492364"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 96,
        "num_comments": 57,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-09-04T16:14:19.492333"
      },
      {
        "id": "1n85fgc",
        "title": "i made a free list of 85 places where you can promote your app",
        "selftext": "Every time I launch something new, I end up wasting hours hunting down SaaS directories — bouncing between random lists, checking which ones are still alive, and cobbling together a spreadsheet. It’s messy, inconsistent, and honestly just frustrating.\n\nSo I finally sat down and prepared a clean list of launch directories, places like Reddit, go-publicly and a bunch more. Ended up with 85+ solid ones, all active. I even added Domain Rating (DR) so you can see which sites have stronger authority for SEO and visibility.\n\nNo fluff, no upsell, just the list I wish existed.\n\nIf anyone wants it, happy to share the sheet.\n\nadding the link to sheet since a lot of users are in need \n\n[https://docs.google.com/spreadsheets/d/1shdlZRhhAKNa47B2Lo2I7pIi29vo9MH3mX6u0cV4LoM/edit?gid=0#gid=0](https://docs.google.com/spreadsheets/d/1shdlZRhhAKNa47B2Lo2I7pIi29vo9MH3mX6u0cV4LoM/edit?gid=0#gid=0)",
        "subreddit": "SaaS",
        "author": "Outside_Elephant3445",
        "score": 85,
        "num_comments": 77,
        "created_utc": 1756977877.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n85fgc/i_made_a_free_list_of_85_places_where_you_can/",
        "fetched_at": "2025-09-04T16:14:15.250928"
      },
      {
        "id": "1n7tzsm",
        "title": "Convince me your SAAS is worth the money and I'll Pay - I want some genuinely helpful products here!",
        "selftext": "**TL;DR format only for your pitch**\n\n**Good luck!**",
        "subreddit": "SaaS",
        "author": "Glittering_Design_76",
        "score": 69,
        "num_comments": 209,
        "created_utc": 1756940936.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n7tzsm/convince_me_your_saas_is_worth_the_money_and_ill/",
        "fetched_at": "2025-09-04T16:14:15.250944"
      },
      {
        "id": "1n7fgoo",
        "title": "VC at a well known fund and Entrepreneur with 25+ years experience.  Scheduled AMA for today and approved by Mods - I will not promote.  Will be here until 4pm CT",
        "selftext": "**Hello Startup Reddit. I'm pretty active in this sub when I have time. My favorite topics generally revolve around equity structures, investing, SAFEs, Convertible Notes, Options, term sheets, 409a, 83b, QSBS, tax implications and all things governance, structure, equity, funding, etc.**\n\nThere are others that are better suited to address GTM, Marketing, Sales, Product. I have my opinions but those areas aren't my passion (or probably the best use of my expertise).\n\nIf you look at my comment history, you'll see I'm not afraid to call bullshit and I am pretty direct with my opinions.\n\n**I can't post my LinkedIn or my personal website, but I'm Bob Gillespie - Managing Partner of REACH Commercial at Second Century Ventures. You can find me on LinkedIn and I'm also** [**bob@thecaptableguy.com**](mailto:bob@thecaptableguy.com)**.**\n\nI've been in the startup, accelerator, VC world for 25 years. Happy to answer questions that interest me and are helpful to you.\n\nNot looking for anything in return, just thought I'd give back to the community some hard won knowledge. I'm pretty accessible in general.\n\nDisclaimers:\n\nAny opinions are mine and mine alone and do not reflect anyone's other than mine.\n\nThe fund where I'm a managing partner invests in PropTech with adjacencies in InsureTech and FinTech primarily. I'm not really here for deal flow so not all that interested being pitched, but happy to help where I can on how VCs look at prospects.\n\nDon't be offended if I don't answer a question, it just means I don't have anything enlightening to say, don't know your vertical, or just don't have an answer worth typing. (Ex: \"How do I get more downloads on my app?\" I literally have no clue.)\n\nLet's have some interesting conversations.\n\nEDIT:  Really good time today with well over 100 questions/replies.  Signing off for now, but perhaps I'll do another in December or so!  Thanks all.  -G-",
        "subreddit": "startups",
        "author": "StartupsAndTravel",
        "score": 63,
        "num_comments": 131,
        "created_utc": 1756907671.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1n7fgoo/vc_at_a_well_known_fund_and_entrepreneur_with_25/",
        "fetched_at": "2025-09-04T16:14:16.713534"
      }
    ]
  }
}