{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-08T00:54:07.506095"
  },
  "data": {
    "youtube": [
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-08T00:53:59.110250"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-08T00:53:59.110239"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2025-11-08T00:53:59.543580"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-08T00:53:59.110226"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-08T00:53:59.543575"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-08T00:53:59.543577"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-08T00:53:59.543583"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-08T00:53:59.110246"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-08T00:53:59.543568"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-08T00:53:59.110243"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 471,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-08T00:54:06.504742"
      },
      {
        "id": "1oqkm3a",
        "title": "How is Tesla valued, and how can I get they afford to give Musk one trillion dollar package?",
        "selftext": "I am truly baffled at how Tesla is generating such significant revenue that they can pay Elon a trillion dollars. A part of me feels like this is just news to create perceived value and hype. \n\nI find it difficult to believe that Tesla is generating this much in sales and value. \n\nI feel that their (Tesla's) success and valuations must be linked to government contracts.",
        "subreddit": "Entrepreneur",
        "author": "KAZKALZ",
        "score": 300,
        "num_comments": 195,
        "created_utc": 1762488606.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oqkm3a/how_is_tesla_valued_and_how_can_i_get_they_afford/",
        "fetched_at": "2025-11-08T00:54:00.113734"
      },
      {
        "id": "1oqb26w",
        "title": "What’s the most uncomfortable truth about entrepreneurship that most people don’t realize?",
        "selftext": ".",
        "subreddit": "Entrepreneur",
        "author": "RtgodDR",
        "score": 282,
        "num_comments": 293,
        "created_utc": 1762463430.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oqb26w/whats_the_most_uncomfortable_truth_about/",
        "fetched_at": "2025-11-08T00:54:00.113744"
      },
      {
        "id": "1or3gas",
        "title": "We have 5 subscriptions of the same software because nobody talks to each other",
        "selftext": "Just did an audit of our software spending because our burn rate seemed way too high\n\n  \nIt turns out that we're paying for 5 separate subscriptions to Notion across 3 different credit cards. Some are individual plans, some are team plans and one is an enterprise plan that nobody is even using\n\n  \nHow does this happen? I'll tell you how it happens. It's because different teams just sign up for shit without even CHECKING if we already have it. Marketing has their own. Engs have their own. Sales has their own. Even our 2 person HR team has their own workspace\n\n  \nI added it all up and we're spending like $900 per month on Notion when we could have one enterprise plan for close to 500\n\n  \nAnd it's not just Notion btw. We have multiple Zoom accounts, 3 different Figma subscriptions, 4 ChatGPT plus accounts (why???) amd 2 AWS accounts that are both being used for different projects\n\n  \nI brought this up to our COO and he just shrugged and said that that's what happens when you grow fast what an answer hahahaha",
        "subreddit": "smallbusiness",
        "author": "NoCommittee4973",
        "score": 257,
        "num_comments": 39,
        "created_utc": 1762542956.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1or3gas/we_have_5_subscriptions_of_the_same_software/",
        "fetched_at": "2025-11-08T00:54:04.761094"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 184,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-08T00:54:06.504773"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 182,
        "num_comments": 31,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-08T00:54:06.504754"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 169,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-11-08T00:54:06.504804"
      },
      {
        "id": "1oqqkln",
        "title": "The actual timeline of building a startup (not the LinkedIn version) - i will not promote",
        "selftext": "everyone on linkedin and reddit posts their highlights. \"we hit $1M ARR in 6 months\" or \"went from idea to profitable in 90 days.\"\n\nheres the real timeline nobody talks about:\n\nMonth 1-2: talking to users, realizing your idea is wrong  \nMonth 3: building scrappy MVP  \nMonth 4: launching the mvp  \nMonth 5-6: talking to more users, realizing the MVP is solving wrong problem  \nMonth 7-8: rebuilding based on what you learned  \nMonth 9: launching again, getting some traction  \nMonth 10-12: figuring out how to get users consistently  \nMonth 13-18: actually growing but slower than you thought  \nMonth 19-24: finally understanding your business\n\nthats if youre FAST. most take 3 years to get to that point.\n\nthe linkedin version makes it seem like 6 months idea to scale. the reality is 18-24 months idea to consistent revenue. and thats okay. the founders who accept this timeline make better decisions. the ones expecting 6 months burn out or run out of money.\n\nif you are in month 8 feeling behind you are not. you are actually on pace. just nobody talks about the real timeline.",
        "subreddit": "startups",
        "author": "ksundaram",
        "score": 109,
        "num_comments": 24,
        "created_utc": 1762510089.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oqqkln/the_actual_timeline_of_building_a_startup_not_the/",
        "fetched_at": "2025-11-08T00:54:03.299121"
      },
      {
        "id": "1oqlcdo",
        "title": "Business idea: Helping men make their homes feel warm, welcoming, and safe, for under $250",
        "selftext": "I’m not a fancy or high-maintenance woman, but I really appreciate when a man has his life and space in order. I feel like there are so many incredible men out there who just need a little guidance with style and environment.\nA lot of guys spend money on dating or communication coaching, but then when a woman actually comes over, the space feels off. The lighting’s harsh or too bright, there’s no music, maybe it smells a little stale or feels cold (literally and emotionally). It’s not that they don’t care, it’s just that no one’s ever taught them how to make a home feel safe and inviting.\nSo I’m thinking of creating a course or guide that teaches men how to transform their space on a budget for under $250 using simple sensory design: lighting, scent, warmth, music, and personal touches.\nI’m also a licensed massage therapist, so I could include a section on the basics of slow, safe, intentional touch to help men understand the connection between physical environment and emotional comfort.\nDoes this sound like something people would actually pay for or be interested in? Any thoughts on how to structure it as a course, digital guide, or coaching?\n",
        "subreddit": "smallbusiness",
        "author": "livingonluna_",
        "score": 99,
        "num_comments": 93,
        "created_utc": 1762490928.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oqlcdo/business_idea_helping_men_make_their_homes_feel/",
        "fetched_at": "2025-11-08T00:54:04.761102"
      },
      {
        "id": "1or644h",
        "title": "I paid 5 influencers on LinkedIn to promote my SAAS : here’s what $1250 got me",
        "selftext": "A few weeks ago I decided to test something new for my SaaS.  \nInstead of running more cold email or ads, I tried using LinkedIn influencers.\n\nI wanted to get people to comment on a post, send them a Notion resource, and redirect them to my site.\n\nThe experiment ran for two weeks, and I spent 1,250 dollars in total for five influencers.\n\nYou can check [the influencer's post + profile here](https://www.notion.so/Proof-of-influencer-campaign-29bb9abcbe3f80f8aefff2323103f3e4?source=copy_link)\n\n**Step 1: Finding influencers**\n\nThere are basically two types of influencers. The niche experts who have small but super relevant audiences. And the viral creators who get huge reach but with less qualified people.\n\nI picked a mix of both.\n\nI searched for people who had already done sponsored posts for competitors. I DMed more than fifty of them, compared pricing and engagement stats, and selected five.  \nI wrote the posts myself and made the visuals so everything looked consistent.\n\n**Step 2: The process**\n\nEach influencer posted exactly what I gave them.  \nWhen people commented, they replied with a Notion link. The more comments, the more reach, the more clicks.\n\nInside that Notion page, I included a link to my SaaS trial and a “book a demo” button.  \nEach influencer had a personalized page with a tracking link.  \nOne of them even customized the page for their French audience and it performed better than the generic version.\n\nI made sure the Notion resource gave a lot of real value so people thought, “If this is free, the paid version must be crazy.”\n\n**Step 3: The results**\n\nI spent 1,250 dollars. Two influencers brought absolutely nothing. Not even a single visit. Probably engagement pods.\n\n$500 wasted.\n\nThe other three actually worked.\n\nThe first one brought around 75 new signups, 25 trials, 12 paid conversions, and seven demo calls with large teams.  \nThe second one brought 27 signups, nine trials, four paid conversions, and one demo call.  \nThe third one brought 12 signups, five trials, and three paid conversions.\n\nIn total that’s 19 paying customers at 99 dollars per month.  \nThat’s 1,900 dollars in recurring revenue for 1,250 spent.  \nNot bad at all, and definitely something I’ll keep doing.\n\n**What I learned**\n\n\\- Negotiate hard. Prices can easily drop by two or three times if you push a bit.  \n\\- Avoid fake influencers. Many are just engagement groups.  \n\\- Make sure they reply to every comment with your link. If not, do it yourself.  \n\\- Always pay after posting, never before.\n\nI also tried boosting the posts with ads, but it didn’t make much difference.\n\nNext step is to find better influencers, scale the system, and maybe try TikTok next.  \nIf anyone’s interested, I can share the Notion template and DM scripts I used.\n\nIf you have any questions, feel free to ask !\n\nHere [are all the proofs](https://www.notion.so/Proof-of-influencer-campaign-29bb9abcbe3f80f8aefff2323103f3e4?source=copy_link) (influencer urls + posts)",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 63,
        "num_comments": 11,
        "created_utc": 1762549163.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1or644h/i_paid_5_influencers_on_linkedin_to_promote_my/",
        "fetched_at": "2025-11-08T00:54:01.763789"
      }
    ]
  }
}