{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-04T08:18:49.587518"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-04T08:18:41.134552"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-04T08:18:40.742199"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-04T08:18:40.742203"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-04T08:18:40.742182"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-04T08:18:41.134548"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-04T08:18:41.134558"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-04T08:18:41.134555"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-12-04T08:18:40.742210"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-04T08:18:41.134536"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-04T08:18:40.742206"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 491,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-04T08:18:48.586110"
      },
      {
        "id": "1pdax88",
        "title": "I caught an employee submitting fake expense reports",
        "selftext": "Last week I'm covering for our bookkeeper who's out on maternity leave and I'm going through expense reports from the last few months. I notice that one employee submitted the exact same Uber receipt twice (same ride and same amount 38 bucks) once in February and again in April. at first I figured it was just a mistake like maybe they just accidentally uploaded the same photo twice or something\n\nI then started actually looking at their other submissions and that's when I was able to figure it out. Personal grocery runs labeled as 'office supplies' dinner with their friends labeled as 'client meeting' and I'm pretty sure some of the receipt screenshots were edited because the fonts looked off and dates didn't line up with the transaction amounts\n\nI went back through about 6 months of their reports and conservatively they probably stole around $2500 (2544 bucks to be exact) from us. When I confronted them they got immediately defensive and tried to say it was \"unclear what counted as a business expense\" and then quit on the spot. Yes they quit on the spot  \n  \nYesterday I got paranoid cuz I started thinking of all the people that could have been doing this too and I just never noticed because I've never dealt with expenses  \nI don't want to become some paranoid micromanager who audits every coffee purchase but I also clearly can't just operate on the honor system anymore. I feel like I need some kind of actual system but I also don't know what's reasonable for a company our size (19 people and maybe 25 on January)",
        "subreddit": "smallbusiness",
        "author": "FarEntrepreneur5679",
        "score": 443,
        "num_comments": 162,
        "created_utc": 1764783748.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pdax88/i_caught_an_employee_submitting_fake_expense/",
        "fetched_at": "2025-12-04T08:18:46.634755"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 434,
        "num_comments": 124,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-04T08:18:48.586140"
      },
      {
        "id": "1pd04mg",
        "title": "I gave one enterprise client a 70% discount. 14 months later it cost me $61,200.",
        "selftext": "Last year, we were early, hungry, and terrified of running out of runway.\n\nThen a big enterprise prospect came along the kind of logo you put on your homepage in bold letters. Their budget was “tight,” so we offered them a massive discount:\n\n$1,500/month instead of our standard $5,000/month.  \n70% off.\n\nIt felt like a smart move at the time.\n\nLooking back 14 months later, it was probably the single most expensive decision we made.\n\nHere’s the math no founder wants to revisit:\n\n\n\nWhat we earned:\n\n$1,500 x 14 months = $21,000\n\nWhat the account actually cost us:\n\nAdditional dev work for custom integrations: \\~$28,000 worth of hours\n\nExtra support load (3x a normal customer): \\~$9,600 worth of time\n\nOn-site onboarding and compliance paperwork: \\~$4,600\n\nLost roadmap velocity from custom feature requests: easily $20,000+ opportunity cost\n\nTotal cost: \\~ $62,200  \nRevenue: $21,000  \nNet loss: \\~ $41,200\n\nAnd that’s not even counting the mental load.\n\n\n\nThe part that hurt the most?\n\nThey churned after 14 months because a new VP joined and wanted to “standardize tools.”\n\nNo amount of extra work mattered.  \nNo custom features mattered.  \nNo discounts mattered.\n\nWe were just another line item.\n\n\n\nWhat I learned (the expensive way):\n\n1. Discounted enterprise customers act like full-paying ones.\n\nThey still expect fast support, custom work, and every feature request taken seriously.\n\n2. Discounts don’t create loyalty.\n\nBudget changes, leadership changes, priorities change. The logo doesn’t care you “gave them a deal.”\n\n3. Never discount without removing scope.\n\nIf they want a lower price, reduce onboarding, integrations, seats, SLAs not your value.\n\n4. A single big, discounted customer can distort your entire roadmap.\n\nWe spent months building features only they wanted. No one else cared.\n\n5. Say no more often, even when the logo looks shiny.\n\nNot every deal is a win.  \nSome are dressed-up expenses.\n\n\n\nWould I take another 70%-discount enterprise deal?\n\nNot in a million years.\n\nIf you’re early-stage and tempted to slash pricing for a “big client,” run the actual numbers.\n\nIt may cost you far more than it makes.",
        "subreddit": "SaaS",
        "author": "Thick-Session7153",
        "score": 131,
        "num_comments": 37,
        "created_utc": 1764755529.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pd04mg/i_gave_one_enterprise_client_a_70_discount_14/",
        "fetched_at": "2025-12-04T08:18:43.541533"
      },
      {
        "id": "1pcypbr",
        "title": "Removed the \"Book a Demo\" button. Conversions went up 12%.",
        "selftext": "Had a standard SaaS funnel. Visit website, book demo, sales call, trial, purchase.\n\nProblem: 67% of booked demos never showed up. Of those who showed, 40% weren't qualified. Wasted 8-10 hours per week on calls that went nowhere.\n\nTried something counterintuitive. Removed the demo button. Made the product fully self-serve with a 14-day trial.\n\nEveryone said I was crazy. \"You need to talk to customers!\"\n\nResults after 60 days:\n\nTrial signups increased 34% (lower friction to start).\n\nTrial-to-paid conversion dropped from 18% to 14%.\n\nBut total paid customers increased 12% because way more people entered the funnel.\n\nRevenue per hour of my time: up 340%.\n\nThe customers who convert without a demo are actually better:\n\nLower support needs (they figured out the product themselves).\n\nHigher retention (they chose it, weren't sold it).\n\nFaster time-to-value (no waiting for a demo slot).\n\nI still do calls, but only after someone's been in a trial for 3+ days and asks a complex question. That's a qualified lead.\n\nFor deals over $500/month, I offer optional \"onboarding calls\" instead of sales demos. Same conversation, different positioning.\n\nDemo-first works for complex enterprise products. For SMB SaaS under $200/month? Just let people try it.\n\nWhat's your demo vs self-serve split?\n\n",
        "subreddit": "SaaS",
        "author": "SaaSSignal",
        "score": 112,
        "num_comments": 32,
        "created_utc": 1764749948.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pcypbr/removed_the_book_a_demo_button_conversions_went/",
        "fetched_at": "2025-12-04T08:18:43.541564"
      },
      {
        "id": "1pcklpz",
        "title": "2 VCs reached out after my OSS hit 1.8k stars in 53 days. never done this before - what should i actually prepare? “I will not promote”",
        "selftext": "building an ai coding tool. open source. bootstrapped.\n\nthe traction so far:\n\n- 1.8k github stars in 53 days\n- 35% week-over-week growth\n- all organic - reddit, dev communities, word of mouth\n\nnow 2 VCs want to talk. i’ve never raised before and tbh not even sure if it’s the right move.\n\nfor founders who’ve been through this:\n- what do they actually ask in first calls?\n- what catches first-timers off guard?\n- any red flags i should watch for?\n\ntrying to go in prepared even if i end up not raising.",
        "subreddit": "startups",
        "author": "MrCheeta",
        "score": 98,
        "num_comments": 66,
        "created_utc": 1764709761.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1pcklpz/2_vcs_reached_out_after_my_oss_hit_18k_stars_in/",
        "fetched_at": "2025-12-04T08:18:45.179156"
      },
      {
        "id": "1pcxy40",
        "title": "Building alone is underratedly painful nobody is prepared for the emotional side of entrepreneurship",
        "selftext": "Building alone is rough.\nNot because of the work but because of the stuff no one talks about. Like explaining your startup to friends and watching them look confused.\nLike working 10 hours straight and still feeling like you made zero progress. Like having no one to bounce ideas off, so you end up arguing with yourself.\n\nPeople think it’s freedom.\nMost days, it’s just you fighting your own brain and hoping you’re not wasting your time.",
        "subreddit": "Entrepreneur",
        "author": "One-Ice7086",
        "score": 85,
        "num_comments": 51,
        "created_utc": 1764747088.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pcxy40/building_alone_is_underratedly_painful_nobody_is/",
        "fetched_at": "2025-12-04T08:18:41.882686"
      },
      {
        "id": "1p0pead",
        "title": "Started in June and already have 2 clients",
        "selftext": "Maybe it’s not much but I feel like it’s a great success given that I started with no portfolio and no network a few months ago. \nI have to say I got lucky getting those clients, but I think everyone deserves some luck sometimes 😅\nAt the moment it’s not quite enough for feeding my family alone but I hope eventually I’ll be able to do so.\nI just wanted to share this with you guys as I am very happy and excited to be here. I never thought it was possible for me to start like that. I mean I was working in a company a year ago and now I’m doing my own thing. It’s exciting and I have already learned so much. \n\nWishing you all the best for your journey being or becoming a freelancer. \n",
        "subreddit": "freelance",
        "author": "BrogrammerAbroad",
        "score": 77,
        "num_comments": 53,
        "created_utc": 1763503301.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p0pead/started_in_june_and_already_have_2_clients/",
        "fetched_at": "2025-12-04T08:18:48.586167"
      },
      {
        "id": "1pd0wfq",
        "title": "I spent 2 years building a health-tech app. It failed. Here is the honest post-mortem",
        "selftext": "For two years, my startup was my life. We poured everything into a mobile app for diabetics.\n\nThe code was clean. The architecture was scalable. The mission was noble.\n\nAnd we failed.\n\nWe were a classic founding team: **3 Coders, 0 Marketers.** We spent nights debating tech stacks and zero minutes talking to customers. We fell into the \"Field of Dreams\" trap: *If we build it, they will come.* (They didn't).\n\nI wrote a full breakdown of the 10 reasons we shut down, but here are the 3 that hurt the most:\n\n**1. The \"Mansion\" MVP** We didn't build a Minimum Viable Product. We built a mansion. We developed for iOS AND Android simultaneously before we had a single user. *Lesson:* If you haven't validated the idea, build *one* feature on *one* platform.\n\n**2. The \"No Competition\" Trap** We did a competitor analysis and found nothing. We celebrated. In reality, an empty market is usually a red flag. It means there is no market. If a real problem exists, someone is usually already trying to solve it.\n\n**3. We Wasted Money on \"Pro\" Tools** We wanted to feel like a \"real company,\" so we burned cash on premium hosting, enterprise email, and legal structures before we had $1 in revenue. *Lesson:* You can run a startup for almost $0 these days. Don't scale your costs before you scale your revenue.\n\n**The Full Retrospective** I broke down the other 7 mistakes (including why \"Trying to change human behavior\" is a death sentence for apps) in the full post on My Blog\n\nHappy to answer questions about the shutdown process or the tech we wasted time on.",
        "subreddit": "Entrepreneur",
        "author": "Unboxth",
        "score": 74,
        "num_comments": 46,
        "created_utc": 1764758430.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pd0wfq/i_spent_2_years_building_a_healthtech_app_it/",
        "fetched_at": "2025-12-04T08:18:41.882655"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 64,
        "num_comments": 19,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2025-12-04T08:18:48.586133"
      }
    ]
  }
}