{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-08-31T08:13:56.107324"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-08-31T08:13:49.435152"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-08-31T08:13:49.435157"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-08-31T08:13:49.060305"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-08-31T08:13:49.060294"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-08-31T08:13:49.060282"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-08-31T08:13:49.435154"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-08-31T08:13:49.435155"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-08-31T08:13:49.060300"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-08-31T08:13:49.435141"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-08-31T08:13:49.060302"
      }
    ],
    "reddit": [
      {
        "id": "1n4a3wx",
        "title": "I scraped 25K comments to find which AI tools actually make people money or save time",
        "selftext": "My last post here about side hustles absolutely blew up and is the 2nd top post in r/entrepreneur this year! Thanks guys!!!\n\nAfter that post blew up, my DMs got flooded with questions specifically about making money with AI.\n\ngiven the interest, i scraped another 25K+ comments across social media to see which AI tools are actually making people money or saving time.\n\nThis time grok and gpt 5 deep research were used to analyze the data. Scraped from YouTube, Facebook Groups, Instagram, TikTok, X and Reddit.\n\nHere’s the list:\n\n1. Beautiful AI - make professional slideshows in just a few clicks. People report saving tons of time and there are even those who sell a service of redesigning ugly slideshows and are using this to do the work.\n\n2. Suno AI - make insane quality music in just seconds. People are making jingles for companies. Others are making songs, releasing them through DistroKid, then earning royalties from Spotify and streamers.\n\n3. Vubo AI - make viral worthy vertical videos in under a minute. People run faceless channels and earn through Adsense and sponsorships. Others use the video templates to make viral videos to promote their digital products or affiliate offers.\n\n4. Browse AI - scrape and monitor websites without coding. Marketers are using it to build lead lists, researchers are selling data reports, and ecom owners are tracking competitor pricing automatically.\n\n5. Chatbase - make a custom AI chatbot trained on your own data. Freelancers are selling “done-for-you” chatbots to businesses that want 24/7 customer support, while solopreneurs use it to have world class customer support and boost sales.\n\n6. Instantly AI - send high-converting cold email campaigns that land in the inbox with ease. Some people sell done-for-you outreach as a service or use cold email to sell affiliate offers or generate leads which they sell to businesses.\n\n7. OpusClip - cut long videos into shorts and easily add subtitles. People use this to turn podcasts or long form video into tons of TikToks, shorts and reels. Video editors also sell clipping as a service to influencers and businesses.\n\n8. Indexly AI - submits your new or updated pages to Google and Bing so they get indexed in hours instead of weeks. Bloggers and ecom stores use it to grab traffic fast, while SEO freelancers resell “rapid indexing” as a service.\n\n9. Fireflies AI - automatically record, transcribe, and summarize your meetings. People use it to create detailed call notes and many report it makes them way more efficient.\n\n10. TryAtria - get ad inspiration from 25m winning ads, write better ad copy, and see what’s working right now. People use this to research competitors and create ad campaigns that convert better.\n\n11. Higgsfield AI - turn photos into videos with cool video effects, generate ultra realistic people, make avatars that speak, and lots more. Basically a creative suite for marketers, creators and beyond.\n\n12. StealthGPT AI - write human copy that is undetectable as AI and sounds like you. Many people report using this on school assignments, at work, and even in copywriting for their business. Many mentions in recent months.\n\nim sure some are missing so feel free to share your own ways to save time or make money using AI. If you guys find this post useful I will post a follow up next month.",
        "subreddit": "Entrepreneur",
        "author": "HappyHippo95",
        "score": 572,
        "num_comments": 67,
        "created_utc": 1756581571.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n4a3wx/i_scraped_25k_comments_to_find_which_ai_tools/",
        "fetched_at": "2025-08-31T08:13:49.795161"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 440,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-08-31T08:13:55.105966"
      },
      {
        "id": "1l1vhwi",
        "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
        "selftext": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying, they stalled. Dismissed my emails. Tried to bully me into silence and extort my original working files with vehement refusal to pay my invoice. I was told I was grossly overcharging for my time and the work completed was not approved. They were trying to rewrite the narrative of this story to excuse the bad behaviour demonstrated at my expense. \n\nI filed a Small Claims Court case.\n\nAnd I want to say this — because I know a lot of women here will understand:\n\nWe get praised when we’re agreeable, fast, and “team players.”\nBut when we draw a line professionally, legally and with boundaries — suddenly we’re “hard to work with.”\n\nWell, I’ve stopped worrying about being palatable. And I know the calibre of my work is excellent. \n\nI’m not sharing this for revenge.\nI’m sharing it because:\n\n1) Too many professional women in freelance, contract or creative roles are exploited by disorganized and/or male-dominated team. \n\n2) We’re expected to deliver premium work — and in return get ghosted or gaslit.\n\n3) We’re supposed to be “grateful” instead of being compensated.\n\nNo more.\n\nDocument your work. Stand up for your rates. File when you have to.\nSilence is what they’re counting on. And it’s the one thing I’m no longer offering.\n\nI’m still in the middle of the claim process, but I already know I did the right thing. And I hope if someone here needs the push to do the same — you take this as your sign.\n\nYou and your work are worth so much more than you will be acknowledged for — or paid for. \n\n….\n\nQuick Update June 13th:\n\nClient still refused to pay … ( deflection then silence — even after being served! ) but using my work in a new paid social ad campaign. \n\nAs mentioned above, I filed a Small Claims Court case after a client refused to pay an invoice for creative direction, marketing plans, design and photography.\n\nToday, an ad came up in my feed. They’re running Facebook ads using my work — creative direction, photography and language/tone from the unpaid project. \n\nThey tried to condition payment on my handing over my working files, and now they’re commercially benefiting from the work while refusing to pay. It’s not right. \n\nAgain, If you’re doing creative, strategy, or freelance work: protect yourself. Keep records. Don’t assume good faith. And if it comes to it, use the legal system — it exists for this exact reason.\n\n",
        "subreddit": "freelance",
        "author": "TruthseekerTO",
        "score": 277,
        "num_comments": 112,
        "created_utc": 1748902750.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
        "fetched_at": "2025-08-31T08:13:55.106016"
      },
      {
        "id": "1n3jlls",
        "title": "How to respond to prospective customers who say you're \"too expensive\"?",
        "selftext": "I'm a personal chef, and it surprises me every time a prospective client reaches out and then says the cost is \"too expensive.\"  My pricing is listed on my website, and my $50/hour rate is on the lower end of what New York City-based personal chefs charge ($50-$75/hour). My hourly rate makes it possible for me to pay my bills, but I am by no means enjoying a luxurious life myself.  By contrast, my busy seasons make it possible for me to survive my slow seasons.\n\nWhen you have a potential client decline working with you and gripe about the price, how do you respond?  In the past, I've responded with grace, i.e. \"No worries, thanks for reaching out!\"\n\nBut these folks stick with me.  They're reaching out about a service that is, by its very nature, a luxury offering; the clients who have complained about my prices live in the most expensive New York City neighborhoods (West Village, Upper West Side, Chelsea, where a 2 bedroom will put you back $7,000/month or more). I've noticed a direct relationship between people who want all-organic ingredients or line-caught salmon, and then complain about my rates.\n\nI was thinking of saying, \"Thanks for letting me know.  My rate is competitive among New York City personal chefs, and makes it possible for me to live within delivering distance of my clients.\"  But I wonder if it's classier to not go there.\n\n",
        "subreddit": "smallbusiness",
        "author": "LizWins1818",
        "score": 256,
        "num_comments": 304,
        "created_utc": 1756502414.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1n3jlls/how_to_respond_to_prospective_customers_who_say/",
        "fetched_at": "2025-08-31T08:13:53.847668"
      },
      {
        "id": "1n40q8u",
        "title": "I've seen 1000+ product launches. Here's why most of them fail at getting customers.",
        "selftext": "Hey everyone,\n\nI'm Vincent, founder of Huzzler (a launch/community platform). Over the past few months, I've watched more than 1000 founders launch their products on my site.\n\nThere's a pattern I see over and over:\n\nMonth 1-6: Build incredible product  \nMonth 7: Launch to 12 users  \nMonth 8: \"Maybe I need more features?\"  \nMonth 12: Still struggling to get customers... -> panic\n\nThere's a common theme here. Almost everyone can build beautiful (and mostly effective) SaaS projects.\n\nThe mistake most founders make is thinking the building phase is the hardest part. It's not. Getting customers is.\n\nMost founders have no systematic approach of getting customers. They try random stuff, post around on product hunt, twitter but that's where they are wrong. Most B2B customers are not in the \"build in public\" or \"tech founders\" circles. They're employees at companies doing their jobs.\n\nSo I'm building  something called the \"Customer Engine\", a system that gives exact daily tasks for B2B SaaS founders to get their first customers. No more guessing what to do each day.\n\nInstead of: \"Should I cold email or try LinkedIn today?\". You get: \"Send 8 LinkedIn requests to marketing managers using template #3\". Plus a community where founders share what actually works (with real numbers). And the tasks are personalized to your buyer type and pricing model.\n\nWould love your thoughts on this. Would you use something like this? What would make this most valuable for you?\n\nWaitlist: [customerengine.co](http://customerengine.co)",
        "subreddit": "SaaS",
        "author": "apexwaldo",
        "score": 164,
        "num_comments": 18,
        "created_utc": 1756557911.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1n40q8u/ive_seen_1000_product_launches_heres_why_most_of/",
        "fetched_at": "2025-08-31T08:13:51.262460"
      },
      {
        "id": "1lf5yyo",
        "title": "I keep missing deadlines — it’s the 5th client now and I feel like I’m ruining everything",
        "selftext": "I'm a freelance video editor and I’ve been trying to make this work full-time, but I keep messing things up — and I’m not sure how to break the cycle.\n\nThis is now the 5th client where I missed a deadline. Most of them started as small projects (like $100–$200), but the work always expands — feedback turns into full rewrites, or I procrastinate too long, then rush, feel overwhelmed, and eventually miss the deadline entirely.\n\nLatest case: I delivered, then got feedback that completely changed the project. I got distracted, fell behind, and today the client told me that he will look another editor. So now I’ve lost two weeks and the project. No payment. No result. Just exhaustion and regret.\n\nI hate this pattern. It feels like I’m burning bridges one by one, and every time I tell myself \"next time I’ll be better,\" but then… same thing.\n\nI don’t think I’m lazy. When I do work, I can focus for hours and I really care about the quality. But it’s like the pressure builds up, and instead of acting, I freeze. Or waste time on YouTube, telling myself I’ll start soon — until it’s too late.\n\nHas anyone been through this? How do you break out of it?\nI don’t want to keep sabotaging the few chances I get.\nAny systems? Habits? Mindset shifts? I’m open to anything.",
        "subreddit": "freelance",
        "author": "Main_Software_6689",
        "score": 145,
        "num_comments": 172,
        "created_utc": 1750323165.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1lf5yyo/i_keep_missing_deadlines_its_the_5th_client_now/",
        "fetched_at": "2025-08-31T08:13:55.105999"
      },
      {
        "id": "1ld0uvj",
        "title": "How to keep clients and get referrals",
        "selftext": "Many freelancers struggle to keep clients and get referrals. There are four simple rules I adhere to:\n\n1. Always overdeliver. Never promise more than you can do, it's better to promise less and deliver more.\n2. Always be honest, never lie, even if you make a mistake. Admit it, that builds trust.\n3. Always be on time and never miss a deadline.\n4. Communicate early and often and keep clients updated on the project and progress. If they’re asking \"how is the project going?\" you’re already behind.\n\nOnce a client is happy with your work and trusts you, they'll likely be happy to refer you to others. That's the start of a snowball effect.\n\n",
        "subreddit": "freelance",
        "author": "krstak",
        "score": 103,
        "num_comments": 54,
        "created_utc": 1750098976.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ld0uvj/how_to_keep_clients_and_get_referrals/",
        "fetched_at": "2025-08-31T08:13:55.106003"
      },
      {
        "id": "1n4086d",
        "title": "Which is the best web hosting for a big websites?",
        "selftext": "So my friend wants to start an ecommerce business where he's gonna sell tshirts. He had a huge budget for meta ads and is expecting at least 100,000 people every month on the website. But he has no idea about web hosting at all. I told him that he can go with A2 hosting or digital ocean but then I am not sure. Although I found a website named hosting battle where they have a lot of web hosting services with detailed reviews but he doesn't know what kind of web hosting does he need. \n\nWhen I checked other brands, a lot of ecom brands are using shopify or wordpress woocommerce for their website. But I can't see what kind of hosting they're using lol.\n\nDo you think he needs a dedicated web hosting? Or something else?",
        "subreddit": "Entrepreneur",
        "author": "Reasonable-Egg6527",
        "score": 101,
        "num_comments": 23,
        "created_utc": 1756556429.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n4086d/which_is_the_best_web_hosting_for_a_big_websites/",
        "fetched_at": "2025-08-31T08:13:49.795172"
      },
      {
        "id": "1n45i8d",
        "title": "I scaled too fast and almost lost everything. Here’s what I’d do differently.",
        "selftext": "10 years ago, I thought scaling = success.\n\nThe faster you grow, the more “legit” you are, right? Turns out, scaling too fast nearly destroyed my business.\n\nHere’s the story:\n\nYear 1 → $85k revenue, \\~$15k profit.\n\nYear 2 → $450k revenue, \\~$90k profit.\n\nYear 3 → $1.1M revenue, but only \\~$50k profit (yes, profit went DOWN).\n\nWhat happened? I got greedy.\n\nI was so obsessed with growth that I reinvested everything into:\n\nMore SKUs (chasing trends instead of focusing on winners).\n\nBigger ad spend (burning cash on campaigns I didn’t fully understand).\n\nHiring too fast (without systems in place).\n\nBy the middle of Year 3, cash flow was a nightmare. I was paying suppliers late, juggling credit cards, and losing sleep every night. On paper I was “7 figures”. In reality, I was broke, stressed, and 2 bad months away from shutting down.\n\nThe turning point was humbling: I had to let 2 people go that I’d hired too soon. It sucked. But cutting back saved me. I re-focused on 2 core products, killed the distractions, and stabilized cash flow.\n\nLessons I wish I knew earlier:\n\n1 - Revenue is vanity, cash flow is sanity.\n\n2 - Don’t scale what’s broken. If your systems don’t work at $100k, they won’t magically work at $1M. \n\n3 - Hiring = overhead. Hire slow, systemize first.\n\n4 - Growth feels good, but survival feels better.\n\nLooking back, scaling slower would’ve made me more money and saved me a lot of stress.\n\nHas anyone here also scaled too fast and regretted it? Or do you think “grow fast or die” is still the best play?",
        "subreddit": "Entrepreneur",
        "author": "emojidomain",
        "score": 92,
        "num_comments": 24,
        "created_utc": 1756570264.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1n45i8d/i_scaled_too_fast_and_almost_lost_everything/",
        "fetched_at": "2025-08-31T08:13:49.795166"
      },
      {
        "id": "1mqv8ak",
        "title": "Just got hit with my first chargeback from a US client…what’s your strategy for this?",
        "selftext": "Hey folks,\n\nI’m pretty new to the freelance game (Indian doing video editing for overseas clients). I just had a US client file a chargeback after I had delivered everything - payment just got yanked back. 😩\n\nI’m shocked at how easy it was for them to do this.\n\nHow do you protect yourself from this kind of thing? Do you use contracts, milestone payments, special payment platforms, or just trust the client?\n\nAlso - is this common when working with international clients, or did I just get unlucky?\n\nWould really appreciate hearing your experiences - I’m trying to figure out if this is just part of the game or if I need to change how I operate. Is there any fixes for this? How long does filling a dispute request take? Do you guys often end up winning these disputes?",
        "subreddit": "freelance",
        "author": "ImmuneCoder",
        "score": 88,
        "num_comments": 57,
        "created_utc": 1755257784.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1mqv8ak/just_got_hit_with_my_first_chargeback_from_a_us/",
        "fetched_at": "2025-08-31T08:13:55.105983"
      }
    ]
  }
}