{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-04T00:59:15.695928"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-04T00:59:05.555009"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-04T00:59:05.246741"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-12-04T00:59:05.246743"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-12-04T00:59:05.246725"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-12-04T00:59:05.555006"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-12-04T00:59:05.555013"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-12-04T00:59:05.555011"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-12-04T00:59:05.246748"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-12-04T00:59:05.554994"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-12-04T00:59:05.246745"
      }
    ],
    "reddit": [
      {
        "id": "1pc5ix4",
        "title": "My friend got an ada demand letter and showed me the actual settlement agreement they wanted him to sign, this is insane!",
        "selftext": "My buddy runs a small shopify store, he got hit with an accessibility demand letter last month from some law firm. The initial demand was for $20k settlement plus legal fees, they sent over the actual settlement agreement template and the terms are wild beyond just the money.\nAgreement requires: bringing site into \"substantial compliance\" with wcag 2.2 level aa within the term of agreement, 24 month monitoring period where they can come back and check, if you breach any terms they can reopen the case, strict confidentiality clause so you can't even tell other business owners about the amount or terms.\nThe kicker is buried in section 4 about remediation, you have to make \"good faith efforts\" but there's no clear standard for what that means. So even after paying $20k+ and doing work, they could potentially argue you didn't try hard enough.\nI talked to a lawyer who said these agreements are designed to be vague so they can keep coming back, the confidentiality clause means most business owners can't even compare notes or warn each other.\nAnyone else seen agreements like this? Trying to figure out if these terms are standard or if this firm is extra aggressive.",
        "subreddit": "smallbusiness",
        "author": "Wtf_Sai_Official",
        "score": 1033,
        "num_comments": 295,
        "created_utc": 1764672930.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pc5ix4/my_friend_got_an_ada_demand_letter_and_showed_me/",
        "fetched_at": "2025-12-04T00:59:12.950159"
      },
      {
        "id": "1pcd2ka",
        "title": "Sold 340 lifetime deals for $149 each. 18 months later I regret every one.",
        "selftext": "Needed cash to fund development. Ran a lifetime deal on AppSumo. $149 for lifetime access to a product I was charging $39/month for.Sold 340 deals in 2 weeks. $50,660 in revenue. Felt like winning the lottery.18 months later, here's the math:If those 340 customers paid monthly at even 50% of normal price ($19.50), with average 14-month retention, that's $92,820 in revenue.I left $42,000 on the table. And counting, because lifetime means forever.But the money isn't the worst part.LTD customers are my highest-support users. They submit 3x more tickets than monthly subscribers. They request features constantly. They leave 1-star reviews when I don't build what they want.They have zero incentive to churn, so they stick around complaining instead of quietly leaving.My NPS among LTD customers: 12. Among monthly subscribers: 54.And I can never raise prices on them. They're grandfathered at $0/month for life.What I'd do differently:If you need cash, offer annual plans at a discount. You get money upfront but customers still renew.If you must do LTDs, cap the number ruthlessly. 50 max. Create scarcity.Never offer lifetime on a product that has ongoing server costs. You're signing up to lose money on every user forever.The AppSumo crowd isn't your target market. They're deal hunters who buy everything and use nothing. Not ideal customers for feedback or growth.Still digging out of this hole.Anyone else have LTD regrets?",
        "subreddit": "SaaS",
        "author": "Big_Currency_1805",
        "score": 840,
        "num_comments": 252,
        "created_utc": 1764693198.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pcd2ka/sold_340_lifetime_deals_for_149_each_18_months/",
        "fetched_at": "2025-12-04T00:59:09.680554"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 488,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-04T00:59:14.694532"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 436,
        "num_comments": 124,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-04T00:59:14.694555"
      },
      {
        "id": "1pdax88",
        "title": "I caught an employee submitting fake expense reports",
        "selftext": "Last week I'm covering for our bookkeeper who's out on maternity leave and I'm going through expense reports from the last few months. I notice that one employee submitted the exact same Uber receipt twice (same ride and same amount 38 bucks) once in February and again in April. at first I figured it was just a mistake like maybe they just accidentally uploaded the same photo twice or something\n\nI then started actually looking at their other submissions and that's when I was able to figure it out. Personal grocery runs labeled as 'office supplies' dinner with their friends labeled as 'client meeting' and I'm pretty sure some of the receipt screenshots were edited because the fonts looked off and dates didn't line up with the transaction amounts\n\nI went back through about 6 months of their reports and conservatively they probably stole around $2500 (2544 bucks to be exact) from us. When I confronted them they got immediately defensive and tried to say it was \"unclear what counted as a business expense\" and then quit on the spot. Yes they quit on the spot  \n  \nYesterday I got paranoid cuz I started thinking of all the people that could have been doing this too and I just never noticed because I've never dealt with expenses  \nI don't want to become some paranoid micromanager who audits every coffee purchase but I also clearly can't just operate on the honor system anymore. I feel like I need some kind of actual system but I also don't know what's reasonable for a company our size (19 people and maybe 25 on January)",
        "subreddit": "smallbusiness",
        "author": "FarEntrepreneur5679",
        "score": 344,
        "num_comments": 125,
        "created_utc": 1764783748.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pdax88/i_caught_an_employee_submitting_fake_expense/",
        "fetched_at": "2025-12-04T00:59:12.950139"
      },
      {
        "id": "1pcklpz",
        "title": "2 VCs reached out after my OSS hit 1.8k stars in 53 days. never done this before - what should i actually prepare? “I will not promote”",
        "selftext": "building an ai coding tool. open source. bootstrapped.\n\nthe traction so far:\n\n- 1.8k github stars in 53 days\n- 35% week-over-week growth\n- all organic - reddit, dev communities, word of mouth\n\nnow 2 VCs want to talk. i’ve never raised before and tbh not even sure if it’s the right move.\n\nfor founders who’ve been through this:\n- what do they actually ask in first calls?\n- what catches first-timers off guard?\n- any red flags i should watch for?\n\ntrying to go in prepared even if i end up not raising.",
        "subreddit": "startups",
        "author": "MrCheeta",
        "score": 96,
        "num_comments": 62,
        "created_utc": 1764709761.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1pcklpz/2_vcs_reached_out_after_my_oss_hit_18k_stars_in/",
        "fetched_at": "2025-12-04T00:59:11.322384"
      },
      {
        "id": "1pcypbr",
        "title": "Removed the \"Book a Demo\" button. Conversions went up 12%.",
        "selftext": "Had a standard SaaS funnel. Visit website, book demo, sales call, trial, purchase.\n\nProblem: 67% of booked demos never showed up. Of those who showed, 40% weren't qualified. Wasted 8-10 hours per week on calls that went nowhere.\n\nTried something counterintuitive. Removed the demo button. Made the product fully self-serve with a 14-day trial.\n\nEveryone said I was crazy. \"You need to talk to customers!\"\n\nResults after 60 days:\n\nTrial signups increased 34% (lower friction to start).\n\nTrial-to-paid conversion dropped from 18% to 14%.\n\nBut total paid customers increased 12% because way more people entered the funnel.\n\nRevenue per hour of my time: up 340%.\n\nThe customers who convert without a demo are actually better:\n\nLower support needs (they figured out the product themselves).\n\nHigher retention (they chose it, weren't sold it).\n\nFaster time-to-value (no waiting for a demo slot).\n\nI still do calls, but only after someone's been in a trial for 3+ days and asks a complex question. That's a qualified lead.\n\nFor deals over $500/month, I offer optional \"onboarding calls\" instead of sales demos. Same conversation, different positioning.\n\nDemo-first works for complex enterprise products. For SMB SaaS under $200/month? Just let people try it.\n\nWhat's your demo vs self-serve split?\n\n",
        "subreddit": "SaaS",
        "author": "SaaSSignal",
        "score": 86,
        "num_comments": 26,
        "created_utc": 1764749948.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pcypbr/removed_the_book_a_demo_button_conversions_went/",
        "fetched_at": "2025-12-04T00:59:09.680548"
      },
      {
        "id": "1pcn4em",
        "title": "Christmas bonus for small business with 2 employees and declining sales",
        "selftext": "Here's some info about the business: I own a small business with 2 employees. I give 5% guaranteed annual raises that kick in on January 1. I also provide a 401k match of up to 4%. In the past Christmas bonuses have been 1% of wages earned for the year.\n\nThe bad news is that gross sales are down about 11% this year. They were also down around 9% last year. I've absorbed the costs and have kept the increases and benefits. Not sure how much longer I can hold out. It's only for 2 employees though so I think I can continue with the above for another year.\n\nHow are other small business owners navigating bonuses/raises/benefits as your sales continue to decline?\n\n  \nEdit: \n\nJust to clarify, the employees have done everything asked of them. They show up, shut up, and keep up. They work hard and are reliable. They are professional and polite. Even though the business is going through a downturn I am having trouble with the idea of withholding something from them that they are not responsible for. I understand bonuses are performance based, but their performance hasn't diminished. It's just people out there are struggling. And for those that are telling me to focus on sales, I've definitely tried a few things this year. I switched to a new POS system that better tracks customer behavior and sends reminders for increased engagement. I've offered more sales. The employees have changed displays/endcaps every month as well as getting rid of slow moving SKUs and replacing them with new products. I have gone through every expense and tried to find a way to lower overhead costs. Sometimes the economy just sucks and the free market puts you in your place. So this is less about a \"bonus\" and more about being a \"gift.\"",
        "subreddit": "smallbusiness",
        "author": "Equivalent_Call7856",
        "score": 83,
        "num_comments": 91,
        "created_utc": 1764715624.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pcn4em/christmas_bonus_for_small_business_with_2/",
        "fetched_at": "2025-12-04T00:59:12.950172"
      },
      {
        "id": "1pd04mg",
        "title": "I gave one enterprise client a 70% discount. 14 months later it cost me $61,200.",
        "selftext": "Last year, we were early, hungry, and terrified of running out of runway.\n\nThen a big enterprise prospect came along the kind of logo you put on your homepage in bold letters. Their budget was “tight,” so we offered them a massive discount:\n\n$1,500/month instead of our standard $5,000/month.  \n70% off.\n\nIt felt like a smart move at the time.\n\nLooking back 14 months later, it was probably the single most expensive decision we made.\n\nHere’s the math no founder wants to revisit:\n\n\n\nWhat we earned:\n\n$1,500 x 14 months = $21,000\n\nWhat the account actually cost us:\n\nAdditional dev work for custom integrations: \\~$28,000 worth of hours\n\nExtra support load (3x a normal customer): \\~$9,600 worth of time\n\nOn-site onboarding and compliance paperwork: \\~$4,600\n\nLost roadmap velocity from custom feature requests: easily $20,000+ opportunity cost\n\nTotal cost: \\~ $62,200  \nRevenue: $21,000  \nNet loss: \\~ $41,200\n\nAnd that’s not even counting the mental load.\n\n\n\nThe part that hurt the most?\n\nThey churned after 14 months because a new VP joined and wanted to “standardize tools.”\n\nNo amount of extra work mattered.  \nNo custom features mattered.  \nNo discounts mattered.\n\nWe were just another line item.\n\n\n\nWhat I learned (the expensive way):\n\n1. Discounted enterprise customers act like full-paying ones.\n\nThey still expect fast support, custom work, and every feature request taken seriously.\n\n2. Discounts don’t create loyalty.\n\nBudget changes, leadership changes, priorities change. The logo doesn’t care you “gave them a deal.”\n\n3. Never discount without removing scope.\n\nIf they want a lower price, reduce onboarding, integrations, seats, SLAs not your value.\n\n4. A single big, discounted customer can distort your entire roadmap.\n\nWe spent months building features only they wanted. No one else cared.\n\n5. Say no more often, even when the logo looks shiny.\n\nNot every deal is a win.  \nSome are dressed-up expenses.\n\n\n\nWould I take another 70%-discount enterprise deal?\n\nNot in a million years.\n\nIf you’re early-stage and tempted to slash pricing for a “big client,” run the actual numbers.\n\nIt may cost you far more than it makes.",
        "subreddit": "SaaS",
        "author": "Thick-Session7153",
        "score": 80,
        "num_comments": 34,
        "created_utc": 1764755529.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pd04mg/i_gave_one_enterprise_client_a_70_discount_14/",
        "fetched_at": "2025-12-04T00:59:09.680542"
      },
      {
        "id": "1pcxy40",
        "title": "Building alone is underratedly painful nobody is prepared for the emotional side of entrepreneurship",
        "selftext": "Building alone is rough.\nNot because of the work but because of the stuff no one talks about. Like explaining your startup to friends and watching them look confused.\nLike working 10 hours straight and still feeling like you made zero progress. Like having no one to bounce ideas off, so you end up arguing with yourself.\n\nPeople think it’s freedom.\nMost days, it’s just you fighting your own brain and hoping you’re not wasting your time.",
        "subreddit": "Entrepreneur",
        "author": "One-Ice7086",
        "score": 76,
        "num_comments": 48,
        "created_utc": 1764747088.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pcxy40/building_alone_is_underratedly_painful_nobody_is/",
        "fetched_at": "2025-12-04T00:59:07.705676"
      }
    ]
  }
}