{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-14T16:15:27.292462"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-14T16:15:18.903796"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-14T16:15:18.553882"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-14T16:15:18.553838"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-14T16:15:18.553823"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-14T16:15:18.903793"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-14T16:15:18.903800"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-14T16:15:18.903798"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-14T16:15:18.553875"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-14T16:15:18.903781"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-14T16:15:18.553870"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 481,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-14T16:15:26.291117"
      },
      {
        "id": "1owaixm",
        "title": "Client lied about her financial situation, now I don't feel like honoring the price I quoted her.",
        "selftext": "On our initial call a new client told me that she was \"on a budget\" and receiving SS, so she couldn't afford to pay my normal rate, that she really needed to get this done and if I could please reduce my rate. I gave her about a 25% discount. She didn't know it at the time that she told all of that but I would have to look at her finances and when I did, I learned that she was lying. She had a significant amount in her savings, (we're talking very well into 6 figures) and now I don't want to honor my discount. TBH I probably will honor it though because at the end of the day, I will make more $ with any referrals that she gives. I just hate being taken advantage of and the way she did it (what she said) really stinks. ",
        "subreddit": "smallbusiness",
        "author": "zomanda",
        "score": 286,
        "num_comments": 148,
        "created_utc": 1763062283.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1owaixm/client_lied_about_her_financial_situation_now_i/",
        "fetched_at": "2025-11-14T16:15:24.302408"
      },
      {
        "id": "1owfk93",
        "title": "The best $100 I've ever spent",
        "selftext": "My partner and I run a small marketing agency. He does the client work but doesn't have much time for marketing himself, so I made a car sticker and had it printed at the UPS store for $50 each and put it on the side of our car. We needed some work done on the car and the owner of the repair shop saw the stickers and asked if we'd do a trade, website & some marketing in exchange for fixing the car 100%. It's such a small thing to get a car magnet, but now he's advocating for us and telling everyone about us and it's been a big boost, just because we did a good job for him and did what we said we would. Just wanted to share this story.",
        "subreddit": "smallbusiness",
        "author": "Background_Peach_162",
        "score": 271,
        "num_comments": 40,
        "created_utc": 1763074051.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1owfk93/the_best_100_ive_ever_spent/",
        "fetched_at": "2025-11-14T16:15:24.302402"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 187,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-14T16:15:26.291158"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 178,
        "num_comments": 34,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-14T16:15:26.291140"
      },
      {
        "id": "1ow647l",
        "title": "Forget unicorns. $10K MRR solo feels better than $2M seed and stress",
        "selftext": "I’m a solo founder, bootstrapped from day one with no investors or outside money, just shipping and learning as I go. My SaaS scrapes fresh, publicly available B2B leads from Instagram without needing logins, cookies, or any sketchy stuff. It’s a straightforward tool that solves a real problem and has brought in revenue since launch.\n\nThe more I build, the more I’m convinced micro SaaS beats chasing VC rounds, at least for me. I see so many stories of teams raising big money, burning through it, and then stressing to raise again. Meanwhile, I just talk to my users, fix what matters, ship quick updates, and grow at a comfortable pace.\n\nWith micro SaaS, getting to $5K to $20K MRR solo is real with high margins, freedom, and no pressure from investors or a big team. You don’t need a boardroom to make decisions, just a solid product and a handful of happy paying customers who give direct feedback.\n\nWould love to hear from other solo or small team founders. How’s your journey going? And if you’re still weighing startup versus micro SaaS, happy to share more behind the scenes if it helps.\n\nP.S. Thanks for all the questions and interest, seriously. If you’re curious, the tool’s IGScraping.com :)",
        "subreddit": "SaaS",
        "author": "AssignmentOne3608",
        "score": 166,
        "num_comments": 85,
        "created_utc": 1763052495.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ow647l/forget_unicorns_10k_mrr_solo_feels_better_than_2m/",
        "fetched_at": "2025-11-14T16:15:21.149190"
      },
      {
        "id": "1ow2ikp",
        "title": "The greatest wisdom my mentor shared, \"making money is hard\"",
        "selftext": "Honestly speaking, there is this strange belief among some entrepreneurs that they will have an idea and it will be successful, and they'll be rich. No, making money is hard. There is always a lot of work that needs to be done, it is time-consuming, it requires persistence, you will need to constantly think and make changes to your workflow, your product and how you communicate about it. It is something that every entrepreneur should be aware of, and go in with that mindset.",
        "subreddit": "Entrepreneur",
        "author": "sideprojectbecca",
        "score": 130,
        "num_comments": 67,
        "created_utc": 1763044163.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ow2ikp/the_greatest_wisdom_my_mentor_shared_making_money/",
        "fetched_at": "2025-11-14T16:15:19.595786"
      },
      {
        "id": "1ow7gr1",
        "title": "Ex-Client Is Threatening to Sue Me Over Failing Business, How Do I Tell Him To F*** Off?",
        "selftext": "So I had, or should I say, had a client who used to be a pretty nice guy, or at least I thought so until recently when he messaged me saying I was tampering with his business and how he can't think of any other reason his roofing company is now failing other than it being my fault and how I should expect a lawsuit or to hear from his lawyer in the near future.\n\nI haven't said anything back to him despite having a pre-F\\*\\*\\* off message in my drafts, but to give you some context, it wasn't always like this. I met him through FB when he messaged me after I posted some Google Business Results from another client of mine, and after some talking back and forth, he agreed he wanted to give it a go. Things were great, rankings were moving, client was very responsive. Essentially, everything I could ask for until eventually he decided to go against my word in favor of a buddy he knows. Whatever right it's his business, but this eventually became a constant theme and would leak over into our work. Before you know it, these \"Suggestions\" his buddy was making would move our rankings from number 2 in the map pack generating 50-60 calls a month down into the top 5 where calls were still good but nowhere near the same, and you could feel there was no bottom/end to this until eventually he fired me when I refused some of the vital changes he wanted.\n\nI didn't take it to heart, aside from the friend stuff he was a good guy so we parted ways but I guess things continued to drop in ranking once I left. Now fast forward to a few months out and I guess he's convinced himself that I'm doing voodoo black hat magic against his business. Like I said interesting scenario but I can asssure you I'm not tampering or doing anything and it actually pisses me off a little that he would assume that, considering my only goal in the first place was to help him out and I even gave that little rat a discount when he first signed. I'm a little heated but what do you think the best way to tell him to F\\*\\*\\* off is without escalating this any further?",
        "subreddit": "Entrepreneur",
        "author": "RankingGBPs",
        "score": 104,
        "num_comments": 68,
        "created_utc": 1763055489.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ow7gr1/exclient_is_threatening_to_sue_me_over_failing/",
        "fetched_at": "2025-11-14T16:15:19.595775"
      },
      {
        "id": "1ovjv2j",
        "title": "What on earth is YC doing? (I will not promote)",
        "selftext": "I might be late to the party, but I just saw a launch video posted by YC backing a brainrot coding editor.\n\nWhat is Garry Tan doing over there?\n\nThat investment feels almost intentionally provocative. Like optimizing for rage-farm engagement. \n\nI can already hear the usual line on posts like these:\n\n“BuT YC iNvEsTs In FoUnDeRs NoT IdEaS, bRo.”\n\nThe bar for their founders is actually relatively low. Also, at some point, “we invest in founders” has basically become a get out of jail free card for low bar picks. If you keep repeating that mantra while backing shallow products, it does say something about what your actual bar for founders is.\n\n  \nIt’s not crazy to assume that they’ve passed on founders building real, painful, unsexy problems so they could fund “look at this Chad programmer lol” type products instead.\n\nAt some point their batches stopped looking like “a few weird bets that might work” and now looks like they outsourced their decisions to a dice roll.\n\nSo I guess \"build something people want\" and \"solve a problem\" are just not a thing in this climate. What I'm curious about are the other sheep investors who may actually follow them in this trend.  \n",
        "subreddit": "startups",
        "author": "Worldly-Box6080",
        "score": 95,
        "num_comments": 30,
        "created_utc": 1762986929.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1ovjv2j/what_on_earth_is_yc_doing_i_will_not_promote/",
        "fetched_at": "2025-11-14T16:15:22.772730"
      },
      {
        "id": "1o40fm7",
        "title": "As someone who works from home, how do you socialise? or meet new people/make friends?",
        "selftext": "I am working from home, a 27F. Honestly it gets boring and i dont have any friends in here in my hometown. I have lived in hostel since 15 and hence havent made any friends here.\n\nMy hometown is also not a lively place with meetups or activities happening, so it just becomes difficult for me.\n\nAny other way to socialise? maybe any online ways? Please suggest.\n\nUpvote1Downvote1Go to comments  \n",
        "subreddit": "freelance",
        "author": "This-Brief6214",
        "score": 64,
        "num_comments": 64,
        "created_utc": 1760201179.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o40fm7/as_someone_who_works_from_home_how_do_you/",
        "fetched_at": "2025-11-14T16:15:26.291173"
      }
    ]
  }
}