{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-18T08:17:25.964864"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-18T08:17:17.131062"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-11-18T08:17:16.854753"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-18T08:17:16.854756"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-18T08:17:16.854733"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-18T08:17:17.131059"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-18T08:17:17.131067"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2025-11-18T08:17:17.131065"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-18T08:17:16.854765"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-18T08:17:17.131046"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-18T08:17:16.854760"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 479,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-18T08:17:24.963485"
      },
      {
        "id": "1ozeilq",
        "title": "The worst part of corporate life isn't the hours",
        "selftext": "I'm so exhausted from working this 9-to-5 job with incompetent people who bark orders without considering the whys or hows, just throwing around random demands to stroke their egos as supervisors and pretend they're being productive. \n\nTo me, this is by far the worst part of being a corporate slave. \n\nIt's not waking up every day to go to work, or even not having the financial situation I want. \n\nIt's working with clueless people who tell you to work in idiotic ways while thinking they're intellectually superior. It's incredibly frustrating.\n\nI'm trying to escape this situation by starting my own business. \n\nCould anyone who has successfully escaped the rat race tell us what freedom feels like? \n\nI need some motivating words.",
        "subreddit": "Entrepreneur",
        "author": "Salt-Sea-8685",
        "score": 268,
        "num_comments": 93,
        "created_utc": 1763381116.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ozeilq/the_worst_part_of_corporate_life_isnt_the_hours/",
        "fetched_at": "2025-11-18T08:17:17.836790"
      },
      {
        "id": "1ozbz28",
        "title": "What’s a service you happily pay for every month because it keeps your business running smoothly?",
        "selftext": "We always talk about the things we build or recommend, but what about the ones we personally rely on? Whether it’s a time-tracking app, a marketing agency, or an accounting platform. What’s that one service you’d never cancel in the near future because it makes your life easier?\n\nDrop your must-have services, let’s share the real game-changers for business owners.",
        "subreddit": "Entrepreneur",
        "author": "Activeshadough",
        "score": 193,
        "num_comments": 136,
        "created_utc": 1763371974.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ozbz28/whats_a_service_you_happily_pay_for_every_month/",
        "fetched_at": "2025-11-18T08:17:17.836795"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 184,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-18T08:17:24.963532"
      },
      {
        "id": "1ok0w2m",
        "title": "No notice, no talks, Just got email contract paused.",
        "selftext": "Hey, I was working with X, a US-based company.  \n  \nI worked there for around 5 months, and they recently (3 weeks ago) raised my pay without even asking because I was doing good work.  \n  \nI worked until the 28th; everything was going fine. On the 27th, something critical broke, and the person who was handling that was not available. Then I got to know from the manager that X no longer works with us, so please fix it. I got it fixed ASAP.  \n  \nAnd on the 28th, I just got this email, and all my accounts were disabled (or I can’t access them). There was no talk, no prior notice, or even a call to inform me about this.  \n  \nI asked in a follow-up email what went wrong, did I do something wrong, or what?  \nAnd I got a reply that I will be paid for my work and any outstanding balance.  \n  \nI’m wondering what went wrong. I’m sure I didn’t make any mistake or do something wrong.  \n  \nIs something going wrong in the USA that might have impacted this situation?  \n  \nIt didn’t say the contract is cancelled or terminated (it says it’s paused). What does that mean?",
        "subreddit": "freelance",
        "author": "Shuict",
        "score": 178,
        "num_comments": 34,
        "created_utc": 1761833711.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ok0w2m/no_notice_no_talks_just_got_email_contract_paused/",
        "fetched_at": "2025-11-18T08:17:24.963513"
      },
      {
        "id": "1ozezyj",
        "title": "Tried a face search tool and it made me think about how SaaS products handle public data.",
        "selftext": "I was testing some AI based tools to learn how different SaaS products work with large public datasets, and one of the tools I tried was a face search engine called FaceSeek. I uploaded an old photo just to see how it behaved, and FaceSeek ended up showing a few images of me from accounts I honestly forgot ever existed.\n\nIt really made me think about how much public data a SaaS tool like FaceSeek has to work with and how much engineering goes into making the search fast, accurate and still respectful of privacy. It also reminded me that our old content stays discoverable online far longer than we expect.\n\nThis is not a promotion. It was just an interesting moment that made me appreciate how complicated data heavy SaaS products can be. I would love to hear if anyone here has worked on something similar or dealt with large scale indexing or matching systems.",
        "subreddit": "SaaS",
        "author": "mugiwaranogoffy",
        "score": 147,
        "num_comments": 12,
        "created_utc": 1763382594.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ozezyj/tried_a_face_search_tool_and_it_made_me_think/",
        "fetched_at": "2025-11-18T08:17:19.747473"
      },
      {
        "id": "1ozz17r",
        "title": "Unpopular opinion: Your beautiful website is costing you sales",
        "selftext": "I've been doing web design for small businesses for years and I thought it might be useful to share something because I keep seeing the same mistake over and over.\n\nBusiness owners spend thousands making their site look \"professional\" then wonder why nobody's calling. The problem is you're designing for other business owners, not your actual customers.\n\nHere's what I see constantly: Giant hero image with some stock photo of people way too happy about a laptop. Tagline like \"Your Trusted Partner in Excellence\" that tells me absolutely nothing. I have to scroll three times to figure out if you're a plumber or a marketing agency.\n\nOr fancy parallax effects and auto playing videos that look cool for 5 seconds until you realize the page takes forever to load on mobile. Your bounce rate is probably 80% and you can't figure out why.\n\nThe real problem I see is you're asking \"does this look professional?\" instead of \"will this help someone become my customer?\"\n\nWhat actually works is someone lands on your homepage and knows in 3 seconds what you do and why they should care. Not clever wordplay, just straight up \"We fix commercial HVAC in the GTA and show up within 2 hours.\"\n\nYour call to action button should be so obvious. Big, bright, impossible to miss. Not buried after your company manifesto.\n\nTry this: show your homepage to someone for 5 seconds. Ask them what you do and what they should do next. **If they can't answer both, your design is in the way.**\n\nA simple site that converts is worth infinitely more than a gorgeous site where the phone never rings.\n\nTLDR: If visitors can't figure out what you do and what to do next in 5 seconds, your pretty design is just expensive decoration.",
        "subreddit": "smallbusiness",
        "author": "ClevrSolutions",
        "score": 110,
        "num_comments": 47,
        "created_utc": 1763430045.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ozz17r/unpopular_opinion_your_beautiful_website_is/",
        "fetched_at": "2025-11-18T08:17:23.076908"
      },
      {
        "id": "1ozk2e6",
        "title": "You WILL Reach $20K MRR (If You Follow This Simple SaaS Routine)",
        "selftext": "Hey everyone, hope you’re doing great.\n\nToday I’ll show you exactly how you can reach $20K MRR for your SaaS just by structuring your acquisition properly.\n\nMost SaaS founders are like beginner chefs. They have all the ingredients like LinkedIn, Reddit, email, and YouTube, but no idea how to cook the dish. You already know LinkedIn is free, YouTube is free, and sending DMs costs almost nothing. But if you don’t know how to organize your day and what to do in what order, you’ll never get consistent signups or sales.\n\nHere’s how you can structure your days to drive traffic and sales. This is the same routine that brought me to over $20K MRR (twice)\n\nI use five main channels: LinkedIn outbound, cold email outbound, LinkedIn inbound, Reddit inbound, and YouTube inbound. Blog and affiliates can come later, but these five are the foundation.\n\nEvery morning starts with LinkedIn outbound. Once your profile is ready with a clear banner, headline, and offer, send around 25 to 30 targeted DMs. The secret is to avoid random scraped leads and only contact people in your niche who have shown intent or activity in the last 48 hours.\n\nFor example, if you sell a cold email tool, reach out to founders who recently liked or commented on posts about cold email. They already understand what you do and are much more likely to reply. At first, do it manually, then automate later. Always reply to your DMs from the day before.\n\nNext comes cold email outbound. We send around 3000 emails per day with proper deliverability. My daily process is simple: reply to yesterday’s emails, add new leads, and check or adjust campaigns. Find leads the same way as on LinkedIn by focusing on people who are already interested in your topic. When you do this, reply rates and meeting rates go up fast.\n\nOnce my outbound systems are running, I move to inbound. On LinkedIn, I post once per day. I create a resource or insight my audience really wants and tell people to comment if they’d like to get it. They comment, I DM them, we talk, and that’s how deals start. If you want to save time, find posts that already perform well, paste them into ChatGPT, explain your offer, and ask it to rewrite them for your niche. It’s the fastest way to publish content that gets attention.\n\nOn Reddit, I post every two or three days. I tell my story, share real experiences, and explain what worked for me. Authenticity always wins here and drives qualified traffic to your website.\n\nOnce a week, I focus on YouTube. I record five or six videos built around long-tail keywords. I don’t try to chase subscribers. Instead, I create videos for specific search terms that my ideal buyers are already looking for. Every video becomes a small inbound funnel that keeps bringing traffic over time.\n\nAfter that, there’s still product work, customer support, and everything else that keeps the business running. But this exact acquisition routine took me from zero to over $20K MRR in just a few months.\n\nIf you stick to it, you’ll start seeing results too.\n\nAnd if you want the full detailed free guide with templates and workflows on how to get to 20k MRR fast, [it's available here](https://www.notion.so/How-to-reach-10k-MRR-for-your-SAAS-286b9abcbe3f805fb469d503e584e172?source=copy_link). \n\nCheers !",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 98,
        "num_comments": 18,
        "created_utc": 1763395253.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ozk2e6/you_will_reach_20k_mrr_if_you_follow_this_simple/",
        "fetched_at": "2025-11-18T08:17:19.747463"
      },
      {
        "id": "1ozjkbc",
        "title": "People who own/manage retail sales, are returns killing you too?",
        "selftext": "Since the pandemic retail returns have almost tripled for all retailers/business, now at almost $1T.\n\nThe platform I sell on, eBay, has forced free returns for the auto parts category, which is what I do a lot of business in.\n\nThis is what has been annoying me:\n\n1. People don't seem to understand I do not have billions in capital like Walmart or Amazon to allow anyone to return anything for any reason. Even Amazon is cracking down on returns due to the increase cost/frequency of returns since the pandemic. \n\n2. Rather than looking up or checking with me if an item will fit their vehicle, they just assume it will since I have to offer returns. 3 returns in 1.5 months simply due this this. Personal accountability has gone out the window. \n\n3. I do get the option sometimes to deduct from their refund, especially if they sent it back used when it was sold as new, and anytime I do, they bitch and moan about how unfair I'm being. If I sold something and it did not end up working somehow, or arrive damaged, I'm not going to do that, but if you buy a brand new car part that you did not check to see if it would fit, and literally try to force it and then damage it, then that's on you.\n\nI've tried to explain to people I can't keep prices low and allow people to just return something all the time and the recuperation of funds has to come from somewhere, but they simply do not understand nor care. If all retail businesses doled out nearly $1T in refunds last year, where do you think that money is going to come from? YOU, in the form of higher prices. \n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n",
        "subreddit": "smallbusiness",
        "author": "ToshPointNo",
        "score": 76,
        "num_comments": 40,
        "created_utc": 1763394096.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ozjkbc/people_who_ownmanage_retail_sales_are_returns/",
        "fetched_at": "2025-11-18T08:17:23.076920"
      },
      {
        "id": "1ozrnc3",
        "title": "Canceled my $15K/year ZoomInfo subscription. Built my own for $50/month.",
        "selftext": "Been lurking here for a while, figured I'd share something that's been working for me.\n\nLast year I paid $14,997 for a ZoomInfo Business plan. Used it to find B2B leads for my consulting work (mostly targeting German companies - dentists, lawyers, small businesses).\n\nThe problem? Half the emails bounced. Customer support basically said \"yeah that happens.\" I was paying $1,250/month for a 50% accuracy rate. Insane.\n\nSo in February I got fed up and spent a weekend learning Python. Built a scraper that:\n- Finds .de domains in my target niches\n- Extracts emails from their contact pages (Impressum in Germany - legally required contact info)\n- Validates them before I even send an email\n\nRan it last month on ~2,500 dental practice websites:\n- Got 4,800+ emails \n- Bounce rate when I sent: 4.7% (vs the 50% I was getting before)\n- Cost: $43 in API fees + $12 AWS hosting\n\nI'm not trying to sell anything here. Just wanted to share because if you're paying for lead databases and getting garbage results like I was, you might want to look into building your own.\n\nHappy to answer questions if anyone's curious about the technical side.\n",
        "subreddit": "Entrepreneur",
        "author": "kellyjames436",
        "score": 57,
        "num_comments": 39,
        "created_utc": 1763411936.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ozrnc3/canceled_my_15kyear_zoominfo_subscription_built/",
        "fetched_at": "2025-11-18T08:17:17.836786"
      }
    ]
  }
}