{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-31T16:14:56.254947"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-10-31T16:14:46.570036"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-31T16:14:46.570038"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-10-31T16:14:46.241186"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-31T16:14:46.241179"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-31T16:14:46.241166"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-31T16:14:46.570032"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-10-31T16:14:46.570034"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-31T16:14:46.241183"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-31T16:14:46.570022"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-31T16:14:46.241181"
      }
    ],
    "reddit": [
      {
        "id": "1okg43z",
        "title": "My barber took my advice and now business has never been busier",
        "selftext": "My barber does a great job cutting hair, but like most barbershops, the prices are a bit steep these days ($30+, plus tip).\n\nPersonally, my hair grows very fast, so if I wanted to keep it clean, I would easily have to get my haircut at least once every two weeks or so. It also doesn't help that I don't have the greatest neckline (i.e. it looks messy once my hair starts to grow out). However, paying that much money just wasn't something I was willing to do so I would wait longer than I wanted to between cuts.\n\nMy barber mentioned to me that business wasn't doing well. This wasn't a surprise to me because his shop was rarely busy.\n\nI have no barbershop experience but I do enjoy thinking of ways to make businesses more efficient and profitable.\n\nI suggested that he try this: offer basic (not bad) haircuts that he could do quickly & efficiently, for a lower price. This would mean no skin fades and no use of scissors (I know this might sound crazy but a previous barber of mine only used clippers and it worked completely fine for my shorter hairstyle. He had longer clipper attachment guards so this isn't a matter of everyone getting a short buzzcut) because that also rules out longer hairstyles, etc.\n\nThere is a market out there for people like myself who are wanting basic haircuts and would get haircuts more frequently if the price was lower.\n\nHe took my advice and he has never been busier. There is almost always someone waiting in line for a haircut, and he has even implemented a numbering system. He charges $22 with no tip option. Although the price is lower, his chair almost always has someone in it and he gets through his haircuts much faster.\n\nSomething I want to stress again is that these are not bad haircuts. These are just simple (compared to some other haircuts out there) haircuts. Yes, I know cutting your hair at home is an option but that is irrelevant to this. There are many reason why someone may not want to cut their own hair, and also, some people do skin fades on themselves so a basic haircut does not automatically mean that someone can do it themselves.",
        "subreddit": "Entrepreneur",
        "author": "_H4L0",
        "score": 1354,
        "num_comments": 153,
        "created_utc": 1761869535.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1okg43z/my_barber_took_my_advice_and_now_business_has/",
        "fetched_at": "2025-10-31T16:14:47.575970"
      },
      {
        "id": "1ok5l33",
        "title": "The company I work at thinks they're a Fortune 500 company",
        "selftext": "I work at this startup where we have literally 12 employees including the founders. We do maybe 1.5m in revenue which is decent but like we are still small. Our CEO came from Oracle and he cannot stop acting like we're a Fortune 500 company. Every single decision is made through this lens of how his company had it like yes brother WE UNDERSTAND your last company had 40,000 EMPLOYEES.  \nWe now have a mandatory biweekly all hands meetings where he does a powerpoint presentation about KPIs and OKRs and stakeholder alignment. it lasts 90 minutes and there are 12 of us. We all sit in the same room every day. I KNOW what everyone is working on because I can literally turn around and ask them........\n\nThe worst part is this shit is so expensive and we're not even profitable yet. I'm not paying for any of this btw dont get me wrong but it feels so stupid to see where the company money is going to.  \nTelling my boss or any of the higher up guys something is stupid and I'll just risk getting fired but I'm seriously considering looking into other companies because I dont feel like we're going anywhere",
        "subreddit": "smallbusiness",
        "author": "Gold-Weight-7904",
        "score": 1004,
        "num_comments": 238,
        "created_utc": 1761844366.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ok5l33/the_company_i_work_at_thinks_theyre_a_fortune_500/",
        "fetched_at": "2025-10-31T16:14:52.909738"
      },
      {
        "id": "1ojqqgb",
        "title": "UPDATE: Raised rates 50% on nightmare client, went silence. Then this counter offer",
        "selftext": "Quick update to my previous posts about the nightmare client situation.\n\nContext: one client makes up $5k per month which is almost half of my revenue. They've been complete chaos, disorganized records, 2am receipt dumps, constant weekend emergencies. I posted asking if I should fire them and Reddit overwhelmingly said raise rates and set boundaries instead.\n\nI sent an email last week raising their rate from $5k to $7.5k per month and included an actual service framework with 10-day submission deadlines, rush fees for last-minute requests, communication hours Monday through Friday 9am-6pm only, and no more weekend work.\n\nThey went silence for a week. I was legitimately convinced they were ghosting me and started mentally preparing for losing half my income. Yesterday they called me and we had this tense 20 mins talk with lots of questions and pushback, but I honestly couldn't tell where it was heading.\n\nThis morning, I got their email response and I'm honestly conflicted about what to do. Screenshot attached.\n\nThey want to move forward but counter offer $7k per month instead of $7.5k. They're also pushing back on the timeline, saying they want to start with 7 business days deadlines instead of 10 and work up to it over the next quarter. And here's the one that's really bothering me, they accept the Monday-Friday 9-6 communication hours but want to discuss exceptions for quarterly filing periods where some weekend work might be necessary. They did acknowledge that they kinda expected this coming given how they've been operating, and they need 90 days to review how it's working. But I'm genuinely torn here.\n\nPart of me says take the deal because I won the principle, $7k is still a 40% increase, and some of their pushback seems reasonable for a transition period. Part of me says hold firm because I set $7.5k for a reason, that quarterly exception language feels like the exact slippery slope back to weekend chaos, and they're already negotiating boundaries before even accepting them. I'm leaning more towards the take the deal part.\n\nWhat do you guys think?\n\nhttps://preview.redd.it/57jxtujji6yf1.png?width=1600&format=png&auto=webp&s=deb53723b067c6ddadac9b593edf1b46a22dc38f\n\n",
        "subreddit": "Entrepreneur",
        "author": "Normal-Gear283",
        "score": 756,
        "num_comments": 231,
        "created_utc": 1761799572.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1ojqqgb/update_raised_rates_50_on_nightmare_client_went/",
        "fetched_at": "2025-10-31T16:14:47.575998"
      },
      {
        "id": "1ok1x0l",
        "title": "I'm 3 years old and just sold my SaaS for $1.2B (here's what I learned)",
        "selftext": "Hey everyone. Tommy here. I'm 3.\n\nFour days ago I was watching cocomelon on my iPad when YouTube autoplay threw on a Dan Martell video. Something about \"buy back your time\" resonated with me - mostly because nap time was cutting into my block-stacking sessions.\n\nDan said something like \"find a problem, build a solution, scale it.\" I looked around my daycare and noticed a clear market gap: nobody was monitoring the structural integrity of our block towers. Silent failures everywhere. Millions in imaginary revenue at risk.\n\nSo I opened up Bubble (my fine motor skills aren't great yet, but I can drag and drop). Built \"BlockGuard\" - real-time monitoring for block tower stability with AI-powered collapse predictions. Integrated Stripe because that's what Dan said to do.\n\nLaunched on Product Hunt Tuesday morning (right after Paw Patrol). By Wednesday we hit $30M MRR. Thursday morning a16z called during snack time and offered $1.2B. I accepted because I wanted to get back to my blocks.\n\n**Here's what I learned:**\n\n1. **Solve real problems** \\- Block tower collapses were costing my peers valuable play time\n2. **Move fast** \\- The window between breakfast and morning nap is shorter than you think\n3. **Charge what you're worth** \\- I initially priced at $0.50/month (one fruit snack). Raised to $99/month. Nobody blinked.\n4. **AI is a moat** \\- Used Claude API to predict collapses 30 seconds before they happened. Game changer.\n5. **Compete on speed** \\- While other kids were still learning ABCs, I was learning ARR\n6. **Know when to exit** \\- $1.2B lets me buy a lot of goldfish crackers\n\n**The boring stuff:**\n\n* Tech stack: Bubble + Supabase + Claude API (couldn't figure out AWS, I'm only 3)\n* Customer acquisition: Posted in r/blocks, got 47 beta users\n* First revenue: 6 hours after launch\n* Used [FailureFinder.com](http://FailureFinder.com) to monitor my Zapier automations because even at $30M MRR, broken workflows will kill you\n\n**What's next:** Honestly? Probably fingerpainting. I'm diversifying into physical art because that's what all the successful founders do after an exit.\n\nHappy to answer questions, but I've got a juice box calling my name.\n\n\\- Tommy, 3",
        "subreddit": "SaaS",
        "author": "multi_mind",
        "score": 581,
        "num_comments": 109,
        "created_utc": 1761836129.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ok1x0l/im_3_years_old_and_just_sold_my_saas_for_12b/",
        "fetched_at": "2025-10-31T16:14:49.449851"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 473,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-31T16:14:55.253559"
      },
      {
        "id": "1oj8z5y",
        "title": "Most startups don't need an ERP (I will not promote)",
        "selftext": "We're a series A company with about 45 people and doing around $4M ARR. Last year our CFO (who came from a big corp background) convinced everyone to implement ERP  \nI was sus from day one but got overruled because of reasons like we need to scale properly and  that we can't keep using spreadsheets and random tools forever which is fair but also we weren't exactly falling apart. Fast forward 8 months and we've spent probably 80k on implementation consultants, our finance team has been basically useless this entire time because they're drowning in configuration meetings, we STILL don't have it fully set up and half our team refuses to use it correctly because it's so goddamn complicated for basic tasks   \nIMO I think ERP only makes sense when you are a manufacturing company with complex supply chains and inventory and whatever but for a saas startup it's kinda useless. We're paying sales people buying software subscriptions and occasionally ordering laptops. Why do we need enterprise resource planning for that? The worst part is everyone's too proud to admit it was a mistake at this point and we're stuck with it. Our old setup of quickbooks was working fine idk why some people want to get stuff like this I think it's related to delusion and thinking you're a huge corp when you're actually not",
        "subreddit": "startups",
        "author": "WobblySynopsis",
        "score": 271,
        "num_comments": 67,
        "created_utc": 1761754829.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1oj8z5y/most_startups_dont_need_an_erp_i_will_not_promote/",
        "fetched_at": "2025-10-31T16:14:51.339173"
      },
      {
        "id": "1ok5ggb",
        "title": "Customer wants a refund after 5 years",
        "selftext": "I run a small business, and was contacted by a customer who purchased an item of jewellery 5 years ago. They contacted me to say the necklace was dirty/mouldy and they wanted a refund. I kindly instructed them on a cleaning method, but they refused this suggestion and once again demanded a refund. I then offered them a replacement at a reduced cost, and they have also refused this offer and demanded a refund and have started to threaten me. I am really taken back by this situation, especially as it has been 5 years since they purchased this item from me, and the item was quality checked before shipping.\n\nDo they have a claim for a full refund after the lengthy time period? Worth noting, they are in a different country- one outside the EU. Any advice would be helpful.",
        "subreddit": "smallbusiness",
        "author": "Wildflower_90",
        "score": 193,
        "num_comments": 111,
        "created_utc": 1761844070.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ok5ggb/customer_wants_a_refund_after_5_years/",
        "fetched_at": "2025-10-31T16:14:52.909749"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 185,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-31T16:14:55.253592"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 170,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-31T16:14:55.253621"
      },
      {
        "id": "1oku32r",
        "title": "Bought a café bar two months ago and all staff keep quitting — getting seriously burnt out",
        "selftext": "Hey guys,\nI bought a café bar about two months ago and honestly, it’s been chaos since day one. Within the first couple of weeks, all the staff (including both managers) left. I started hiring again and got a new manager, but every other week someone quits. It’s like a revolving door.\n\nBecause of that, a lot of our regulars have stopped coming — they don’t see the same faces or the same vibe anymore. I’ve been working long hours every single day just to keep things running, even though I’m paying my venue manager a solid wage. Now even he’s thinking about leaving and I’m completely drained.\n\nI pay everyone fairly (all legal rates, no dodgy stuff), but still can’t keep staff. Anyone been through this after buying a business? How did you get things back on track or rebuild a stable team?",
        "subreddit": "smallbusiness",
        "author": "No_Introduction_1095",
        "score": 142,
        "num_comments": 242,
        "created_utc": 1761915994.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oku32r/bought_a_café_bar_two_months_ago_and_all_staff/",
        "fetched_at": "2025-10-31T16:14:52.909735"
      }
    ]
  }
}