{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-22T00:57:47.350738"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-22T00:57:37.251590"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-22T00:57:37.251592"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2025-10-22T00:57:36.879395"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-22T00:57:36.879390"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-22T00:57:36.879377"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-22T00:57:37.251586"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-22T00:57:37.251588"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-22T00:57:36.879392"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-22T00:57:37.251576"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-22T00:57:36.879394"
      }
    ],
    "reddit": [
      {
        "id": "1obl6uj",
        "title": "Today’s massive outage proves one thing the internet is way too centralized",
        "selftext": "Watching half the internet break today was wild. It’s not even an ISP issue it’s backbone level. When one major CDN or DNS provider sneezes the whole web catches a cold.\n\nThis outage is a real time reminder of how dependent we are on a handful of infrastructure giants.\n\nIt’s not just streaming or social media even work tools APIs authentication and IoT devices go down like dominoes.\n\nDo you think decentralization or more regional fail safes could actually prevent this or are we just too far gone into cloud dependency?",
        "subreddit": "smallbusiness",
        "author": "Reasonable_Roof5940",
        "score": 493,
        "num_comments": 46,
        "created_utc": 1760972628.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1obl6uj/todays_massive_outage_proves_one_thing_the/",
        "fetched_at": "2025-10-22T00:57:44.191875"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 471,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-22T00:57:46.349260"
      },
      {
        "id": "1oc01qb",
        "title": "Everyone's trying to get rich with tiny saas wrappers. The real opportunity is boring RAG.",
        "selftext": "I've been building RAG systems for a year. Made about $50k from three companies.\n\nEveryone on Twitter and Reddit thinks they're going to get rich building a $29/mo saas wrapper. It's a lottery ticket. The real money is in the most boring, obvious problem: companies can't find shit in their own documents.\n\n**What I actually built**\n\nThis wasn't just slapping tools together. It's a production pipeline.\n\n**Ingestion:** Docs are corrupt, APIs fail. I used Temporal to manage the workflow; it handles retries so I don't have to.\n\n**Processing:** Fixed size chunking is garbage. It cuts sentences in half. I used zchunk (ZeroEntropy) to split docs semantically.\n\n**Indexing:** I indexed everything twice in Qdrant. First with zembed-1 (dense, for semantic meaning). Second with FastEmbed SPLADE (sparse, for keywords and acronyms like 'ISO-9001' that dense vectors miss). You need both.\n\n**Retrieval:** This is where demos fail. A query comes in. I hit both indexes, get a wide net of results (top 50). It's a messy list.\n\n**Reranking:** I feed that messy list + query into zerank-1 (ZeroEntropy). This is the most critical step. It re-sorts everything for actual relevance. This one step fixed \\~30% of my bad results.\n\n**Generation:** Only then do I take the new top 3-5 results and feed them to Gemini 2.5 Pro to write the answer with sources.\n\nThe value wasn't the LLM. It was the plumbing. Backend is FastAPI, frontend Next.js. Postgres just runs Temporal.\n\n**How I got clients**\n\nTo be honest, mine came mostly through personal connections. A friend in compliance was drowning in PDFs, I built them something for $8k, and it spread from there to a research company ($19k) and a logistics firm ($23k).\n\nBut the market is so huge, I'm sure you know someone in one of those industries I listed. Just dig. And if you really don't, just find the right person and email them directly. Forget Upwork. Or I am even sure that in this sub you're all better marketers than me. \n\n**The actual opportunity**\n\nEvery mid-size company has 10+ years of documents in SharePoint or network drives. Their search doesn't work. They are paying people high salaries to manually dig through files. You fix that, they pay $20k, $30k, $50k. Per project. It's a real business, not a side project.\n\n**Industries that actually pay**\n\n* Pharma (regulatory docs)\n* Manufacturing (specs, manuals)\n* Law firms (contracts, cases)\n* Logistics (supplier docs)\n* Energy (inspection reports)\n\nBasically anywhere people waste hours in PDFs.\n\n**How you can do the same**\n\nYou don't even need to be that technical. Go make a professional looking site. Pick one of those industries. Anywhere you have connections or understand the space a minimu,. Contact teams. Ask them how they find internal info. Show them the problem and how much time they're wasting. When they say yes, find a freelance developer  hand them this exact pipeline. You pay them $5k, you charge $30k. You manage the client, they build. Do that 3-4 times a month and you have a legit million dollar a year business. \n\n**Reality check**\n\nThis isn't sexy. You won't get hyped on Twitter for it. But companies will pay $20k+ for something that actually functions vs. another \"AI transformation initiative\" that goes nowhere. The stack is figured out. The sales cycle is short if you can demo a working system. Everyone is fighting for $29/mo subscribers on their tiny saas wrappers, while enterprises are sitting there with $50k checks ready for anyone who can solve this one, boring, high value problem. ",
        "subreddit": "SaaS",
        "author": "JaracoMan",
        "score": 341,
        "num_comments": 70,
        "created_utc": 1761010470.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1oc01qb/everyones_trying_to_get_rich_with_tiny_saas/",
        "fetched_at": "2025-10-22T00:57:40.131235"
      },
      {
        "id": "1oco86r",
        "title": "Finally bit the bullet and switched to appointment only after 3 years of walk ins destroying my schedule",
        "selftext": "I run a small alterations shop in Austin and honestly I dont know why I waited this long to do this. For three years I kept walk in hours because I thought thats what customers wanted and I was terrified of losing business.\n\nThe reality was way different tho. Id have people walk in right when Im in the middle of a hem on a wedding dress, or Id block out time to finish rush orders and then spend 45 minutes with someone who just wanted to ask if I could fix their jacket zipper (which I dont even do). My actual turnaround times were getting worse because I couldnt focus.\n\nI spent like two months researching what other alterations places were doing, talked to my regular customers, even checked polymarket to see what the recession odds were since I was worried people would stop spending on alterations if the economy tanked. But mostly I just tracked my own numbers for a month and realized that 60% of walk ins either didnt book anything or wanted services I dont offer.\n\nMade the switch to appointment only in September. Put up signs, updated my google business, sent emails to my regular clients. First week I was stressed as hell thinking my phone would stop ringing.\n\nOpposite happened. My schedule is actually FULLER now because people book in advance and I can plan my day properly. Im finishing work faster, taking on more jobs, and honestly my stress levels dropped like crazy. Plus the clients who book appointments tend to be more serious and respectful of my time.\n\nOnly downside is I do get the occasional person who shows up anyway and gets annoyed when I cant help them right then. But honestly thats on them for not reading the giant sign on my door lol\n\nIf youre on the fence about this just do it. Track your numbers first so you know what youre actually dealing with but dont wait as long as I did.",
        "subreddit": "smallbusiness",
        "author": "AntsyAdjustment",
        "score": 295,
        "num_comments": 25,
        "created_utc": 1761078848.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oco86r/finally_bit_the_bullet_and_switched_to/",
        "fetched_at": "2025-10-22T00:57:44.191852"
      },
      {
        "id": "1obyt73",
        "title": "What is the best website builder for a small business right now?",
        "selftext": "Setting up a site for a new business and looking at Squarespace, Wix, and Wordpress as main options. I want the site to look professional without spending tons of time on design, but I also care about SEO and site speed. I’ve tried Wix before but found it a bit limiting on customization. Is Squarespace better for long-term growth or does Wordpress still have the most flexibility? What is the best website builder for a small business if you care about both ease of use and future scalability?",
        "subreddit": "smallbusiness",
        "author": "Low-Tension7882",
        "score": 234,
        "num_comments": 86,
        "created_utc": 1761007059.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1obyt73/what_is_the_best_website_builder_for_a_small/",
        "fetched_at": "2025-10-22T00:57:44.191864"
      },
      {
        "id": "1occcsn",
        "title": "How I turned eBay flips into a $3k/month side hustle",
        "selftext": "I started messing with eBay just to test the waters where I bought some electronics like mac books or watches and trading cards to see what would sell. I didn’t have a plan just curiosity and a few late nights spent looking into multiple listings.  \n  \nI began to notice patterns. Certain categories like electronics and collectibles sold quicker and had better margins. I started tracking what sold best, improving my listing descriptions , and focusing more on things like PC laptops, video cards, and even men’s shoes.  \n  \nOnce I found what was working the income became steady. It now brings in around $3k a month which still amazes me considering how it all started. But everybody has to start somewhere I guerss.  \n  \nStill learning as I go but thought Id share it here to inspire others. For those who tried it which products or niches did better for yo??",
        "subreddit": "Entrepreneur",
        "author": "Altruistic_Wind9167",
        "score": 228,
        "num_comments": 88,
        "created_utc": 1761051756.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1occcsn/how_i_turned_ebay_flips_into_a_3kmonth_side_hustle/",
        "fetched_at": "2025-10-22T00:57:38.230567"
      },
      {
        "id": "1obo87z",
        "title": "Our best hire started with a fake case study",
        "selftext": "We’ve been working with this guy for months. Solid communication, clean delivery, zero drama. The kind of agency you barely even manage because stuff just gets done.\n\nThen last week on a random call he drops something wild. He says he wants to be straight with us. Turns out the original case study he sent in his pitch wasn’t real. The results, screenshots, even the dashboard video were made using a mock tool that copies real platform dashboards.\n\nHe said no one gave him a shot without proof so he faked it to get in the door. Then actually learned the skills for real after landing us. And honestly, he’s been better than most of the so-called verified experts we’ve paid before.\n\nHe showed us the site and honestly we couldn’t even tell the difference between the fake dashboard and a real one. Which is a bit scary if you think about it.\n\nIt’s weird realizing the thing that made us hire him was fake, but the outcome actually justified it. Would you trust someone after a confession like that?",
        "subreddit": "Entrepreneur",
        "author": "PresentHeroDictator",
        "score": 187,
        "num_comments": 71,
        "created_utc": 1760981220.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1obo87z/our_best_hire_started_with_a_fake_case_study/",
        "fetched_at": "2025-10-22T00:57:38.230611"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 177,
        "num_comments": 49,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-22T00:57:46.349309"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 166,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-22T00:57:46.349303"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 165,
        "num_comments": 119,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-22T00:57:46.349273"
      }
    ]
  }
}