{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-11-01T08:14:04.109252"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-11-01T08:13:55.959740"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-11-01T08:13:55.645152"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2025-11-01T08:13:55.959743"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-11-01T08:13:55.645140"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-11-01T08:13:55.959732"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2025-11-01T08:13:55.959736"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-11-01T08:13:55.645156"
      },
      {
        "videoId": "RoALb8jvjmI",
        "title": "Are You a SLOW Editor?! How to SPEED UP Your Workflow in Premiere Pro",
        "description": "This video is sponsored by Western Digital. Check out the WD BLUE SN550 NVMe SSD ▷ https://bit.ly/370zqAl MY ...",
        "channelTitle": "Lizzie Peirce",
        "publishedAt": "2021-02-11T15:37:59Z",
        "url": "https://www.youtube.com/watch?v=RoALb8jvjmI",
        "fetched_at": "2025-11-01T08:13:55.645160"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-11-01T08:13:55.959717"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-11-01T08:13:55.645154"
      }
    ],
    "reddit": [
      {
        "id": "1okg43z",
        "title": "My barber took my advice and now business has never been busier",
        "selftext": "My barber does a great job cutting hair, but like most barbershops, the prices are a bit steep these days ($30+, plus tip).\n\nPersonally, my hair grows very fast, so if I wanted to keep it clean, I would easily have to get my haircut at least once every two weeks or so. It also doesn't help that I don't have the greatest neckline (i.e. it looks messy once my hair starts to grow out). However, paying that much money just wasn't something I was willing to do so I would wait longer than I wanted to between cuts.\n\nMy barber mentioned to me that business wasn't doing well. This wasn't a surprise to me because his shop was rarely busy.\n\nI have no barbershop experience but I do enjoy thinking of ways to make businesses more efficient and profitable.\n\nI suggested that he try this: offer basic (not bad) haircuts that he could do quickly & efficiently, for a lower price. This would mean no skin fades and no use of scissors (I know this might sound crazy but a previous barber of mine only used clippers and it worked completely fine for my shorter hairstyle. He had longer clipper attachment guards so this isn't a matter of everyone getting a short buzzcut) because that also rules out longer hairstyles, etc.\n\nThere is a market out there for people like myself who are wanting basic haircuts and would get haircuts more frequently if the price was lower.\n\nHe took my advice and he has never been busier. There is almost always someone waiting in line for a haircut, and he has even implemented a numbering system. He charges $22 with no tip option. Although the price is lower, his chair almost always has someone in it and he gets through his haircuts much faster.\n\nSomething I want to stress again is that these are not bad haircuts. These are just simple (compared to some other haircuts out there) haircuts. Yes, I know cutting your hair at home is an option but that is irrelevant to this. There are many reason why someone may not want to cut their own hair, and also, some people do skin fades on themselves so a basic haircut does not automatically mean that someone can do it themselves.",
        "subreddit": "Entrepreneur",
        "author": "_H4L0",
        "score": 2298,
        "num_comments": 225,
        "created_utc": 1761869535.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1okg43z/my_barber_took_my_advice_and_now_business_has/",
        "fetched_at": "2025-11-01T08:13:56.612598"
      },
      {
        "id": "1ok5l33",
        "title": "The company I work at thinks they're a Fortune 500 company",
        "selftext": "I work at this startup where we have literally 12 employees including the founders. We do maybe 1.5m in revenue which is decent but like we are still small. Our CEO came from Oracle and he cannot stop acting like we're a Fortune 500 company. Every single decision is made through this lens of how his company had it like yes brother WE UNDERSTAND your last company had 40,000 EMPLOYEES.  \nWe now have a mandatory biweekly all hands meetings where he does a powerpoint presentation about KPIs and OKRs and stakeholder alignment. it lasts 90 minutes and there are 12 of us. We all sit in the same room every day. I KNOW what everyone is working on because I can literally turn around and ask them........\n\nThe worst part is this shit is so expensive and we're not even profitable yet. I'm not paying for any of this btw dont get me wrong but it feels so stupid to see where the company money is going to.  \nTelling my boss or any of the higher up guys something is stupid and I'll just risk getting fired but I'm seriously considering looking into other companies because I dont feel like we're going anywhere",
        "subreddit": "smallbusiness",
        "author": "Gold-Weight-7904",
        "score": 1079,
        "num_comments": 251,
        "created_utc": 1761844366.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ok5l33/the_company_i_work_at_thinks_theyre_a_fortune_500/",
        "fetched_at": "2025-11-01T08:14:01.325124"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 473,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-11-01T08:14:03.107863"
      },
      {
        "id": "1ol8edm",
        "title": "How are payment processors getting away with this??",
        "selftext": "For context, I'm in construction, so our margins are a little lower, but I've got to imagine that pretty much any business that isn't a fortune 500 company's gotta be feeling my pain here.  \n  \nJust ran the numbers on what payment processing fees actually cost us last year now that my accountant brought me a new one and I'm genuinely angry at myself for not doing this sooner.\n\nWe did $2.8M in revenue. Sounds great until you factor in our 8% net margin - that's about $224K profit before fees.\n\nBreakdown of what we paid:  \n\\- Card transaction fees: roughly $47K  \n\\- ACH transaction fees: roughly $23K  \n\\- Total: $70K gone\n\nThat's 31% of our profit taken. Nearly a third. On a good year.\n\nAnyone else feeling this pain? What has everyone here been using to actually get paid?",
        "subreddit": "smallbusiness",
        "author": "Mammoth-Touch-2502",
        "score": 208,
        "num_comments": 236,
        "created_utc": 1761950416.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ol8edm/how_are_payment_processors_getting_away_with_this/",
        "fetched_at": "2025-11-01T08:14:01.325094"
      },
      {
        "id": "1okmc97",
        "title": "Nobody talks about how lonely it actually is to build something from scratch",
        "selftext": "When I started my startup after dropping out at 17, I thought the hardest part would be product, fundraising, or getting users.  \nTurns out, it’s *none* of that. \n\nit’s waking up every day and convincing yourself you’re not crazy for believing this will work. Especially those nights!\n\nThere are days you feel unstoppable, and others where you question everything you’ve built.  \nNo one prepares you for the emotional rollercoaster of doing something that doesn’t have a clear path or validation yet.\n\nI lost touch with some friends.  \nI worked when everyone else is asleep.  \nAnd most people don’t really get what you’re trying to do.\n\nBut then, you have one good day, a user email, a small win, someone who believes. and suddenly it all feels worth it again. But It feels succes. ",
        "subreddit": "Entrepreneur",
        "author": "Dull-Drawer-5733",
        "score": 184,
        "num_comments": 59,
        "created_utc": 1761888422.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1okmc97/nobody_talks_about_how_lonely_it_actually_is_to/",
        "fetched_at": "2025-11-01T08:13:56.612618"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 183,
        "num_comments": 132,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-11-01T08:14:03.107895"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 170,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-11-01T08:14:03.107924"
      },
      {
        "id": "1ol35cs",
        "title": "Have you ever been burned giving someone in dire need of a job a chance?",
        "selftext": "I recently gave this young guy a chance. He was very eager and begging to get his foot in the industry. He looked decent on paper so I gave him and chance and hired him as a contractor him for a one off project. Today was his first day and was 40 mins late. WTF!!\n\nI hate to be someones dad or lecture him like a school principal but arriving late on the first day of ANYTHING is a terrible first impression. School, job, meeting, even first date just starts the entire experience on a bad note.\n\nI'm thinking about just cutting him loose after today. It might be a bit harsh but just showing up the first day 40 mins late after begging me for a shot gives me a gut feeling he's going to be a bigger headache than a diamond in the rough.\n\nHas anyone had a similar experience or got burned hiring an unproven person, family member, or person with a sob story?",
        "subreddit": "smallbusiness",
        "author": "ExcitingLandscape",
        "score": 130,
        "num_comments": 117,
        "created_utc": 1761937111.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ol35cs/have_you_ever_been_burned_giving_someone_in_dire/",
        "fetched_at": "2025-11-01T08:14:01.325096"
      },
      {
        "id": "1okwgf1",
        "title": "My mom saw the comments under our facebook ad and called me crying thinking I was running scams",
        "selftext": "My 68-year-old mom called me yesterday absolutely panicked. she saw our furniture store's FB ad and the comments were filled with 'SCAM COMPANY' and 'THEY STOLE MY MONEY' from obvious bot accounts\n\nshe was in tears thinking I'd become some kind of criminal. Took me 20 minutes to convince her it was all fake comments from scammers.\n\nthe messed up part? This happens every single day:\n\n* Real customers asking \"is this legit?\" because of the chaos\n* 10-15 spam comments on every $500 ad spend\n* facebook's reporting does absolutely nothing\n\nI'm not some tech genius - I sell couches and bookshelves. but now I’ve to explain to my elderly mother that yes, I'm still a legitimate business owner, and no, I'm not running Nigerian prince scams on the side\n\nAnyone else dealing with this insanity? how do you explain to non-tech people that your business isn't actually a criminal enterprise because fb won't clean up their platform?",
        "subreddit": "smallbusiness",
        "author": "Ducky005",
        "score": 105,
        "num_comments": 53,
        "created_utc": 1761921753.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1okwgf1/my_mom_saw_the_comments_under_our_facebook_ad_and/",
        "fetched_at": "2025-11-01T08:14:01.325104"
      },
      {
        "id": "1okq295",
        "title": "I've built a career on \"boring\" comparison sites for 10+ years. Here’s the model no one talks about.",
        "selftext": "Hey everyone,\n\nI’ve been a long-time lurker in communities like this and noticed something interesting. We talk a lot about SaaS, e-commerce, drop-shipping, and agencies. But a business model that has been my entire career for the last decade is almost never mentioned: **Comparison Websites.**\n\nI started as an employee at a large comparison site company, then launched my own successful one, and now I consult for others. I wanted to share a bit about this world because I genuinely believe it's one of the most solid online business models out there for solo founders or small teams.\n\nFull disclosure: this isn't \"easy money\" or a get-rich-quick scheme. It takes real work upfront. But if you crack the code, it's an incredibly rewarding and scalable business.\n\n**So, what the hell is a comparison site?**\n\nAt its core, you're a digital expert who helps people make better purchasing decisions.\n\nThink about any time you've had to buy something complex:\n\n* \"What's the best project management software for a small team?\"\n* \"Which VPN is the fastest for streaming?\"\n* \"What's the cheapest pet insurance for a bulldog?\"\n\nA good comparison site answers these questions clearly and objectively. You become the trusted advisor.\n\n**The Business Model in a Nutshell**\n\nIt’s a simple flywheel:\n\n1. **Pick a Playground (Niche):** You choose a specific category to become an expert in. This can be anything from software and finance to home goods or online courses.\n2. **Build Your \"Store\" (The Website):** This is your digital real estate. It's where you publish reviews, comparisons, and \"best of\" lists. The goal is to be genuinely helpful.\n3. **Get People in the Door (Traffic):** You attract people who are actively looking for answers, using creative traffic channels - SEO, PPC, social media (Facebook, Instagram, X, Reddit, and more). Some of these audiences come with strong purchase intent, while others require nurturing through content and trust before they convert.\n4. **Get Paid (Monetization):** When a visitor reads your content and decides to buy, they click a link on your site. That link takes them to the company's website (e.g., the software company, the insurance provider). You then get paid a commission for sending them that customer. This is usually done via affiliate marketing.\n\nThat's it. You are essentially a matchmaker between confused buyers and good companies.\n\n**Why is this a great model for founders?**\n\n* **You don't create a product.** No manufacturing, no coding a complex app.\n* **You don't handle inventory or customer service.** Your job ends when the user clicks your link.\n* **It's a sellable asset.** A profitable site is a digital property that can be sold for a significant multiple of its monthly profit.\n* **It can become semi-passive.** Once a page ranks well on Google, it can earn you money for months or years with minimal maintenance.\n\n**Now, for the reality check. What are the challenges?**\n\nThe biggest hurdle is patience. Sometimes things do click fast - a certain page takes off, a niche gets traction early, or traffic suddenly spikes. But more often, it takes experimentation and persistence: publishing more content, testing new angles, and trying different channels until you figure out what really works for your niche. You have to be willing to put in the work upfront without guaranteed results, and stay adaptable as you learn what moves the needle. Secondly, competition is real. Some niches are dominated by huge players, so you have to be strategic and find a unique angle or sub-niche to get your foot in the door. Finally, your content *must* be high quality. In a world of AI-generated noise, building trust and providing genuine value is the only way to win long-term.\n\nAgain, it takes time to build authority and traffic. But you're building a real, defensible asset.\n\nI just wanted to put this model on your radar because I haven't seen it discussed. Happy to answer any general questions about how the industry works.\n\nWhat do you all think? Has anyone else ever considered this path?\n\n",
        "subreddit": "Entrepreneur",
        "author": "Shtivi_AI",
        "score": 100,
        "num_comments": 47,
        "created_utc": 1761903384.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1okq295/ive_built_a_career_on_boring_comparison_sites_for/",
        "fetched_at": "2025-11-01T08:13:56.612609"
      }
    ]
  }
}