{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-19T16:12:36.788726"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-19T16:12:28.191210"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-19T16:12:28.191212"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-19T16:12:27.784852"
      },
      {
        "videoId": "OyRkDL6DkBY",
        "title": "3 step editing workflow",
        "description": "Video editing Adobe Premiere Pro DaVinci Resolve Tutorial.",
        "channelTitle": "RESO\\VED",
        "publishedAt": "2023-05-16T23:58:21Z",
        "url": "https://www.youtube.com/watch?v=OyRkDL6DkBY",
        "fetched_at": "2025-10-19T16:12:27.784860"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-19T16:12:27.784837"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-19T16:12:28.191206"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-19T16:12:28.191208"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-19T16:12:27.784854"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-19T16:12:28.191196"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2025-10-19T16:12:27.784856"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 466,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-19T16:12:35.787344"
      },
      {
        "id": "1oabnmd",
        "title": "I don’t want to build a unicorn. I want a boring, profitable business.",
        "selftext": "I’ve worked on high-growth startups, helped scale products, built funnels, launched campaigns; the whole growth-marketing playbook. But lately, I’ve been rethinking what I actually want.\n\nNot interested in billion-dollar valuations. Just want a calm, remote-friendly, $20k/month business solving a real (boring) problem.\n\nHere’s my criteria: \n•\tProfitable from month 3 \n•\tCan be run async, without meetings \n•\tHelps a niche audience who’s already paying for a solution \n•\tDoesn’t need a team bigger than 3 \n•\tProductized or repeatable, not custom consulting\n\nI’m currently exploring a few ideas in SaaS and services, but honestly I’d love to hear from others: Who else is building a “boring” business on purpose? What’s working for you? What’s your North Star?",
        "subreddit": "SaaS",
        "author": "mcwerleigh",
        "score": 214,
        "num_comments": 83,
        "created_utc": 1760832828.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1oabnmd/i_dont_want_to_build_a_unicorn_i_want_a_boring/",
        "fetched_at": "2025-10-19T16:12:30.559768"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 177,
        "num_comments": 49,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-19T16:12:35.787390"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 166,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-19T16:12:35.787385"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 128,
        "num_comments": 85,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-19T16:12:35.787355"
      },
      {
        "id": "1oag6hz",
        "title": "Creative Ways I’ve Bought Profitable Businesses with Limited Capital (2025)",
        "selftext": "\nWhen I first started buying companies, I didn’t have investors, fancy financing, or any kind of silver spoon. What I did have was time, curiosity, and a willingness to talk to business owners who wanted to retire. Over time I figured out that most people selling good companies don’t care about finding the highest bidder. They care about finding someone who will take care of what they built. That shift in thinking is what made everything possible.\n\nHere’s what I’ve learned from actually buying businesses with limited capital in 2025.\n\nI look for companies that are simple and steady. No hype. No startups(unless we think we can make something work with the existing owner staying on full time). I like plumbing, concrete, restoration, logistics, small manufacturing, marketing agencies with retainers, and local service companies that people rely on every week. They’re not glamorous, but they make consistent money and they’ve usually been run by the same person for twenty or thirty years. Those owners are tired. They want to slow down, but they also want to know their employees and customers will be taken care of.\n\nI build my own list. I pick an industry, use Google Maps, and write down every company that looks active. Then I just reach out. I’ll call or email the owner and say something like, “Hey, I’ve followed your business for a while and really respect what you’ve built. I own and operate a couple small companies and was wondering if you’ve ever thought about stepping back or bringing someone on to help with the next stage.” That’s it. No big sales pitch. Just a human conversation.\n\nMost people say no the first time and second time. Some never call back. But a few will talk. And those few conversations are where all the good deals come from. I keep track of everyone I contact and follow up every few months. Timing is everything.\n\nOnce a conversation turns serious, structure matters more than anything. I’ve used seller financing in nearly every deal I’ve done. One deal went like this: $1 million purchase price, $100k down, $500k SBA loan, and the seller carried $400k at five percent interest for five years. They liked the idea of getting paid over time instead of walking away. It gave me enough breathing room to run the business right.\n\nIf I don’t have the down payment, I find a partner who’s comfortable lending it in exchange for interest or a small profit share. I keep control by structuring it as a loan, not equity. That kind of creativity gets deals done without losing ownership. That said I always want an active partner. No passive guys - not worth the headache. \n\nI always talk to banks before I need them. I’ll call local SBA lenders and ask what they like to see from borrowers. They’ll tell you exactly how they think. That’s free education. When you finally bring them a real opportunity, you already know how to package it so they can say yes. Also keep in mind some of the local banks aren’t really SBA. \n\nDue diligence is where most buyers get lazy. I don’t. I ask for tax returns, bank statements, vendor lists, customer breakdowns, and payroll reports. I compare deposits to income. I verify that employees are real and staying on. I want no surprises after closing.\n\nWhen I negotiate, I care more about structure than price. I’ll ask for a few months of interest-only payments or a transition period where the seller helps part-time. Those little details protect cash flow while you learn. Sellers usually say yes because it helps everyone succeed.\n\nIf you want to get started, here’s what I’d do right now.\n\nWeek 1: pick one or two industries you understand. Build a list of 25 businesses in your area.\nWeek 2: call or email 10 owners. Get two real conversations.\nWeek 3: ask one of them for basic financials. Build a rough deal model just to practice.\nWeek 4: talk to one SBA lender and ask what it would take to fund a deal like that.\n\nThen repeat the cycle every month. If you stay consistent for 90 days, you’ll have real leads, real numbers, and one or two sellers who are thinking about it.\n\nBuying a business with limited capital isn’t magic. It’s process, patience, and communication. The 2025 market is full of retiring owners who want someone capable to take over. If you can listen, plan, and follow through, you can become that person.\n\nIf anyone wants to talk through how to start, how to reach out to sellers, or what to look for in a deal, drop your questions. I’m happy to share what’s worked for me.\n\nDr Connor Robertson",
        "subreddit": "Entrepreneur",
        "author": "the_connor_robertson",
        "score": 115,
        "num_comments": 31,
        "created_utc": 1760846968.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oag6hz/creative_ways_ive_bought_profitable_businesses/",
        "fetched_at": "2025-10-19T16:12:28.880506"
      },
      {
        "id": "1oamsb8",
        "title": "MY past entrepreneur experience is hurting my job hunt process",
        "selftext": "Started 2 startups in my 20s  one failed, one got acquired. Then spent 5 years in a comfy corporate CX role that made me stagnant. Got fired this year and have been job hunting since.\n\nNow every time I mention my founder experience, interviewer are excited but they dont give me a shot. They see me as a flight risk , “or “too entrepreneurial' one CEO told me to follow my dreams....and start again bitch i need the salary to pay the bills\n\nI’m stuck between worlds too corporate for startups, too startup for corporates.\n\nHow do I frame my story so it sounds like maturity and range, not risk? Should I downplay the founder part or own it differently?",
        "subreddit": "Entrepreneur",
        "author": "RubInternational414",
        "score": 103,
        "num_comments": 68,
        "created_utc": 1760871648.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oamsb8/my_past_entrepreneur_experience_is_hurting_my_job/",
        "fetched_at": "2025-10-19T16:12:28.880498"
      },
      {
        "id": "1o9ystk",
        "title": "Joined a Series-A startup and it’s chaos. Should I quit or stay? ( I will not promote)",
        "selftext": "Hey folks,\n\nI joined a Series-A startup recently as a tech lead. On paper, the vision sounded amazing. It's  a super-flexible platform meant to work for any company, in any industry.\n\nThe pay is good and the people are nice. \n\nBut two weeks in, here’s what I’m seeing:\n\n1. Trying to do everything:\nThe founders want to build something that works for everyone, across every possible use case. There’s no clear niche or focus. Just “we’ll handle all kinds of clients.”\n\n\n2. Product constantly breaking:\nThey trying to bring all in one app. The system works with few demos, but when setup or real customer data is in progress, it breaks. Every new customer is unique in their requirements, and instead of saying no or prioritizing, the team feels compelled to make it bespoke which ruins other parts of the product.\n\n3. Fragile technical foundation:\nManagement is very non-technical. There's constant pressure from sales to \"just make it work.\" Many clients pay less than 1000 dollars but every single one demands high-touch service. (Its more VC money than customer revenue)\n\n4. Burnout and team fatigue:\nThere have already been some people who've left. The ones remaining all appear to be exhausted (and annoyed). Most dev work is outsourced to contractors and have 4 or 5 engineers in office. They are aggressively hiring without any plan. \n\n5. No actual forward progress:\nEvery week is a new fire drill. New clients come in, something breaks, quick fix, another feature breaks and it goes on. They rely on vibe code shortcuts and one-off hacks, so debugging and ownership are very difficult. \n\n\n\nI’ve been here barely two weeks, and people are already holding me accountable for issues that have existed for months.\n\nSo I’m wondering:\n\n1) Is this kind of chaos normal for a Series-A startup?\n\n2) Has anyone ever witnessed a horizontal \"serve-everyone\" product plan come to reality?\n\n3) If you were standing in my position, would you stick around to try to steer it or cut losses early before getting dragged down with it?\n\nWould really appreciate some honest thoughts from people who have been in this position.\n\n(I will not promote)\n",
        "subreddit": "startups",
        "author": "rg_cyborg77",
        "score": 99,
        "num_comments": 121,
        "created_utc": 1760801355.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1o9ystk/joined_a_seriesa_startup_and_its_chaos_should_i/",
        "fetched_at": "2025-10-19T16:12:32.294400"
      },
      {
        "id": "1oab64i",
        "title": "Why is it people think that if you interrupt my day with a unsolicited call..  &*#$&* me off 13 times this week. The 14 time you have a shot, that suddenly i'm on board.",
        "selftext": "Why. Why. Why. Why. Why. Why. Why  \nHow stupid can you be.\n\nI don't care what your marketing this or that told you.  \nThat idea is peek achievement b\\*\\*\\*shit.\n\nDoesn't happen. That's just nuts. Stop wasting your and my time doing it.\n\nWhy do people bother. I genuinely want to know.\n\nWhen I've block all your numbers.  \nKnow first hand.. All 9 of your \"BOBS\"  \nOutlines key volcanios that I think would look good under you.\n\nWhy.. For the love of god. Are people still calling me thinking.  \nYou know what.. He probably just needs to pray on this.\n\nOw I'm praying to a deity all right.. You haven't heard of this one though. He's a special contractor.",
        "subreddit": "smallbusiness",
        "author": "Comfortable_Swim_380",
        "score": 80,
        "num_comments": 46,
        "created_utc": 1760831427.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1oab64i/why_is_it_people_think_that_if_you_interrupt_my/",
        "fetched_at": "2025-10-19T16:12:33.746737"
      },
      {
        "id": "1oaoy2j",
        "title": "Just met with a 5-year old founder",
        "selftext": "Dropped out of kindergarten to move to SF\n\nYou may be shocked, but he is now building an AI startup\n\nTold me he gets fired up when his babysitter writes on board:  \n\"Let's get back to building\"\n\nIncredible",
        "subreddit": "Entrepreneur",
        "author": "Wild-Photo-717",
        "score": 73,
        "num_comments": 23,
        "created_utc": 1760878530.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1oaoy2j/just_met_with_a_5year_old_founder/",
        "fetched_at": "2025-10-19T16:12:28.880502"
      }
    ]
  }
}