{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-12-30T01:01:38.062560"
  },
  "data": {
    "youtube": [
      {
        "videoId": "xrX0l99LKAg",
        "title": "BOOKKEEPING BASICS for Small Business Owners: Do THIS Now!",
        "description": "Learn the bookkeeping basics for business owners and beginners. Get a Free Consultation: https://mycpacoach.com/contact/ QBO ...",
        "channelTitle": "Sherman - My CPA Coach",
        "publishedAt": "2025-10-27T21:59:32Z",
        "url": "https://www.youtube.com/watch?v=xrX0l99LKAg",
        "fetched_at": "2025-12-30T01:01:29.618114"
      },
      {
        "videoId": "24TFLVCceiQ",
        "title": "The Only BOOKKEEPING Tutorial You Need 2025 | For Beginners",
        "description": "Bookkeeping for beginners (2025) explained in under a minute, then a complete step-by-step tutorial. This is a 2 hour free course ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2025-10-02T18:18:19Z",
        "url": "https://www.youtube.com/watch?v=24TFLVCceiQ",
        "fetched_at": "2025-12-30T01:01:29.618093"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2025-12-30T01:01:29.618080"
      },
      {
        "videoId": "q_UPVaJL5WA",
        "title": "The Truth About STARTING a Bookkeeping Business in 2025",
        "description": "Ready to pick one niche, get unstuck and get clients to ogrow your business faster? Grab the Profit Booster 1000 Niches PDF + ...",
        "channelTitle": "The Bookkeeping Shop",
        "publishedAt": "2025-05-14T17:30:24Z",
        "url": "https://www.youtube.com/watch?v=q_UPVaJL5WA",
        "fetched_at": "2025-12-30T01:01:29.618102"
      },
      {
        "videoId": "JEAkQLMxqtw",
        "title": "How to Set Up Your Books as a New Business Owner",
        "description": "Bookkeeping doesn't have to be scary—and getting it right from day one can save you major headaches down the road. In this ...",
        "channelTitle": "Mark J Kohler",
        "publishedAt": "2025-04-29T21:54:58Z",
        "url": "https://www.youtube.com/watch?v=JEAkQLMxqtw",
        "fetched_at": "2025-12-30T01:01:29.618090"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-12-30T01:01:29.618077"
      },
      {
        "videoId": "0Uh4iBr6OLo",
        "title": "Xero vs QuickBooks 2025 | Clash of The Best Accounting Software for Small Biz",
        "description": "In this updated Xero vs QuickBooks comparative guide, my focus is to help you choose the right accounting software for your small ...",
        "channelTitle": "Stewart Gauld",
        "publishedAt": "2024-11-27T11:00:00Z",
        "url": "https://www.youtube.com/watch?v=0Uh4iBr6OLo",
        "fetched_at": "2025-12-30T01:01:29.618112"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-12-30T01:01:29.618088"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2025-12-30T01:01:29.242966"
      },
      {
        "videoId": "G4H-h2WI5fs",
        "title": "The 5 Best Accounting Software for Small Businesses",
        "description": "Discover the top 5 small business accounting software options for every budget and business type, including those with payroll ...",
        "channelTitle": "Merchant Maverick",
        "publishedAt": "2024-08-08T17:42:12Z",
        "url": "https://www.youtube.com/watch?v=G4H-h2WI5fs",
        "fetched_at": "2025-12-30T01:01:29.618109"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 486,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-12-30T01:01:37.061185"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 447,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2025-12-30T01:01:37.061233"
      },
      {
        "id": "1pybmle",
        "title": "Lost my company after 10 years. Client used our software for 3 years, refused to sign off, and the court sided with them. Is this normal in your country?",
        "selftext": "I’ve been an entrepreneur since 2014. In 2015, I started a software company with my college friends. Fast forward to 2025, and we are bankrupt.\n\nHere is the nightmare: A large State-Owned Enterprise (SOE) in China owes us a significant amount of money. They used the software we built for nearly 3 years. When they refused to pay the remaining balance, I took them to court in their local jurisdiction.\n\nI fought this legal battle for a year. Last week, the final verdict came out: I lost. The court dismissed my claims because the client never provided a formal \"Acceptance Certificate\" (a document required to prove the project is finished). Essentially, they used the software for years but refused to sign the paper saying it was \"done,\" so they didn't have to pay.\n\nNow I am buried in debt and feel completely hopeless. I’m angry and at a loss for words.\n\nI genuinely want to know: Does this happen in other countries? If a client uses your work for 2.5+ years but refuses to sign the acceptance paperwork, does the law let them get away with it? Where is the justice?",
        "subreddit": "smallbusiness",
        "author": "DevCargo",
        "score": 443,
        "num_comments": 235,
        "created_utc": 1766979779.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1pybmle/lost_my_company_after_10_years_client_used_our/",
        "fetched_at": "2025-12-30T01:01:35.227314"
      },
      {
        "id": "1py39uv",
        "title": "Competitor went out of business. Inherited 200+ of their customers. It wasn't the windfall I expected.",
        "selftext": "Got an email from a competitor saying they were shutting down. Included a message to their customers recommending us as an alternative. This was the dream right? Free customers. No acquisition cost. Just show up and collect.\n\nAbout 230 of them migrated over. Revenue jumped overnight. I was celebrating.\n\nThen the support tickets started.\n\nThese customers had been using a different product with different workflows. They didn't want to learn our way. They wanted us to work like the old thing worked. Every ticket was basically \"this isn't how I used to do it.\"\n\nFeature requests flooded in. Things the competitor had that we didn't. Things I'd never build because they didn't fit our vision. But these customers expected them. They'd paid for them before.\n\nThe churn started at month three. About 40% of them left within six months. They'd tried to make us work, couldn't adjust, and gave up.\n\nThe ones who stayed are actually good customers now. But the math wasn't what I thought.\n\nExpected: 230 new customers at $89/month = $20,470/month added\n\nReality: about 85 stayed long-term = $7,565/month added\n\nSupport cost during migration: probably ate half of that in the first year.\n\nStill a net positive. But not the windfall I expected. Inherited customers come with inherited expectations. And those expectations are expensive to disappoint or expensive to meet.\n\nFree customers aren't actually free.\n\nHas anyone else inherited customers from a dying competitor?",
        "subreddit": "SaaS",
        "author": "Crazy-Recording4800",
        "score": 223,
        "num_comments": 45,
        "created_utc": 1766957859.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1py39uv/competitor_went_out_of_business_inherited_200_of/",
        "fetched_at": "2025-12-30T01:01:32.044842"
      },
      {
        "id": "1pyqmp5",
        "title": "How to politely tell a client the project is actually finished when they keep coming back with quick requests?",
        "selftext": "Ive been freelancing as a web designer for about 2 years and I just finished a pretty big project for a client ,small ecommerce site, it took me like 6 weeks total. We had a clear contract, milestones, everything seemed professional. Delivered the final version three weeks ago, client approved everything, paid the final invoice. Since then ive gotten probably 8 emails asking for quick changes or one small adjustment that would only take a few minutes. First it was changing some button colors. Then it was adding a new section to the homepage. Then it was reworking the entire navigation menu because they had a better idea. Each time I politely remind them that the project is complete and any additional work would require a new contract or hourly rate. The thing is, these small changes add up. Ive probably spent another 4-5 hours total on these requests because I feel guilty saying no, but now im realizing im just working for free and setting a bad precedent. How do you guys handle this without damaging the relationship? I want to be firm but also don't want them leaving bad reviews or telling people I'm difficult to work with. Im also dealing with some annoying admin stuff right now since im based internationally and trying to get a proper commercial address sorted for my US business setup. Apparently its needed for some verification stuff. Anyway, any advice on the scope creep situation would be helpful cause im getting real tired of quick favors.",
        "subreddit": "Entrepreneur",
        "author": "Pale_Pipe9196",
        "score": 206,
        "num_comments": 61,
        "created_utc": 1767025544.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pyqmp5/how_to_politely_tell_a_client_the_project_is/",
        "fetched_at": "2025-12-30T01:01:30.370021"
      },
      {
        "id": "1pyh3px",
        "title": "Fired myself as CEO. Hired someone better. Best decision I ever made but my ego hated it.",
        "selftext": "Built this company from nothing for 5 years. Every customer, every feature, every decision was mine. I was the founder, the CEO, the identity of the thing.\n\nBut we hit a ceiling. Around $800K ARR I realized I was the bottleneck. Strategic thinking wasn't happening because I was buried in operations. Hiring was slow because I couldn't let go of anything. The team was frustrated because everything had to go through me.\n\nA advisor told me something that stung. \"You built a great product. You're not a great CEO. Those are different skills.\" He wasn't wrong.\n\nHired someone to be CEO. Someone with actual experience scaling companies. Someone who'd done the thing I was trying to figure out. Gave them real authority, not just a title.\n\nThe first few months were brutal on my ego. Watching someone else make decisions about my company. Disagreeing sometimes and not getting the final say. Feeling like a visitor in my own house.\n\nBut the results were undeniable. She restructured the team. Fixed processes I didn't know were broken. Made hires I wouldn't have made who turned out great. Revenue doubled in 18 months.\n\nI'm still involved. Focus on product now, which is what I actually love. The company is better because I got out of the way.\n\nFounder ego is real. The belief that because you created something, you should run it forever. But creation and operation are different skills. Being honest about that made everything better.\n\nHave you ever stepped back from a role you identified with?\n\n\n",
        "subreddit": "SaaS",
        "author": "Odd_Report6798",
        "score": 194,
        "num_comments": 38,
        "created_utc": 1766997384.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1pyh3px/fired_myself_as_ceo_hired_someone_better_best/",
        "fetched_at": "2025-12-30T01:01:32.044831"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 161,
        "num_comments": 42,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2025-12-30T01:01:37.061211"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 152,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2025-12-30T01:01:37.061209"
      },
      {
        "id": "1pylg24",
        "title": "I've seen hundreds of pitch decks this year and here is my learnings (I will not promote):",
        "selftext": "(I will not promote)\n\nI've seen hundreds of pitch decks, met dozens of founders in 2025, and made dozens of pitch decks. Talked to many investors and asked their insights about pitch decks for whole year. Here is what I learned this year:\n\n1. **The problem slide is where you win or lose.** If an investor doesn't lean forward on slide 2, the rest doesn't matter. Most founders bury their best insight on slide 8.\n2. **Founders who've experienced the problem they're solving tell better stories.** Personal connection > market research every single time.\n3. **The \"platform\" word is poison.** I removed it from at least 10 decks this year. Just tell me what the thing actually does.\n4. **Traction without context is useless.** \"10K users\" means nothing. \"10K users, 23% MoM growth, $47 average revenue per user\" means something.\n5. **Most market size slides are bullshit, and investors know it.** TAM/SAM/SOM with numbers pulled from Statista doesn't impress anyone. Show me YOUR math based on YOUR customer segments.\n6. **Financial projections are fiction, but they reveal how you think.** Show you understand unit economics and investors will forgive aggressive growth assumptions. Show hockey sticks with no underlying logic and investors will assume you don't know your business.\n7. **The team slide should answer \"why you, why now.\"** Your advisor's LinkedIn profile doesn't matter. Your 10 years solving this exact problem does.\n8. **Asking for money without showing what milestones is just amateur.** \"We need $2M for hiring and marketing\" isn't a plan. \"$2M gets us to $100K MRR and 18-month runway\" is.\n9. **Design matters less than founders think, but more than they act like it does.** Your deck doesn't need to be gorgeous, but it can't look like you don't give a shit.\n10. **Every deck should answer: what's the insight only you have?** If I could've thought of your idea without domain expertise, it's not compelling enough.\n11. **Slide count doesn't matter.** Based on my experience and Carta's insights, there's no correlation between slide number and fundraising success. If a slide is meaningful, keep it. If a slide is just \"nice to have,\" remove it.\n12. **Founders confuse features with benefits.** \"AI-powered matching algorithm\" doesn't mean shit to anyone. \"Cuts hiring time from 60 days to 12\" does.\n13. **The fundraising story matters as much as the business story.** Why this round, why this amount, why now etc. If you can't articulate it clearly, investors smell desperation.\n14. **The decks that got funded weren't perfect but they were clear.** Clarity beats cleverness every single time.\n15. **Nobody reads Slide 1 (Cover slide).** They glance at it for 3 seconds. If your tagline is a paragraph, you've already lost.\n16. **\"AI\" is a feature, not a business.** In Q1 2025, slapping \"AI\" on a slide worked. Now? It's noise. Tell me what problem you solve, not what tech stack you use.\n17. **The \"Conservative Estimate\" Lie.** We know your Year 5 projection of $100M ARR is fake. You know it's fake. Focus on how you get the first $1M instead of giving huge promises.\n18. **One idea per slide.** I see founders trying to cram the Problem, Solution, and Market Size onto one slide to \"save space.\" Don't. It looks like a random note.\n19. **Your TAM is wrong.** If you claim your Total Addressable Market is \"The Global Internet,\" you don't know who your customer is. Niche down.\n20. **Font size 10 is illegal.** If an investor has to squint to read your LTV/CAC ratio on a mobile screen, they're closing the file.\n21. **Bullet points are boring.** Use icons, use charts, use big numbers. Walls of text are for legal contracts, not pitch decks.\n22. **Stop using \"Uber for X.\"** It's almost 2026. Come up with your own category.\n23. **The Appendix is your best friend.** Keep the main deck short and tell your story clearly. Put the technical deep dives in the appendix.\n24. **PDF is the only format.** Don't send a Keynote. Don't send a PPT. Fonts break. Layouts shift. Send a PDF.\n25. **Your \"Exit Strategy\" is presumptuous.** You haven't sold one unit yet. Don't tell me about your IPO plans.\n26. **Data needs context.** Don't just show a graph going up. Label the axes. Explain the spike. Everybody love labeled axes.\n27. **Consistency signals competence.** If your headers jump around and your colors shift slightly, investors subconsciously think your code is messy too.\n28. **Frameworks kill the story.** Most founders try to use famous frameworks. But those frameworks push founders to be standard. Instead of this, create your own story.\n29. **Competition slide is your positioning.** Everybody knows you cannot compete with Google, Apple, OpenAI or other big corporates. But you really can focus a niche and grow in a vertical. You don't have to write a complex competition slide. X-Y landscape is great but you have to choose the right X and Y angles and be perfect on your niche.\n30. **Don't separate \"Why Now\" into its own slide.** Weave it naturally into your problem (it's urgent), market (it's shifting), and competition (giants are slow). When \"why now\" is isolated, it feels forced.\n\n**My predictions for 2026:**\n\n**AI will review your deck before humans do.** I've talked to investors and many of them are already using AI reviews, custom GPTs, Claude, Gemini on their emails. Your pitch deck isn't just for humans anymore. You need to explain your business to AI too. Find the balance: clear enough for AI to understand, compelling enough for humans to care.\n\n**Pre-seed rounds will get harder.** Building an MVP is easier than ever thanks to AI. So investors are asking for revenue or real traction even at pre-seed, and their bar will keep rising. My advice? Generate traction first, fundraise later -when it is possible of course. (And possible doesn't mean \"if you have money\", it means \"if it is possible as technical\")\n\n**Investor outreach will be noisier than ever.** Automation tools are everywhere now. Anyone can build a bulk email campaign to investors. Standing out will require actual creativity, not just another cold email template. The spray-and-pray approach is literally dead.",
        "subreddit": "startups",
        "author": "duygudulger",
        "score": 138,
        "num_comments": 41,
        "created_utc": 1767012479.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1pylg24/ive_seen_hundreds_of_pitch_decks_this_year_and/",
        "fetched_at": "2025-12-30T01:01:33.674185"
      },
      {
        "id": "1pych6j",
        "title": "AI is killing “how-to” work. The real job is picking “what to do” and “why”.",
        "selftext": "Unusual take I’m pressure-testing.\n\nAI is getting absurdly good at “how”. Write the code. Draft the email. Build the deck. Summarize the doc. Spin up the landing page.\n\nThat pushes the human bottleneck up a layer.\n\nThe leverage becomes:\n\n“What should we do next”.\n\n“Why does it matter”.\n\n“What are we trading off”.\n\n“How” is repeatable. That’s why models eat it.\n\n“What” is situational. It depends on constraints, incentives, timing, and taste.\n\n“Why” creates demand. It’s positioning. It’s the story the market buys.\n\nSo I don’t think jobs disappear overnight.\n\nThey get abstracted.\n\nLike calculators did not remove math. They shifted value from doing arithmetic to choosing the right equation.\n\nSame here.\n\nIf your work is mostly “hows”, your risk is high.\n\nIf you can consistently pick “what” with a clear “why”, you’ll use AI as leverage instead of competing with it.\n\nCurious where people disagree.\n\nWhat roles do you think stay “how-heavy” even with AI.",
        "subreddit": "Entrepreneur",
        "author": "Ill_Lavishness_4455",
        "score": 93,
        "num_comments": 43,
        "created_utc": 1766982241.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1pych6j/ai_is_killing_howto_work_the_real_job_is_picking/",
        "fetched_at": "2025-12-30T01:01:30.370036"
      }
    ]
  }
}