{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2025-10-27T08:17:52.867064"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2025-10-27T08:17:44.067508"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2025-10-27T08:17:44.067506"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2025-10-27T08:17:43.777046"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2025-10-27T08:17:43.777032"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2025-10-27T08:17:44.067480"
      },
      {
        "videoId": "yFJKQJJ0yMU",
        "title": "Small Business Accounting Explained in Four Minutes",
        "description": "Keeping track of your money is a vital component of your new business. Accounting sounds like a daunting term - and there is a ...",
        "channelTitle": "Xero Accounting Software",
        "publishedAt": "2021-12-19T21:02:27Z",
        "url": "https://www.youtube.com/watch?v=yFJKQJJ0yMU",
        "fetched_at": "2025-10-27T08:17:44.067504"
      },
      {
        "videoId": "R8yEvQ0lx-s",
        "title": "How To Edit YouTube Videos 10x Faster! - Productivity Hacks",
        "description": "Do you wish you could edit your YouTube videos faster? This video will teach you how with some tried and tested editing ...",
        "channelTitle": "Film Booth",
        "publishedAt": "2021-06-01T12:00:17Z",
        "url": "https://www.youtube.com/watch?v=R8yEvQ0lx-s",
        "fetched_at": "2025-10-27T08:17:43.777052"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2025-10-27T08:17:43.777055"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2025-10-27T08:17:43.777049"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2025-10-27T08:17:44.067471"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 476,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2025-10-27T08:17:51.865789"
      },
      {
        "id": "1ogq0vu",
        "title": "I wasted $50k because I thought the code was the expensive part.",
        "selftext": "Yeah, you read that right. We burned through an extra $50k not because our developers were slow, but because we were idiots about what an MVP actually costs.\n\nEveryone tells you to focus on the \"minimum\" and \"viable.\" What they don't tell you is that \"code\" is maybe half the battle. We obsessed over features and engineering timelines, and completely ignored the iceberg of costs lurking below the surface.\n\nOur first big punch to the gut? Legal. We launched our app, got a bit of traction, and then Apple rejected an update. Why? Our privacy policy and terms of service were garbage templates we pulled offline. That was a frantic two week scramble and a $5,000 bill from a lawyer we hadn't budgeted for.\n\nThen came the marketing \"budget.\" We figured the product was so good it would sell itself. Spoiler: it didn't. We had to spend thousands on ads just to get our first 100 users. Another unplanned expense.\n\nBut the real killer was support and operations. As soon as people started using the product, the bug reports and \"how do I do this\" emails flooded in. My cofounder and I were spending half our day answering support tickets instead of building the business. The \"viable\" part of our MVP was a joke because the user experience, including support, was terrible. We had to hire a part time support person way sooner than we planned.\n\nThis is the stuff the \"lean startup\" gurus conveniently forget to mention.\n\nAn MVP isn't just a piece of software. It’s a tiny, functioning business. And businesses have costs beyond the factory floor.\n\nSo here’s the rule we now live by at my agency: Take your most realistic, padded developer estimate. Then, add 50% on top of that for the \"everything else\" fund. This covers your legal setup, your initial marketing spend, your analytics tools, your server costs that will inevitably spike, and the cost of actually supporting your first users.\n\nAnd even that is before you add a 25% \"shit will hit the fan\" buffer. Because it always does.\n\nStop thinking of your MVP as a product launch. Start thinking of it as a business launch. The code is just the ticket to the game. Actually playing it is what costs you.\n\nWhat's the dumbest non code cost that almost sank your startup? Let's hear the war stories.",
        "subreddit": "SaaS",
        "author": "justdoitbro_",
        "score": 281,
        "num_comments": 102,
        "created_utc": 1761498625.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ogq0vu/i_wasted_50k_because_i_thought_the_code_was_the/",
        "fetched_at": "2025-10-27T08:17:46.693671"
      },
      {
        "id": "1ogwgng",
        "title": "My business partner keeps buying things without asking me",
        "selftext": "I started a small manufacturing business with my best friend from college close to two years ago. 50/50 partners. Everything was great until about six months ago or so.\n\nWe have a shared business account but we both also use our personal cards for business stuff pretty regularly cuz if you're at home depot or whatever it's very normal to use whatever card is in your wallet. The problem is that he's just TERRIBLE about telling me what he bought or sending receipts.\n\nLast month I'm going through our bank statements and I see all these random Venmo transactions I don't recognize at all. Turns out he's been paying contractors in cash and venmoing himself reimbursements without documenting anything. When I asked him about it he got defensive and said I should 'trust him' and that I should not worry about it which is fucking crazy because I don't have a single bill screenshot nothing to know what was paid\n\n We've been friends for 15 years but I also need to know where our money is going because I've worked so fucking hard for this business and I barely get 6 hours of sleep every SINGLE day (including weekends) for it to work. We're not a lemonade stand we have actual obligations and I'm pretty sure our accountant is going to murder us at tax time.\n\nThe worst incident was two weeks ago. He bought a 3.8k piece of equipment that we'd talked about but hadn't decided on yet. He just bought it. Using his personal card btw and he didn't mention it at all. I found out because the company that sold it called OUR business line asking about delivery and I had no idea what they were talking about and I had to play dumb on the phone\n\nWhen I confronted him he said he saw a good deal and didn't want to bother me and now I'm the asshole for being upset about an unauthorized 3.8k purchase? He says I'm being controlling and acting like his mom.\n\nI don't want to ruin our friendship but I also just can't run a business like this. Have any of you dealt with this? How do you set up financial boundaries with a business partner without making it weird?  \n  \nI'm sorry everyone for the long post but I'm not sure how to solve this and just keep the friendship at the same time",
        "subreddit": "smallbusiness",
        "author": "whopping_loathing",
        "score": 236,
        "num_comments": 101,
        "created_utc": 1761513970.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ogwgng/my_business_partner_keeps_buying_things_without/",
        "fetched_at": "2025-10-27T08:17:50.127674"
      },
      {
        "id": "1ogaagi",
        "title": "Ex girlfriend writing fake review on my google business page",
        "selftext": "just as the title states, my ex girlfriend is writing fake reviews on my google page because we broke up and I found another woman. in her google review she states that I gave her an STD and that I cheated on her with a prostitute... none of this is true or has anything to do with my business. How can I get this removed or should I sue for defamation of character?  ",
        "subreddit": "smallbusiness",
        "author": "SpirtualMar",
        "score": 218,
        "num_comments": 84,
        "created_utc": 1761448673.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ogaagi/ex_girlfriend_writing_fake_review_on_my_google/",
        "fetched_at": "2025-10-27T08:17:50.127694"
      },
      {
        "id": "1o8o545",
        "title": "Client said my rate is too high. Feeling embarrassed and down",
        "selftext": "So this company reached out to me about a freelance project. The interview rounds went well and they sent me all the project materials at the final interview and told me to look it over and send them an estimated price for the whole thing.\n\nTo be honest, I'm still pretty new to the whole freelancing thing so I don't really know how much I should be charging. I've worked as a full-time employee for most of my career so I do have a target salary in mind. I just don't know how that translates to a freelance rate. I looked up so many posts about figuring out my rate and I finally settled on something and let the company know. They said my rate was a lot higher than they expected so I asked them what their budget was. They dodged the question completely so I asked again and said I'm willing to discuss and adjust my rate to accommodate, but I think I'm being ghosted now. I'm kinda sad and slightly embarrassed about it because I really did want to work with them. Did I fuck up and ask for too much? \\~$2k for a 20+ page pitch deck.\n\nEdit to add more info: I'm an illustrator and designer. I draw and create all my design assets myself. 10 yrs of experience\n\nUpdate: They finally responded and said they were looking for something under $1k loll. I declined. For reference, when I was still finishing up college with 0 work experience and no degree yet, smaller companies were offering me $1200+ for similar amounts of work. I honestly don't know why I never specifically asked about the budget. Maybe because I liked this company and knew they paid their full-time employees well so I assumed they were familiar with fair freelance rates too. Oh well, I've learned what to do next time. Thanks for all the advice and encouragement! ",
        "subreddit": "freelance",
        "author": "strawberrymilkytea",
        "score": 179,
        "num_comments": 130,
        "created_utc": 1760664162.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1o8o545/client_said_my_rate_is_too_high_feeling/",
        "fetched_at": "2025-10-27T08:17:51.865805"
      },
      {
        "id": "1ngjxx0",
        "title": "Did I handle this situation appropriately? Regarding my payment",
        "selftext": "Took a small gig making a website, logo, and various other minor jobs. Finished within 2 months and then another 2 months making minor revisions to site. I went above and beyond what was in the scope of work simply because it's a small town and I didnt mind. \n\nAnyway. We wrapped everything up and it was time to pay. I sent the wrap-up email on Tuesday, August 14th. I did not hear from the client for SIX days. She responded to me on August 19th and paid me $750. She said that she'd pay me the remaining $500 on Monday, which would have been August 25th. \n\nWell, Monday came and went and I didn't hear from her. I am not starving so I gave her some extra time... I finally decided to reach out to her on Friday, September 5th, which is an additional 12 days of time that I gave her. She did not even respond to me but continued to actively promote her business on social media. \n\nI reached out to her again on September 14th after waiting another eight days. She messaged me back immediately this time except she didn't acknowledge her lack of communication or my request for payment and instead asked a technical question. I replied reiterating that I needed payment at this point. Screenshots are attached. My friend said I was rude but I don't feel like I was rude, just direct. I was more than patient with her while waiting for payment and the fact that she didn't even bother communicating with me after missing the payment date that SHE set really irked me. Did I handle this appropriately? Any advice for next time? \n\nThank you. ",
        "subreddit": "freelance",
        "author": "ChaosAnalyst",
        "score": 174,
        "num_comments": 50,
        "created_utc": 1757831586.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1ngjxx0/did_i_handle_this_situation_appropriately/",
        "fetched_at": "2025-10-27T08:17:51.865839"
      },
      {
        "id": "1nmvtmc",
        "title": "I have never felt this low in my life",
        "selftext": "Just trying to share my story and asking for suggestions.\n\nI'm working for a client for the last 3 months. I'm helping him with reputation management. Things were going well and I was sharing a worksheet where I used to update him with every work that I do on social platforms.\n\nAfter 2 months the client paused the contract saying he wants me to update about work everyday. He said he was suspicious of my work. I felt bad but I made sure to be as transparent as possible. I was updating the worksheet late like 2/3 days delays and I worked on it. Then he demanded me to update a worksheet daily.\n\nThen I continued doing the work and sharing and updating the worksheet. After 1 month he has paused my contract again and saying that he is suspicious and shit when I have shared all the work I have put in, in the worksheet. Every link, every detail possible.\n\nHe is saying that he wants work report now and I have not sent him but in reality he had asked for work sheet.\n\nHe shared with me a WhatsApp Message saying that he had asked me for a work report. The message is suspicious because I don't remember it and it shows that the message is edited.\n\nHe has paused my contract and he has to pay me too. I told him that i can give him a report and I'll submit the report with all the weeks progress but he is arrogant.\n\nI'm not liking the fact that he is treating me like a scammer but in reality I've helped him and I've got solid results. Ive almost completed 99% of work and it's all positive.\n\nI don't know how to deal with him!",
        "subreddit": "freelance",
        "author": "OppositeMany5978",
        "score": 166,
        "num_comments": 58,
        "created_utc": 1758470582.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1nmvtmc/i_have_never_felt_this_low_in_my_life/",
        "fetched_at": "2025-10-27T08:17:51.865834"
      },
      {
        "id": "1ogqm94",
        "title": "anyone else losing their mind over these new tariff changes??",
        "selftext": "honestly at this point i dont even know what im doing anymore... been in procurement for 6 years and these constant tariff updates are killing me\n\njust when i thought i had our china sourcing figured out, boom - another round of changes. now my boss is breathing down my neck asking about \"supply chain diversification\" and \"tariff mitigation strategies\" like i have some magic wand\n\nspent the last 3 weeks trying to find reliable suppliers in vietnam and mexico to reduce our china dependency. alibaba is a nightmare for this - half the \"verified\" suppliers dont even respond, and the ones that do are quoting 40% higher than our current partners\n\nworst part? i have to present a \"comprehensive sourcing strategy\" to leadership next week and honestly... i have no fucking clue what im doing. been using like 6 different tools just to track tariff codes, supplier locations, and cost comparisons. my excel sheets are a disaster\n\nmy company does consumer electronics (mostly phone accessories) and we're getting hit hard. our margins are already thin and now we're looking at potentially 25% additional costs on some products. we're a small business with only 12 employees - not like we have a huge procurement team to handle this\n\ntried reaching out to suppliers in thailand and india but the communication is terrible. spent 2 days just trying to get basic product specs from one factory in bangkok. meanwhile our competitors seem to have figured this out already and are undercutting us\n\nthe stress is killing me. my wife keeps asking why i'm up at 2am researching HS codes and supplier certifications. feels like every week there's a new compliance requirement or tariff update that throws everything off\n\nseriously considering if i should just find a new career at this point lol. anyone else dealing with this chaos? how are you managing the constant changes without losing your sanity? especially other small business owners who dont have massive procurement departments please share your secrets because im drowning here",
        "subreddit": "smallbusiness",
        "author": "TrueButterfly3908",
        "score": 161,
        "num_comments": 116,
        "created_utc": 1761500032.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1ogqm94/anyone_else_losing_their_mind_over_these_new/",
        "fetched_at": "2025-10-27T08:17:50.127677"
      },
      {
        "id": "1ogejl1",
        "title": "Your per-user pricing is killing your product.",
        "selftext": "I’ve been building MVPs for founders for many years now. I come in, build the core product, get it into the hands of the first users, and then I usually stick around to see what happens.\n\nAnd I see the same mistake, over and over, that quietly strangles promising products right after they start getting traction.\n\nIt’s the pricing. Specifically, the default, lazy decision to charge per user.\n\nHere's the pattern I see play out. I'll build a slick collaboration tool for a founder. They sell it to a company. A team of five starts using it, and they absolutely love it. The tool works so well that they become hyper-efficient and don't need to hire more people.\n\nFrom a product development standpoint, that's a massive win. I just built something that made a team better at their jobs. But for the founder? They just got punished for having a great product. The potential to grow that account is now capped.\n\nIt gets worse. The team's manager, the champion of my work, goes to another department and tells them they have to start using this tool. But the first question from the other department head is, \"What's the cost per seat?\" Adding another 15 users creates a budget discussion, and the idea dies right there.\n\nThe product I built is now stuck in a silo, all because the pricing model makes it hard to share. I've literally watched my work get quarantined inside a business because of a pricing decision made in the first month.\n\nLast year, I built a project management tool for a client. We launched it, and it was beautiful. So effective that teams using it were getting more done with fewer people. Six months later, the founder calls me, frustrated that revenue has completely flatlined.\n\nWe dug into the usage data together. The real value wasn't the number of people logging in. It was the number of active projects being managed.\n\nI spent a weekend rewriting the billing logic to be based on project volume, with unlimited users. It wasn't a huge technical challenge. But the business impact was immediate. Revenue jumped 40% in six months because the cost was now tied to the value they were getting. And since adding users was free, the tool spread like wildfire inside their customer accounts.\n\nI'm a developer. My job is to build things people want to use. It just feels fundamentally wrong to then implement a business model that punishes them for using it too much.\n\nMaybe I'm missing something, but why is per-user pricing still the default? Is it just the easiest thing to code? I’m curious what other devs and founders have seen work better.\n\nIf you are looking to get your perfect SaaS built. Hit me up!",
        "subreddit": "SaaS",
        "author": "Warm-Reaction-456",
        "score": 134,
        "num_comments": 32,
        "created_utc": 1761464088.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ogejl1/your_peruser_pricing_is_killing_your_product/",
        "fetched_at": "2025-10-27T08:17:46.693698"
      },
      {
        "id": "1ogi2c8",
        "title": "Annoying grey hat moron proves me my website needs captcha to protect my SaaS from himself",
        "selftext": "You know what’s funny? I’ve been running my SaaS for *years* without ever needing a CAPTCHA. Zero spam accounts. Zero bots. Everything was smooth. Then out of nowhere, this “grey hat” genius from Pakistan emails me like he’s doing me a favor:\n\n>“You should really add a CAPTCHA, I can create unlimited accounts.”\n\nCool story, bro. So I ignore it. I've seen hundreds of e-mails from these so called grey/whitehat hackers with basic reports from vulnerability scanner software trying to make a dime.\n\nThen guess what happens next?  \nHe proceeds to create **500** fake accounts *himself* to “prove” that I need a CAPTCHA.\n\nSo now I’m spending my day patching a problem that didn’t even exist until *this guy* decided to “help” by being the very thing he’s warning me about.\n\nAnd here’s the real kicker: after adding CAPTCHA, guess who’s the only one it actually stopped?  \nThat same self-righteous idiot.\n\nEvery other real user still signs up fine, no spam, no bots. So congratulations, Mr. Grey Hat the only person you successfully blocked from my SaaS is **you**.\n\nSo yeah, today’s lesson: sometimes your biggest security threat isn’t a hacker.  \nIt’s a *moron with and a Gmail account.*",
        "subreddit": "SaaS",
        "author": "freecodeio",
        "score": 104,
        "num_comments": 39,
        "created_utc": 1761477380.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1ogi2c8/annoying_grey_hat_moron_proves_me_my_website/",
        "fetched_at": "2025-10-27T08:17:46.693683"
      }
    ]
  }
}