{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-02-02T16:26:53.452752"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-02-02T16:26:44.186336"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-02-02T16:26:43.924881"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2026-02-02T16:26:43.924907"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2026-02-02T16:26:43.924900"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2026-02-02T16:26:44.186338"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2026-02-02T16:26:43.924896"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2026-02-02T16:26:44.186333"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2026-02-02T16:26:44.186340"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2026-02-02T16:26:44.186323"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2026-02-02T16:26:43.924904"
      }
    ],
    "reddit": [
      {
        "id": "1q6omig",
        "title": "Upwork newbie here, just ran straight-up malware from a “client” project. What the actual f***",
        "selftext": "Burner account because I’m beyond embarrassed and absolutely pissed.\n\nI’m new to Upwork. First “client” I get sends me a Next.js project and says “just run it locally and see if it works.”\n\nThey sent **malware**.\n\nAnd not sloppy malware. This was *deliberately hidden*.\n\nThey buried heavily obfuscated JavaScript **at the very bottom of** `nextjs.config.js`, AFTER `module.exports`, under a massive wall of blank lines so you wouldn’t even scroll there. Like, this was 100% intentional.\n\nOnce I actually de-obfuscated it, here’s what it was capable of:\n\n\\- Full file system access\n\n\\- Detecting the user’s home directory\n\n\\- Dynamically constructing file paths\n\n\\- Reading any file it had permission to read\n\n\\- Base64-encoding file contents (to hide what’s being sent)\n\n\\- Sending that data out via POST requests to remote servers\n\nTranslation: **if you ran it, assume your machine was compromised.**\n\nIf you are new here:\n\n* NEVER run client code blindly\n* Obfuscated JS = malicious. There is no legit reason for it here.\n* If a client says “just test it locally,” stop and think\n\n  \nI’m posting this out of pure rage because I don’t want another new dev to learn this lesson the hard way like I did.",
        "subreddit": "freelance",
        "author": "Jaded-Journalist2470",
        "score": 960,
        "num_comments": 86,
        "created_utc": 1767813175.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1q6omig/upwork_newbie_here_just_ran_straightup_malware/",
        "fetched_at": "2026-02-02T16:26:52.451429"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 496,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-02-02T16:26:52.451389"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 459,
        "num_comments": 135,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-02-02T16:26:52.451462"
      },
      {
        "id": "1qaobz3",
        "title": "I scraped 200k+ Reddit posts to find out the best way to get your first freelance client. Here is what I found:",
        "selftext": "Hi everyone,\n\nLike many of you, when I started looking for clients, I was overwhelmed by anecdotal advice: \"Just cold email,\" \"Use Upwork,\" \"Network in person.\" I wanted to know what actually works.\n\nSo, I built a scraper to analyze the archives of r/freelance, r/upwork, r/webdev, and several other freelance subreddits. I processed over 200,000 posts and comments, used AI to filter for relevant information, and normalized the data to find out exactly how people got their first client and how long it took.\n\nHere are the key findings from the data:\n\n* In-Person is King (Speed-wise): The median time to land a client via In-Person Cold Outreach was just 1.5 days. It seems the \"uncomfortable\" work of showing up physically builds trust faster than anything else.\n* The \"Cold\" Hierarchy: If you are doing cold outreach, the medium matters significantly: In-Person > Cold Calling > DMs > Cold Emailing. Cold emailing was the least effective and slowest of the direct methods in the dataset.\n* Free Work Works: Offering free work seems to be one of the fastest ways to convert to a paying client, likely because it removes the initial friction.\n\nOverall, the median time to find a first client was around 21 days, not bad at all!\n\nMethodology & Data Constraints:\n\nWhile this analysis provides valuable insights, it is important to acknowledge the constraints of the data:\n\n* Source Bias: Data is sourced from Reddit communities, which may skew towards specific types of freelancers and experiences.\n* Self-Reporting: Timelines are based on user recollection, which can be subjective.\n* Survivorship Bias: Successful freelancers are more likely to share their stories than those who did not find clients.\n* Sample Size: While 4,000+ leads were identified, only \\~1,000 contained explicit \"time to first client\" data.\n\nThe archives I processed were from 2024. I am currently processing 2025 data and adding more subreddits, which should double or triple the number of leads and provide more accurate results.\n\nFull data if you want to look at it yourself : [Google Sheets](https://docs.google.com/spreadsheets/d/1cLCiQWlPsE3TXA7QE8I-oXyvR7Y1wfUOvj1G8289RmI/edit?usp=sharing)\n\nI'm curious, does this match your experience? Did in-person outreach work faster for you than online methods?\n\n**EDIT:** Reverified some data today; the \"free work\" category had fewer datapoints than I thought, and the AI hallucinated a bit. Since it's \"free work,\" it didn't know whether it needed to find time until the first paying client or time until the first free client. I expect it to probably take a bit more time than 7 days and maybe **bring in** several clients at once.\n\nAlso tried to look if a lot of spam got through (i.e., people just creating posts to advertise a product) and honestly, not a lot; I only saw one so far.\n\n**->** Sadly, I can't update images. The conclusions still seem to be holding up at least—I hope it's not confirmation bias. I will let you know more for sure with the new data.",
        "subreddit": "freelance",
        "author": "Tryhard_314",
        "score": 216,
        "num_comments": 75,
        "created_utc": 1768201888.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qaobz3/i_scraped_200k_reddit_posts_to_find_out_the_best/",
        "fetched_at": "2026-02-02T16:26:52.451427"
      },
      {
        "id": "1qtb44u",
        "title": "90% of you are failing because you build B2C apps instead of boring B2B tools",
        "selftext": "I need to say this because I see this sub is filled with people crying about \"marketing is hard\" while trying to sell a $5 month habit tracker to broke college students XD\n\nI’ve built 30+ MVPs. The ones that have failed? Almost exclusively were B2C \"lifestyle\" apps. The ones making  $20k MRR right now? Boring, ugly B2B tools for unsexy industries.\n\nIf you are an indie hacker or a solo founder, B2C is a trap. You are playing the lottery. You need millions of users to make a living wage. You are competing with TikTok for attention.\n\nStop trying to be the next Zuckerberg. Be the guy who helps a plumbing company organize their invoices.\n\nHere is the \"Value\" part that most devs ignore:\n\n1. The \"Wallet Friction\" Reality\nI built a fitness app for a client once. Getting a consumer to pay $9.99 a month was like pulling teeth. They churned if the UI wasn't perfect.\nThen I built a crappy inventory management tool for a local warehouse. It looked like Windows 95. The owner paid $500 month without blinking. Why? **Because it saved him $2,000 month in lost stock.**\nBusinesses spend money to make money. Consumers spend money to be entertained (and they hate paying for it).\n\n2. You can't out design big tech\nIn B2C, your UI/UX has to be world-class. If your animation stutters, users leave.\nIn B2B, nobody cares. I have a client running a logistics SaaS where the main dashboard is literally a giant HTML table. No React, no Tailwind, just data. His users love it because it loads in 100ms and does the job.\nBoring problems = Lower technical bar = Faster MVP.\n\n3. Marketing is actually easier\nMarketing a consumer app means buying ads and praying for viral tweets.\nMarketing a B2B app? You find 50 plumbing companies on Google Maps and you email them. You can literally call your customers. Try calling your users for your \"AI dating coach.\"\n\nThe Actionable Advice:\nStop looking for ideas on ProductHunt. Go talk to your uncle who runs a roofing business. Go ask your dentist what software they hate.\n\nFind a business that is using Excel to manage a complex process. Build a SaaS that replaces that Excel sheet. Charge $100 month. You only need 80 customers to make six figures.\n\nOr keep building your \"Social Network for Gamers\" and wondering why you have 0 revenue.\n\nBoring pays the bills. \"Cool\" burns the runway.\n\nI have a couple of slots opening up next month for MVP builds. I’m not the cheapest option, but I’m the one you hire when you want it done right the first time. If you're serious about your project, DM me and let’s see if we’re a fit.",
        "subreddit": "SaaS",
        "author": "Warm-Reaction-456",
        "score": 197,
        "num_comments": 82,
        "created_utc": 1769980732.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1qtb44u/90_of_you_are_failing_because_you_build_b2c_apps/",
        "fetched_at": "2026-02-02T16:26:46.832828"
      },
      {
        "id": "1qswlea",
        "title": "California small business owners: heads up on Prop 65 + receipt paper",
        "selftext": "I just learned about this because my friend's restaurant got hit.  The \"customer\" sent the receipt to a lab for testing.\n\nThere’s a surge in **Prop 65 violation** notices and lawsuits targeting businesses that hand out paper receipts in CA. The trigger: Bisphenol S (BPS) was added to the Prop 65 list in Dec 2024, and even trace amounts in **thermal receipt paper** can now lead to liability.\n\nMany businesses don’t make or sell the paper—and some suppliers even claim it’s “BPS-free”—but plaintiffs are using more sensitive testing to find tiny amounts. There’s no safe harbor level yet, so even minimal BPS can trigger claims. **Penalties can be up to $2,500 per day per violation.**\n\nWhat to consider now:\n\n* Go paperless if you can\n* Switch to phenol-free receipt paper (**BPS and BPA** free) - I believe it has to be both but double check with your supplier.\n* Post a Prop 65 warning where receipts are issued (and on the receipt if possible)\n* If you get a notice, act immediately—there may be a short grace period if you fix it fast\n\nThis is hitting restaurants and retailers hard. Don’t ignore it.",
        "subreddit": "smallbusiness",
        "author": "CommercialJazzlike91",
        "score": 181,
        "num_comments": 73,
        "created_utc": 1769947035.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1qswlea/california_small_business_owners_heads_up_on_prop/",
        "fetched_at": "2026-02-02T16:26:50.422351"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 174,
        "num_comments": 51,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-02-02T16:26:52.451443"
      },
      {
        "id": "1qrsnuj",
        "title": "Newly hired VP at a 200+ person company… surprised by how unstructured the exec team is. Any advice? I will not promote.",
        "selftext": "Hey everyone,\n\nLooking for some honest perspective here.\n\nI recently joined a company of 200+ employees as a VP (strategy-focused role). The people are great, the values are strong, culture is good, and overall it feels like there’s a ton of potential.\n\nBut I’ve been kind of shocked by how the executive team actually operates day to day.\n\nMost of the leadership time seems to go into very operational stuff. Weekly meetings are basically project-by-project check-ins, super granular. Monthly meetings are mostly just reporting on last month’s results. Like…this meeting could have been an email kind of vibe. And in the last three months, I honestly haven’t seen a real strategic conversation… like working on the business instead of just in it.\n\nWhat also throws me off is how unprepared a lot of these meetings feel. No agenda, no pre-read, no notes, no follow-up. People show up and kind of wing it. It’s not toxic or anything, the vibe is friendly, but it feels… soft? Like this company could seriously level up if the exec layer was more structured and intentional.\n\nMy issue is: I’m new, and this isn’t technically “my job” to fix right now. I really don’t want to be the guy who walks in and starts criticizing everything or trying to change the culture overnight.\n\nBut at the same time, it feels like such a missed opportunity.\n\nSo I’m torn. Do I bring it up privately with the CEO? Do I just focus on modeling better structure in my own area first? Do I suggest an external consultant to come in and help with exec operating rhythm? Or do I accept that changing leadership culture is a massive uphill battle and not worth spending political capital on this early?\n\nCurious if anyone’s been in a similar situation. Would love any advice on how to approach this without coming off negative or naïve.\n\nThanks ❤️",
        "subreddit": "startups",
        "author": "_JeeTee_",
        "score": 171,
        "num_comments": 98,
        "created_utc": 1769834125.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1qrsnuj/newly_hired_vp_at_a_200_person_company_surprised/",
        "fetched_at": "2026-02-02T16:26:48.610776"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 163,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-02-02T16:26:52.451441"
      },
      {
        "id": "1qtuaik",
        "title": "I hit $27k MRR without a personal brand or cold DMs. Here is the playbook.",
        "selftext": "If you are tired of posting on LinkedIn for 0 likes, hate the idea of sending 100 cold emails a day, or just feel like \"standard\" growth tactics are too slow, this is for you.\n\nI just hit $27k MRR with my new project, Rebelgrowth.\n\nAnd i did it by ignoring most of the standard \"SaaS advice.\"\n\nHere is the thing.\n\nEveryone focuses on the tool.\n\n\"Look at my AI wrapper.\" \"Look at my new feature.\"\n\nBut the money isn't in the tool.\n\nIt’s in the **Offer + The Funnel.**\n\nI learned this the hard way.\n\nBefore this, I sold my previous startup (CreativiU) to 7-figures.\n\nI spent years obsessing over what Russel Brunson teaches in Expert Secrets.\n\nAnd here is the \"ugly\" truth about how i actually grow.\n\n**1. The \"Anti-Free Trial\" Offer**\n\nStop asking people to marry you on the first date.\n\nStandard 14-day free trials are boring. They have no urgency.\n\nFor my previous company, i used a \"free + shipping\" model. I gave away physical supplies and just charged $7.99 for shipping.\n\nWhy?\n\nBecause getting someone to pull out their wallet changes the relationship.\n\nIt is 10x easier to upsell a customer who paid $7.99 than it is to convert a free user.\n\nI’m using this same logic for Rebelgrowth (an AI SEO tool).\n\nInstead of a generic trial, my offer is: **3 Days Free + First Month for $9.**\n\nThe regular price is $97/mo, which kicks in at Month 2.\n\nThis works because it stops the scroll.\n\nIt’s an \"unusual\" offer in a sea of sameness.\n\nThen, inside the app, I upsell to a $299 plan.\n\nThis \"tripwire\" approach covers my ad spend so i can acquire customers for essentially $0.\n\n**2. The \"Trojan Horse\" SEO Strategy**\n\nI love SEO, but waiting 6 months for traffic sucks.\n\nSo i cheat.\n\nI call this the **Trojan Horse Interview.**\n\nBack in the day, i started a marketing podcast.\n\nBut the goal wasn't listeners. The goal was backlinks.\n\nI would interview experts and run a \"contest\" for their audience.\n\nTo enter the contest, the guest had to host the participation guidelines on **THEIR** website.\n\nAnd guess what was in those guidelines?\n\nA juicy backlink to my site.\n\nThey got engagement/traffic. I got domain authority.\n\nWin-win.\n\n**3. Paid Ads (For people who hate losing money)**\n\nI treat ads like a vending machine.\n\nI put $1 in, i need to know when $2 comes out.\n\nI built a massive spreadsheet where every row is a touchpoint (CPM, CPC, Click rate, Churn).\n\nThis gives me the confidence to spend, knowing i’ll be profitable in 3 months.\n\nMy strategy is stupidly simple:\n\n* **Meta:** I target broad. US + Europe. My creative is my targeting. I use UGC style videos (15-30 seconds). I use tools like Sora Pro to make hooks because i’m lazy.\n* **Google:** I only bid on **Competitor Keywords**. I don't use their name in the text (don't get sued), but i pin my \"$9 Offer\" in the headline.\n\n**4. Being an Early Adopter (The \"Shiny Object\" Strategy)**\n\nYou have to be where your competitors aren't.\n\nIn Nov 2025, i saw John Rush launch TinyAdz. I jumped on it immediately. Cheap traffic.\n\nWhen Marc Lou launched TrustMRR, I bought an ad spot instantly.\n\nIt was the best ROAS i’ve ever had.\n\nBut you win some, you lose some.\n\nI also burned $500 paying an X influencer who got me zero clicks.\n\nThe point is to move fast.\n\n**Summary of the playbook:**\n\n1. Create an irresistible, \"weird\" offer (low friction entry).\n2. Use that offer to liquidate your ad spend (break even immediately).\n3. Use \"Trojan Horse\" tactics for authority.\n4. Upsell the backend to make profit.\n\nMost people are trying to fill a bucket with a hole in it.\n\nFix the offer (the bucket), and filling it becomes easy.\n\nHas anyone else tried a $1 or $9 \"tripwire\" offer for SaaS? Or is everyone still stuck on \"Freemium\"?\n\nBorja Obeso, founder [Rebelgrowth.com](http://Rebelgrowth.com/?utm_source=reddit)",
        "subreddit": "SaaS",
        "author": "borjafat",
        "score": 122,
        "num_comments": 40,
        "created_utc": 1770036964.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1qtuaik/i_hit_27k_mrr_without_a_personal_brand_or_cold/",
        "fetched_at": "2026-02-02T16:26:46.832824"
      }
    ]
  }
}