{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-03T16:14:38.126851"
  },
  "data": {
    "youtube": [
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2026-01-03T16:14:28.991381"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-03T16:14:28.991378"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-01-03T16:14:28.747685"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2026-01-03T16:14:28.747698"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2026-01-03T16:14:28.991380"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2026-01-03T16:14:28.747693"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2026-01-03T16:14:28.991376"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2026-01-03T16:14:28.747699"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2026-01-03T16:14:28.991368"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2026-01-03T16:14:28.747696"
      }
    ],
    "reddit": [
      {
        "id": "1q1o4nn",
        "title": "Started showing my actual costs to customers and it weirdly helped my business",
        "selftext": "I run a small cleaning service (just me and 2 part timers) and I was always nervous about being too expensive compared to the franchise operations.\n\nAbout 3 months ago I had this customer who kept pushing back on a quote for a deep clean move out. Instead of just dropping the price like I normally would, I was honestly just tired and broke down exactly what everything cost. Like I showed them the supply costs, explained labor hours, even mentioned that I keep some money saved aside (like $7k from Stаke) for equipment replacements that I factored into pricing.\n\nThey ended up booking it AND referred their realtor to us. Now I do this with most estimates when people seem hesitant and my close rate went from like 40% to almost 70%. People seem to actually appreciate seeing where their money goes instead of just getting a final number.\n\nI thought being transparent would make me look amateur or unprofessional but its been the opposite. Had a property manager last week tell me she went with us specifically because I \"didn't treat her like an idiot\" when explaining costs.",
        "subreddit": "smallbusiness",
        "author": "Glittering_Delay_686",
        "score": 775,
        "num_comments": 76,
        "created_utc": 1767325331.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1q1o4nn/started_showing_my_actual_costs_to_customers_and/",
        "fetched_at": "2026-01-03T16:14:35.192250"
      },
      {
        "id": "1q0flx5",
        "title": "0 to $186k per month. I will not promote.",
        "selftext": "i am 34 years old asian man, and I’ve been trying to build businesses for the past 10 years.\n\nAlong the way, I spent some time freelancing and also worked a regular job for about two years. By the time I turned 29, I had lost everything I had no savings, only debt.\n\nMy web development skill was only thing improved.\n\nThe business I’m running now is essentially my last attempt, and it has finally started to work.\n\nI run a dating related app. (I have been working as a freelancer at dating app startup. So I can build it well). When choosing what to build, I deliberately picked something that I believed could remain relatively resilient and adaptable in the age of rapidly advancing AI.\n\nI’ve been working on this product continuously for the past 2 years and 3 months. Growth was slow at first, but steady. Today, the business generates around $186k / month.\n\nFor the first 6 months, I made less than $1k per month.\n\nFor the next 6 months, I averaged around $4k per month.\n\nAfter that first year, growth started to accelerate significantly.\n\nThe hardest part of this journey wasn’t just the business itself. it was managing my life in a balanced way.\n\nMy parents are divorced, and neither of them is financially prepared for retirement. Compared to my peers, I had saved very little. I’m still unmarried. After years of failed ventures, nothing in my life felt stable or solid.\n\nIn that environment, my fear of failure became overwhelming. I didn’t have anyone I could truly lean on emotionally.\n\nEven now, I don’t really have hobbies outside of work. I’m not particularly outgoing either. As I write this, it’s 11:49 PM on the last day of 2025, and I’m sitting alone in my office, writing this post on Reddit.\n\nThe main reason I wanted to write this post is to share one thing I regret the most.\n\nA few years ago, I broke up with my girlfriend, the person who stayed by my side through some of the hardest years of my life. At the time, I was exhausted, overwhelmed, and resentful of everything. I saw even my relationship as a mental burden.\n\nBut in reality, she was the only person who truly supported me, the only one I could deeply rely on emotionally.\n\nAfter we broke up, I focused exclusively on my business. The business eventually worked not because of the breakup, but despite everything. And now, when I look back, she’s the only thing I think about.\n\nShe’s now preparing for marriage with someone else.\n\nAnd I’m dealing with loneliness, questioning whether I can continue growing this business, and worrying about the future.\n\nI know I’ll keep going. I know I’ll make it work.\n\nBut as I get older, the loneliness and isolation feel heavier, and I can feel myself becoming more emotionally unstable.\n\nSometimes I wonder:\n\nIf I had someone by my side right now, wouldn’t I be imagining the future of my business with a much stronger and brighter mindset?\n\nSo this is what I want to say to anyone reading this:\n\nIf you have nothing right now no money, no success, no certainty but someone you love is staying by your side\\*\\*,\\*\\* If you can, hold on to them and build a life together.\n\nNo matter what happens to my business from here on out, this will probably remain my greatest regret.",
        "subreddit": "startups",
        "author": "kiyyang",
        "score": 493,
        "num_comments": 123,
        "created_utc": 1767194889.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1q0flx5/0_to_186k_per_month_i_will_not_promote/",
        "fetched_at": "2026-01-03T16:14:33.426715"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 493,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-03T16:14:37.125512"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 453,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-03T16:14:37.125563"
      },
      {
        "id": "1q26t8h",
        "title": "Customer used us for 2 years then sent a 1,400 word email explaining everything wrong with the product. Best feedback I ever got.",
        "selftext": "Long-time customer. Never complained. Renewed twice. Assumed they were happy. Then out of nowhere this massive email arrives detailing every frustration they'd had over two years. Features that didn't work as expected. Workflows that were harder than they should be. UI decisions that confused them. Everything.\nFirst instinct was defensiveness. If it was so bad why did they keep paying. Why didn't they say something earlier. But I pushed past that and actually read it carefully.\nEvery point was valid. Not all of them were things I'd fix but every single one came from a real experience of friction. They'd just been living with it because switching would be worse. That's not loyalty. That's tolerance. And tolerance runs out eventually.\nSet up a call to dig deeper. They were surprised I wanted to talk. Expected to be ignored or get defensive pushback. Instead I spent an hour understanding their workflows and where we made things harder than necessary.\nFixed about 40% of what they mentioned over the next two months. Told them what we wouldn't fix and why. They went from tolerating us to actively recommending us. Became a case study. All because I treated their essay of complaints as a gift instead of an attack.\nMost customers won't tell you what's wrong. They'll just leave. When someone takes the time to write 1,400 words about your problems, that's someone who cares enough to try. Listen to them.",
        "subreddit": "SaaS",
        "author": "AmbassadorSad3889",
        "score": 246,
        "num_comments": 37,
        "created_utc": 1767379360.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1q26t8h/customer_used_us_for_2_years_then_sent_a_1400/",
        "fetched_at": "2026-01-03T16:14:31.679434"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 169,
        "num_comments": 43,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-03T16:14:37.125538"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 158,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-03T16:14:37.125536"
      },
      {
        "id": "1q1uur5",
        "title": "I spent 6 weeks trying to make a very modest income with AI. Here’s what actually happened.",
        "selftext": "I’m posting this because I keep seeing people online claiming they’re making money with AI, side hustles, tools, prompts, whatever. I tried. Properly. And it went nowhere.\n\nThis wasn’t “get rich quick”. I was aiming for a very modest amount per month. Something realistic. I’ve worked in large organisations for years, so I approached it like a real project, not hype.\n\nHere’s what actually happened.\n\nFirst I tried starting a blog (WordPress). That alone took way more time than expected. Setup, themes, plugins, decisions everywhere. No clear design. And the chatbot had absolutely NO CLUE about how to create and build a wordpress blog, even though it constantly told me how to do it, only to find that that was impossible then kept blaming Wordpress for changing its UI.  SO annoying.\n\nThen I spent several weeks building a Ghost blog site. The idea was AI would surface rumours and I’d investigate or debunk them. This fell apart completely. AI could not provide *any* reliable sources for any rumour it generated (and it generated A LOT!) Since provenance was the whole point, the project was dead. If I couldn't prove there was a rumour, how could I disprove, reject or corrorobate it?\n\nIn parallel I put up 4 Fiverr gigs. Carefully written with AI leading the way on how to correctly create a gig for maximum exposure. Low prices. Clear scope. Weeks later, zero orders. Maybe something comes eventually, but there’s no sign yet that this works at all. OK, probably not directly attributable to AI, BUT - it was AI that led me down this rabbit hole...\n\nI also explored a bunch of other AI-related service ideas. Every single one sounded OK until I asked basic questions like:  \n\\-who is actually paying?\n\n\\-why would they pay someone who is basically cold calling them?\n\n\\-what work already exists?\n\n\\-what cost is being replaced?  \nOnce you force those answers, most ideas collapse pretty fast.\n\nCosts weren’t huge but they were real:  \nChatGPT Plus \\~$50  \nGhost blog \\~$20  \nPlus six weeks of focused time\n\nReturn so far: zero.\n\nWhat bothers me is how misleading the public narrative is. From what I can see, most people “making money with AI” fall into one of four categories:\n\n1. they already had an audience\n2. they’re selling to people who want to make money with AI\n3. they’d earn the money anyway and AI gets the credit\n4. they’re exaggerating or lying\n\nAI is useful. I still use it. But as a way for an individual to create *new* income from scratch? I just don’t see it.\n\nI am posting this because negative experiences don’t get shared much, and I suspect a lot of people are quietly finding the same thing and assuming they’re the problem.\n\nI don’t think I was.\n\nPostscript - and THIS is ironic.  I got the chatbot to write up exactly why you should not use AI in the way I wanted to generate a small income. But Reddit would not accept it because it was written by an AI!!  So even *criticising* AI monetisation using AI tools can get you blocked from the places where the warning would matter most!",
        "subreddit": "Entrepreneur",
        "author": "UnderstandingALot",
        "score": 154,
        "num_comments": 85,
        "created_utc": 1767348194.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1q1uur5/i_spent_6_weeks_trying_to_make_a_very_modest/",
        "fetched_at": "2026-01-03T16:14:29.674210"
      },
      {
        "id": "1q23pbb",
        "title": "Walking away from a high-paying career sounded brave. Living with the consequences has been… rough",
        "selftext": "For most of my adult life I followed the script. Good job, good title, income that looked impressive on paper. From the outside it was a success story. On the inside I was counting down Sundays and dreading Mondays.\n\nEarlier this year I finally said out loud what I’d been avoiding for years: I didn’t actually want that life. So I left.\n\nNow I’m building two things from scratch , one is a small, steady business that’s working but still fragile, and the other is a more ambitious idea that needs constant experimentation. Marketing, testing, figuring out ads, learning how much attention everything really demands… I massively underestimated how competitive and mentally exhausting this phase is.\n\nThe hardest part isn’t even the money. It’s the identity shift.\n\nI used to be “the one with the good job.” Now I’m the person explaining I’m building something and hoping it doesn’t sound like I’m making excuses. It’s choosing cheaper dinners, skipping trips, and feeling that subtle sting when old colleagues casually mention bonuses.\n\nSome days it’s empowering. Other days it’s honestly humbling in ways I didn’t expect.\n\nWhat I’ve gained, though, is a whole new respect for anyone who makes it through this awkward middle stretch , the part where nothing is certain yet and you’re lying awake at 3AM wondering if you made the bravest decision of your life… or the dumbest.\n\nIf you’ve gone through that identity whiplash after leaving a “safe” career, I’d really like to hear how you handled it.",
        "subreddit": "smallbusiness",
        "author": "Economy-Garage5811",
        "score": 139,
        "num_comments": 46,
        "created_utc": 1767372652.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1q23pbb/walking_away_from_a_highpaying_career_sounded/",
        "fetched_at": "2026-01-03T16:14:35.192228"
      },
      {
        "id": "1q14jx3",
        "title": "[I will not promote] I’m a banker in rural Japan. I researched your IT world to share a thought on \"The Forging\" (鍛錬) and Technical Debt.",
        "selftext": "I am not a coder. I work at a local bank in Gunma, Japan, and have spent 20 years looking at loan contracts for small businesses. I’m a 40-year-old father trying to understand how this new world works.\n\nTo talk to you, I spent hours researching your terminology like \"Technical Debt.\" I am sorry if my usage is awkward, but I found a deep connection to my world of finance.\n\nIn banking, we think about \"Amortization\" (how long an asset lasts). \nIf you build a \"Pop-up store\" (a prototype), move fast. Use AI and libraries. That's good business. \nBut if you are building a \"Shrine\" (a core system) to last 20 years, the cheapest way is actually \"**The Forging**\" (鍛錬) way. In Japan, the best katanas are forged by folding the steel thousands of times. Software is the same. You must fold the logic again and again by building from scratch until it becomes part of you.\n\nI see many startups drowning in \"Technical Interest.\" They take \"loans\" by using easy AI code without understanding the core. In banking, a loan without a repayment plan is just a disaster.\n\nIn Japan, we have a concept: \"Chiko-Goitsu\" (知行合一). Knowledge and action are one. \nReading about code isn't enough if your hands move slower than your brain. The friction of struggling without AI—**The Forging**—is where the real skill is born.\n\nIs the \"move fast\" culture making us forget the value of **The Forging**? I am just a banker, but I wanted to hear your professional thoughts.\n\n\n**Edit: 7 Lessons Learned from this discussion**\n\nFirst of all, thank you to everyone who joined this thread. As a rural banker from Japan, your insights have been an incredible \"Ethical OS\" for me. Here is what I’ve learned from your collective wisdom:\n\n**1. Technical Debt as a \"Strategic Loan\"**: Speed is an essential investment in the early stages (MVP). It's okay to \"borrow\" speed, as long as you have a plan to repay it. (Thanks Ray and others!)\n\n**2. The \"Shrine\" vs. \"Cathedral\"**: Don't over-design before you understand the soul of the product. Building a small \"shrine\" first and listening to users is the key to avoiding toxic debt. (Thanks Ok-Kaleidoscope5627!)\n\n**3. Forging is about \"Understanding\"**: Writing code is easy (AI can do it), but \"Forging\" is the process of truly understanding the logic. Re-writing is not a waste; it's how you master the foundation. (Thanks Capt-Kowalski!)\n\n**4. Leadership is Debt Management**: A good leader values the time spent \"repaying\" technical debt. Blindly chasing \"one-hit reversals\" while ignoring the foundation is a gamble that leads to bankruptcy.\n\n**5. Avoid the \"Museum Piece\" Trap**: No matter how much soul you forge into a blade, it loses its life as a tool the moment it stops being a \"weapon for battle.\" True \"Forging\" must be aligned with the battlefield of reality (PMF).\n\n**6. Strategic Survival vs. Capitalist Pivot**: Giants can afford to \"Pivot\" as if they are totaling a supercar and just ordering the next one. But for small founders, a single project is often their whole life; there is no second chance. Therefore, an **\"Exit Strategy\"** is essential. Ideally, we shouldn't just \"discard\" a debt-heavy module. If we can find a buyer or redefine its value for a future \"Buyout,\" high interest turns into a massive \"investment.\" (In reality, this is more often a lucky result than a planned strategy, but it’s the ultimate goal!)\n\n**7. Debt is like Alcohol**: It gives you a temporary high and power, but the \"hangover\" (interest/debt) is inevitable. Success depends on the \"care\" you take before, during, and after drinking. (Thanks Kaidomaru!)\n\nI will take these lessons back to my small bank in Gunma to refine my philosophy. I am truly honored to have met such \"legendary\" mentors here. \n\nArigato (Thank you) from Japan!\n\n",
        "subreddit": "startups",
        "author": "578_Observer",
        "score": 128,
        "num_comments": 55,
        "created_utc": 1767275179.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1q14jx3/i_will_not_promote_im_a_banker_in_rural_japan_i/",
        "fetched_at": "2026-01-03T16:14:33.426701"
      }
    ]
  }
}