{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-29T01:13:37.988376"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-29T01:13:29.526015"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-01-29T01:13:29.040810"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2026-01-29T01:13:29.040821"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2026-01-29T01:13:29.526019"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2026-01-29T01:13:29.040818"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2026-01-29T01:13:29.526013"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2026-01-29T01:13:29.526017"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2026-01-29T01:13:29.040824"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2026-01-29T01:13:29.526005"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2026-01-29T01:13:29.040822"
      }
    ],
    "reddit": [
      {
        "id": "1q6omig",
        "title": "Upwork newbie here, just ran straight-up malware from a “client” project. What the actual f***",
        "selftext": "Burner account because I’m beyond embarrassed and absolutely pissed.\n\nI’m new to Upwork. First “client” I get sends me a Next.js project and says “just run it locally and see if it works.”\n\nThey sent **malware**.\n\nAnd not sloppy malware. This was *deliberately hidden*.\n\nThey buried heavily obfuscated JavaScript **at the very bottom of** `nextjs.config.js`, AFTER `module.exports`, under a massive wall of blank lines so you wouldn’t even scroll there. Like, this was 100% intentional.\n\nOnce I actually de-obfuscated it, here’s what it was capable of:\n\n\\- Full file system access\n\n\\- Detecting the user’s home directory\n\n\\- Dynamically constructing file paths\n\n\\- Reading any file it had permission to read\n\n\\- Base64-encoding file contents (to hide what’s being sent)\n\n\\- Sending that data out via POST requests to remote servers\n\nTranslation: **if you ran it, assume your machine was compromised.**\n\nIf you are new here:\n\n* NEVER run client code blindly\n* Obfuscated JS = malicious. There is no legit reason for it here.\n* If a client says “just test it locally,” stop and think\n\n  \nI’m posting this out of pure rage because I don’t want another new dev to learn this lesson the hard way like I did.",
        "subreddit": "freelance",
        "author": "Jaded-Journalist2470",
        "score": 945,
        "num_comments": 85,
        "created_utc": 1767813175.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1q6omig/upwork_newbie_here_just_ran_straightup_malware/",
        "fetched_at": "2026-01-29T01:13:36.987098"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 497,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-29T01:13:36.987081"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 449,
        "num_comments": 135,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-29T01:13:36.987131"
      },
      {
        "id": "1qaobz3",
        "title": "I scraped 200k+ Reddit posts to find out the best way to get your first freelance client. Here is what I found:",
        "selftext": "Hi everyone,\n\nLike many of you, when I started looking for clients, I was overwhelmed by anecdotal advice: \"Just cold email,\" \"Use Upwork,\" \"Network in person.\" I wanted to know what actually works.\n\nSo, I built a scraper to analyze the archives of r/freelance, r/upwork, r/webdev, and several other freelance subreddits. I processed over 200,000 posts and comments, used AI to filter for relevant information, and normalized the data to find out exactly how people got their first client and how long it took.\n\nHere are the key findings from the data:\n\n* In-Person is King (Speed-wise): The median time to land a client via In-Person Cold Outreach was just 1.5 days. It seems the \"uncomfortable\" work of showing up physically builds trust faster than anything else.\n* The \"Cold\" Hierarchy: If you are doing cold outreach, the medium matters significantly: In-Person > Cold Calling > DMs > Cold Emailing. Cold emailing was the least effective and slowest of the direct methods in the dataset.\n* Free Work Works: Offering free work seems to be one of the fastest ways to convert to a paying client, likely because it removes the initial friction.\n\nOverall, the median time to find a first client was around 21 days, not bad at all!\n\nMethodology & Data Constraints:\n\nWhile this analysis provides valuable insights, it is important to acknowledge the constraints of the data:\n\n* Source Bias: Data is sourced from Reddit communities, which may skew towards specific types of freelancers and experiences.\n* Self-Reporting: Timelines are based on user recollection, which can be subjective.\n* Survivorship Bias: Successful freelancers are more likely to share their stories than those who did not find clients.\n* Sample Size: While 4,000+ leads were identified, only \\~1,000 contained explicit \"time to first client\" data.\n\nThe archives I processed were from 2024. I am currently processing 2025 data and adding more subreddits, which should double or triple the number of leads and provide more accurate results.\n\nFull data if you want to look at it yourself : [Google Sheets](https://docs.google.com/spreadsheets/d/1cLCiQWlPsE3TXA7QE8I-oXyvR7Y1wfUOvj1G8289RmI/edit?usp=sharing)\n\nI'm curious, does this match your experience? Did in-person outreach work faster for you than online methods?\n\n**EDIT:** Reverified some data today; the \"free work\" category had fewer datapoints than I thought, and the AI hallucinated a bit. Since it's \"free work,\" it didn't know whether it needed to find time until the first paying client or time until the first free client. I expect it to probably take a bit more time than 7 days and maybe **bring in** several clients at once.\n\nAlso tried to look if a lot of spam got through (i.e., people just creating posts to advertise a product) and honestly, not a lot; I only saw one so far.\n\n**->** Sadly, I can't update images. The conclusions still seem to be holding up at least—I hope it's not confirmation bias. I will let you know more for sure with the new data.",
        "subreddit": "freelance",
        "author": "Tryhard_314",
        "score": 210,
        "num_comments": 74,
        "created_utc": 1768201888.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qaobz3/i_scraped_200k_reddit_posts_to_find_out_the_best/",
        "fetched_at": "2026-01-29T01:13:36.987096"
      },
      {
        "id": "1qp13m1",
        "title": "I hit $10k MRR in 87 days with zero ads. Here’s the exact routine (steal it)",
        "selftext": "everyone’s looking for the “hack.” the secret funnel. the viral moment.\n\nthere’s no hack. it’s just boring work that compounds.\n\nhere’s exactly what i did every single day for 3 months:\n\nMorning (2 hours)\n\n\\- 15-20 LinkedIn connection requests (manual, not automated)\n\n\\- 20-30 LinkedIn DMs — NOT pitching. asking for feedback on my product [cliqo](http://www.cliqo.com) a tool to launch organic UGC campaign (performances based)\n\n\\- 10 Reddit comments on threads where my ICP hangs out\n\nAfternoon (2 hours)\n\n\\- 20-100 cold emails (started manual, then used [lemlist](https://lemlist.com) to scale)\n\n\\- follow-ups on previous emails — this is where 80% of replies come from\n\n\\- 1 piece of content on LinkedIn or Twitter\n\nRest of day\n\n\\- product work\n\n\\- customer calls\n\n\\- support\n\nthat’s it. nothing fancy.\n\nDay 1:crickets. felt like an idiot.\n\nDay 30: 10 paying customers. $2k MRR.\n\nDay 60: momentum kicked in. $6k MRR.\n\nDay 87: crossed $10k MRR.\n\nthe thing nobody tells you: the first month SUCKS. you feel like you’re shouting into the void.\n\nbut it compounds. every connection, every comment, every email — they stack.\n\ni wrote up the full system in more detail here if anyone wants it: [playbook](https://coolplaybook.notion.site/The-Scale-Playbook-2f445490c66c80c1ab40e810f2b70725?pvs=74) covers the 0 to 10k journey with templates.",
        "subreddit": "SaaS",
        "author": "Sufficient-Bee-5427",
        "score": 172,
        "num_comments": 108,
        "created_utc": 1769573709.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1qp13m1/i_hit_10k_mrr_in_87_days_with_zero_ads_heres_the/",
        "fetched_at": "2026-01-29T01:13:32.038213"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 171,
        "num_comments": 51,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-29T01:13:36.987114"
      },
      {
        "id": "1qo973u",
        "title": "YC no longer invest in Canadian companies and the insecure way they run their sub I will not promote",
        "selftext": "Made a post on the yc subreddit about the news they were no longer selecting Canadian companies. It’s a corporate owned sub that they manage actively, so I specifically said, this is directly yc related and useful for Canadians who were thinking of applying (like I once was before proceeding with better options). Within 3 minutes it was taken down, and their mod stated no reason why + no response to direct outreach\n\nJust another reminder these companies aren’t shining beacons on a hill, and don’t generally have your best interests in mind; they are a VC with good marketing. If it fits your path awesome, but don’t fall for the propaganda it’s what you need to grow (we ended up going with another accelerator that fit our growth better)",
        "subreddit": "startups",
        "author": "SwiggityDiggity8",
        "score": 161,
        "num_comments": 41,
        "created_utc": 1769506038.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1qo973u/yc_no_longer_invest_in_canadian_companies_and_the/",
        "fetched_at": "2026-01-29T01:13:33.701045"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 158,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-29T01:13:36.987112"
      },
      {
        "id": "1qp168u",
        "title": "Found a free way to check if your website could get you in ADA trouble",
        "selftext": "So I've been hearing more about these ADA website lawsuits lately and got a little paranoid about my own site. Did some digging and found out Chrome has a built-in tool that checks for accessibility issues. Totally free, takes like 2 minutes.\n\nRight-click on your site, hit Inspect, then find the Lighthouse tab up top (might be hiding under the >> arrows). Set it to check Accessibility only and let it run.\n\nI ran it on my site, expecting everything to be fine. Nope. Got flagged for a bunch of stuff I never would have noticed—buttons without labels, images missing alt text, contrast issues. Nothing that seemed like a big deal to me, but apparently it matters for screen readers and can be used against you in those demand letters.\n\nFixed most of it myself in an afternoon. Some of it I had to Google, but nothing crazy.\n\njust figured this might save someone a headache. Those ADA lawsuit letters are no joke from what I've read—settlements start at like $5k and go way up.\n\nHas anyone else dealt with this stuff?",
        "subreddit": "smallbusiness",
        "author": "alwayseager21",
        "score": 133,
        "num_comments": 51,
        "created_utc": 1769573912.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1qp168u/found_a_free_way_to_check_if_your_website_could/",
        "fetched_at": "2026-01-29T01:13:35.223682"
      },
      {
        "id": "1qp6l41",
        "title": "Being introverted was the bottleneck in my business",
        "selftext": "I’d spend months optimizing landing pages to get a 1% conversion increase. Or chase some “secret winning” Meta ad campaign setup that would take my business to the next level.\n\nUntil my mentor told me business is a mirror of your personal self-improvement. The bottlenecks in your business are usually the things you’re lacking as a person.\n\nWhat I was actually avoiding was obvious. I didn’t like talking to people.\n\nI avoided sales calls. Tried to close deals over text. Then gradually went cold when someone wanted a call. I was literally letting go of opportunities.\n\nI was distracting myself with 1% improvements while avoiding what was probably a 400% business growth at that point.\n\n\nI didn’t magically fix it, but this is how I deal with it now:\n\n1. I only work with big high-ticket clients, so the earnings per talking ratio would be optimal.\n\n2. Brought on a sales rep.\n\n3. Reduced impostor syndrome by becoming more of an expert. So that people can’t corner me by asking something I don’t know.\n\n\nHope this helps a fellow introvert out there :)\n",
        "subreddit": "smallbusiness",
        "author": "LilTiit",
        "score": 118,
        "num_comments": 17,
        "created_utc": 1769591804.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1qp6l41/being_introverted_was_the_bottleneck_in_my/",
        "fetched_at": "2026-01-29T01:13:35.223667"
      }
    ]
  }
}