{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-27T08:21:19.796445"
  },
  "data": {
    "youtube": [
      {
        "videoId": "mjiT0g3mYgw",
        "title": "9 Editing Tips To Save HOURS in DaVinci Resolve!",
        "description": "9 Editing Tips in DaVinci Resolve you probably didn't know! In this DaVinci Resolve tutorial, I'm going to show you 9 powerful ...",
        "channelTitle": "Sightseeing Stan",
        "publishedAt": "2025-05-26T14:01:15Z",
        "url": "https://www.youtube.com/watch?v=mjiT0g3mYgw",
        "fetched_at": "2026-01-27T08:21:10.847428"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-27T08:21:11.106707"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-01-27T08:21:10.847414"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2026-01-27T08:21:11.106712"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2026-01-27T08:21:10.847398"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2026-01-27T08:21:11.106704"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2026-01-27T08:21:11.106709"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2026-01-27T08:21:10.847426"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2026-01-27T08:21:11.106692"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2026-01-27T08:21:10.847423"
      }
    ],
    "reddit": [
      {
        "id": "1q6omig",
        "title": "Upwork newbie here, just ran straight-up malware from a “client” project. What the actual f***",
        "selftext": "Burner account because I’m beyond embarrassed and absolutely pissed.\n\nI’m new to Upwork. First “client” I get sends me a Next.js project and says “just run it locally and see if it works.”\n\nThey sent **malware**.\n\nAnd not sloppy malware. This was *deliberately hidden*.\n\nThey buried heavily obfuscated JavaScript **at the very bottom of** `nextjs.config.js`, AFTER `module.exports`, under a massive wall of blank lines so you wouldn’t even scroll there. Like, this was 100% intentional.\n\nOnce I actually de-obfuscated it, here’s what it was capable of:\n\n\\- Full file system access\n\n\\- Detecting the user’s home directory\n\n\\- Dynamically constructing file paths\n\n\\- Reading any file it had permission to read\n\n\\- Base64-encoding file contents (to hide what’s being sent)\n\n\\- Sending that data out via POST requests to remote servers\n\nTranslation: **if you ran it, assume your machine was compromised.**\n\nIf you are new here:\n\n* NEVER run client code blindly\n* Obfuscated JS = malicious. There is no legit reason for it here.\n* If a client says “just test it locally,” stop and think\n\n  \nI’m posting this out of pure rage because I don’t want another new dev to learn this lesson the hard way like I did.",
        "subreddit": "freelance",
        "author": "Jaded-Journalist2470",
        "score": 944,
        "num_comments": 83,
        "created_utc": 1767813175.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1q6omig/upwork_newbie_here_just_ran_straightup_malware/",
        "fetched_at": "2026-01-27T08:21:18.795083"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 496,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-27T08:21:18.795064"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 457,
        "num_comments": 135,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-27T08:21:18.795118"
      },
      {
        "id": "1qmpe30",
        "title": "Spent way too long comparing payroll platforms, here's the checklist I wish I had from day one",
        "selftext": "Break down geo, compliance, payments, integrations, pricing, and security. Hope it’ll help you estimate a platform in 30 minutes instead of comparing payrolls for months.\n\n# Geo coverage\n\nThe platform works in every country where you currently have workers, as well as in the countries you plan to expand to next year.  \nIt has its own infrastructure in each country and does not rely on aggregators, which provides better control and transparency.  \nIf you work with contractors or freelancers, the platform includes tools for paying them and staying legally compliant.\n\n# Compliance and payments\n\nHandles local tax registrations, tax filings, and payments to government authorities.  \nMonitors changes in local labor and tax laws and updates the rules on a regular basis.  \nHelps determine the correct worker classification (contractor or employee) based on local regulations.  \nIf you have workers in the EU, the platform complies with GDPR requirements.  \nSupports all relevant currencies for both companies and workers.  \nShows exchange rates and conversion fees transparently, with no hidden costs.  \nUses local payment networks so workers receive payments faster.  \nAllows sending payments to workers in multiple countries in a single batch.  \nSupports off-cycle payments such as bonuses, corrections, or other special payments.\n\n# Pricing and total cost\n\nShows monthly and yearly fees with a clear list of what is included.  \nDisplays the price per worker per month and how it varies by country.  \nAll additional costs are explained upfront.\n\n# Data security and privacy\n\nThe platform holds recognized security certifications.  \nAll data is protected using encryption.  \nTwo-factor authentication is available for admin access.\n\n# Support, features, integrations, and UX\n\nThe platform is available in English and local languages.  \nWorkers have access to personal accounts where they can view payslips and download tax documents.  \nProvides API access for integrations and automation when needed.  \nIntegrates with accounting systems.  \nCustomer support is responsive and available when assistance is required.  \nOffers help with data migration from existing systems.  \nSupports multiple worker types, including employees, contractors, and part-time workers.\n\nIf you have anything to add, I’d really appreciate it.\n\n",
        "subreddit": "Entrepreneur",
        "author": "ShadowBoneDragon",
        "score": 228,
        "num_comments": 31,
        "created_utc": 1769362149.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1qmpe30/spent_way_too_long_comparing_payroll_platforms/",
        "fetched_at": "2026-01-27T08:21:11.821918"
      },
      {
        "id": "1qnk3sa",
        "title": "What to actually say when a client says \"that's more than we budgeted\"",
        "selftext": "Got this objection last month and for once I didn't panic or immediately offer a discount.\n\n Here's what I've learned works:\n\n **Objection: \"That's more than we budgeted\"**\n\n Old me: \"I could do it for \\[lower number\\]...\" (instant regret)\n\n New me: \"I understand. What budget range are you working with? Sometimes I can adjust the scope to fit.\"\n\n Then I offer a smaller version. Same rate, less scope.\n\n **Objection: \"Can you do it for $X?\"**\n\n Old me: Awkward silence, then \"...sure\"\n\n New me: \"I can definitely work within that budget. At $X, I'd recommend we focus on \\[specific piece\\]. You'd get \\[outcome\\] without the \\[removed elements\\]. Would that work?\"\n\n **Objection: \"We got a lower quote from someone else\"**\n\n Old me: Panic\n\n New me: \"That makes sense — there's a wide range. Does their quote include \\[specific thing\\]? What's their revision policy?\"\n\n Then: \"I'm confident in my pricing because \\[one sentence on value\\]. But if they're a better fit for your budget, I completely understand.\"\n\n **The principle: Never lower your rate. Adjust scope instead.**\n\n It took me years to internalize this. The first few times feel uncomfortable. But once you do it, you stop resenting projects and clients stop expecting discounts.\n\n Anyone else have scripts that work for them?",
        "subreddit": "smallbusiness",
        "author": "U-S-Hey",
        "score": 213,
        "num_comments": 49,
        "created_utc": 1769443445.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1qnk3sa/what_to_actually_say_when_a_client_says_thats/",
        "fetched_at": "2026-01-27T08:21:16.752030"
      },
      {
        "id": "1qn67jz",
        "title": "Can the mods please block all the shit AI spam post on this sub",
        "selftext": "stop letting the AI bots spam this subreddit.  literally, it's every post in the sub now. ",
        "subreddit": "smallbusiness",
        "author": "Mother-Conclusion-31",
        "score": 204,
        "num_comments": 46,
        "created_utc": 1769402139.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1qn67jz/can_the_mods_please_block_all_the_shit_ai_spam/",
        "fetched_at": "2026-01-27T08:21:16.752042"
      },
      {
        "id": "1qaobz3",
        "title": "I scraped 200k+ Reddit posts to find out the best way to get your first freelance client. Here is what I found:",
        "selftext": "Hi everyone,\n\nLike many of you, when I started looking for clients, I was overwhelmed by anecdotal advice: \"Just cold email,\" \"Use Upwork,\" \"Network in person.\" I wanted to know what actually works.\n\nSo, I built a scraper to analyze the archives of r/freelance, r/upwork, r/webdev, and several other freelance subreddits. I processed over 200,000 posts and comments, used AI to filter for relevant information, and normalized the data to find out exactly how people got their first client and how long it took.\n\nHere are the key findings from the data:\n\n* In-Person is King (Speed-wise): The median time to land a client via In-Person Cold Outreach was just 1.5 days. It seems the \"uncomfortable\" work of showing up physically builds trust faster than anything else.\n* The \"Cold\" Hierarchy: If you are doing cold outreach, the medium matters significantly: In-Person > Cold Calling > DMs > Cold Emailing. Cold emailing was the least effective and slowest of the direct methods in the dataset.\n* Free Work Works: Offering free work seems to be one of the fastest ways to convert to a paying client, likely because it removes the initial friction.\n\nOverall, the median time to find a first client was around 21 days, not bad at all!\n\nMethodology & Data Constraints:\n\nWhile this analysis provides valuable insights, it is important to acknowledge the constraints of the data:\n\n* Source Bias: Data is sourced from Reddit communities, which may skew towards specific types of freelancers and experiences.\n* Self-Reporting: Timelines are based on user recollection, which can be subjective.\n* Survivorship Bias: Successful freelancers are more likely to share their stories than those who did not find clients.\n* Sample Size: While 4,000+ leads were identified, only \\~1,000 contained explicit \"time to first client\" data.\n\nThe archives I processed were from 2024. I am currently processing 2025 data and adding more subreddits, which should double or triple the number of leads and provide more accurate results.\n\nFull data if you want to look at it yourself : [Google Sheets](https://docs.google.com/spreadsheets/d/1cLCiQWlPsE3TXA7QE8I-oXyvR7Y1wfUOvj1G8289RmI/edit?usp=sharing)\n\nI'm curious, does this match your experience? Did in-person outreach work faster for you than online methods?\n\n**EDIT:** Reverified some data today; the \"free work\" category had fewer datapoints than I thought, and the AI hallucinated a bit. Since it's \"free work,\" it didn't know whether it needed to find time until the first paying client or time until the first free client. I expect it to probably take a bit more time than 7 days and maybe **bring in** several clients at once.\n\nAlso tried to look if a lot of spam got through (i.e., people just creating posts to advertise a product) and honestly, not a lot; I only saw one so far.\n\n**->** Sadly, I can't update images. The conclusions still seem to be holding up at least—I hope it's not confirmation bias. I will let you know more for sure with the new data.",
        "subreddit": "freelance",
        "author": "Tryhard_314",
        "score": 201,
        "num_comments": 71,
        "created_utc": 1768201888.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qaobz3/i_scraped_200k_reddit_posts_to_find_out_the_best/",
        "fetched_at": "2026-01-27T08:21:18.795080"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 169,
        "num_comments": 49,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-27T08:21:18.795101"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 160,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-27T08:21:18.795099"
      },
      {
        "id": "1qnm8n0",
        "title": "I stopped getting restricted on LinkedIn after I fixed these 6 account health metrics",
        "selftext": "I got restricted on LinkedIn twice in 4 months while doing legit B2B outbound, and it was the overall pattern of my account looking “low-trust.”\n\nHere’re my mistakes. This is not “how to evade,” it’s what reduced restrictions once I cleaned up behavior and stopped chasing volume.\n\n1/ I had 380 pending connection requests just sitting there. Apparently LinkedIn gets suspicious when you have too many pending invites because it means low acceptance rate, so you look like spam. They recommend keeping it under 500 but from what I read now even that's pushing it, more like 200-300 is safer. Now I just withdraw old invites, LinkedIn doesn't notify these people, so I can re-invite them in 3 weeks.\n\n2/ there's a weekly invitation limit now, 100-200 invites per week depending on your account. I was aiming for 230 a week to get the following. I thought I was fine because I stayed under daily limits. But the weekly number matters just as much.\n\n3/ I set my tool to send only 35 requests every day at the same time. But real people can send 20 today at 10:00 AM, 40 tomorrow at 16:30 and 0 on Friday. So now I use randomization for everything. I vary daily limits between 20-30 and different timing.\n\n4/ I was only sending connection requests and sending messages, but I also needed to like posts, write comments etc. Real people browse, read content and reply in comments.\n\nWhat other triggers have you seen that cause restrictions (especially the non-obvious ones)?\n\n",
        "subreddit": "SaaS",
        "author": "WhispersAndWinksx",
        "score": 128,
        "num_comments": 19,
        "created_utc": 1769447829.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1qnm8n0/i_stopped_getting_restricted_on_linkedin_after_i/",
        "fetched_at": "2026-01-27T08:21:13.514221"
      }
    ]
  }
}