{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-17T08:16:23.080522"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-17T08:16:14.595211"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-01-17T08:16:14.273403"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2026-01-17T08:16:14.595215"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2026-01-17T08:16:14.273413"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2026-01-17T08:16:14.595209"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2026-01-17T08:16:14.595213"
      },
      {
        "videoId": "o5ENktjJ0Rc",
        "title": "Video Editing Workflow | File Management",
        "description": "Here is my video editing workflow when it comes to video project file management. Having a good file structure is extremely ...",
        "channelTitle": "Andrik Langfield",
        "publishedAt": "2021-06-10T15:00:20Z",
        "url": "https://www.youtube.com/watch?v=o5ENktjJ0Rc",
        "fetched_at": "2026-01-17T08:16:14.273419"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2026-01-17T08:16:14.273417"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2026-01-17T08:16:14.595199"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2026-01-17T08:16:14.273415"
      }
    ],
    "reddit": [
      {
        "id": "1q6omig",
        "title": "Upwork newbie here, just ran straight-up malware from a “client” project. What the actual f***",
        "selftext": "Burner account because I’m beyond embarrassed and absolutely pissed.\n\nI’m new to Upwork. First “client” I get sends me a Next.js project and says “just run it locally and see if it works.”\n\nThey sent **malware**.\n\nAnd not sloppy malware. This was *deliberately hidden*.\n\nThey buried heavily obfuscated JavaScript **at the very bottom of** `nextjs.config.js`, AFTER `module.exports`, under a massive wall of blank lines so you wouldn’t even scroll there. Like, this was 100% intentional.\n\nOnce I actually de-obfuscated it, here’s what it was capable of:\n\n\\- Full file system access\n\n\\- Detecting the user’s home directory\n\n\\- Dynamically constructing file paths\n\n\\- Reading any file it had permission to read\n\n\\- Base64-encoding file contents (to hide what’s being sent)\n\n\\- Sending that data out via POST requests to remote servers\n\nTranslation: **if you ran it, assume your machine was compromised.**\n\nIf you are new here:\n\n* NEVER run client code blindly\n* Obfuscated JS = malicious. There is no legit reason for it here.\n* If a client says “just test it locally,” stop and think\n\n  \nI’m posting this out of pure rage because I don’t want another new dev to learn this lesson the hard way like I did.",
        "subreddit": "freelance",
        "author": "Jaded-Journalist2470",
        "score": 915,
        "num_comments": 74,
        "created_utc": 1767813175.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1q6omig/upwork_newbie_here_just_ran_straightup_malware/",
        "fetched_at": "2026-01-17T08:16:22.079148"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 500,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-17T08:16:22.079129"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 456,
        "num_comments": 135,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-17T08:16:22.079183"
      },
      {
        "id": "1qecoh9",
        "title": "5 habits every SaaS founder needs to hit $10k MRR in 90 days",
        "selftext": "A few months back, I finally sold my ecommerce SaaS for a decent exit after hitting $500K ARR in 8 months.   \n  \nTook me three tries to get there - the first two were complete disasters.\n\nThis whole thing was brutal. I'm talking thousands of hours, doing the same tedious tasks over and over, saying goodbye to weekends, constantly second-guessing myself, running tests that went absolutely nowhere. But it worked out in the end.\n\nNow I'm working on [this SAAS ](https://gojiberry.ai)(helps B2B companies find and contact high-intent leads), and if I had to do it all over again, these are the exact habits I'd stick to every single day to get to $10k MRR as fast as possible.\n\nI've screwed up in every way you can imagine:\n\n* Wasted 6 months building something nobody wanted\n* Created a \"brilliant\" product that nobody would pay for\n* Got 2,000 people on my waitlist but couldn't convert a single one to paid\n\nSo this is me paying it forward.\n\nIf you're just starting out, trying to get from zero to actual traction, just do these 5 things. Every day with no exceptions.\n\nYour brain's going to fight you on this. It'll whisper \"don't send that message,\" \"don't post that - you'll look like an idiot,\" \"it's beautiful outside, take the day off.\" Don't listen.\n\nGrowth happens when you're uncomfortable. Not when you're cozy.\n\nPush through that voice. Do the work anyway. You'll thank yourself later.\n\nHere are the 5 daily habits that actually move the needle:\n\n1. Send 20-30 LinkedIn connection requests to your ideal customers. Just 20 minutes. Do it manually. Pick the right people. Connect. Done.\n2. Message 20-30 people on LinkedIn. Don't sell them anything. Just talk. Ask questions. Share what you're building and see if they have the same problem.\n3. Send 20-100 cold emails 20 if you're writing them yourself, 100+ if you're using tools. Keep them short. Don't be pushy. Just start real conversations. The magic happens in your follow-ups - send 2-3.\n4. Comment on 10 Reddit threads in your space. Go where your customers hang out. Jump into \"looking for alternatives to X\" posts. Actually help people. Only mention your product when it genuinely fits. People can smell fake help from a mile away.\n5. Post something on LinkedIn every day. This builds up over time. Write about problems your customers face, share what you've learned, tell quick stories about wins and losses. Give away good stuff for free. Build your lead magnets into the content. Just show up consistently.\n\nAt the beginning, it feels pointless.\n\n* 1 like on your posts\n* 1 response for every 20 messages you send\n* Radio silence on your first batch of emails\n\nBut stick with it every single day, and things start to compound.\n\nYou get better at writing. Your messages start working. People begin to recognize you. Someone books a call. Then 2 more. Then 10. Then they start referring people.\n\nThat's how you actually win. Not by getting lucky, but by showing up every day.\n\nEven when it's mind-numbingly boring.\n\nThe boring stuff is what actually grows your business.\n\nTrust me, it's worth it ! ",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 285,
        "num_comments": 40,
        "created_utc": 1768559904.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1qecoh9/5_habits_every_saas_founder_needs_to_hit_10k_mrr/",
        "fetched_at": "2026-01-17T08:16:16.996391"
      },
      {
        "id": "1qdsveh",
        "title": "It's your choice",
        "selftext": "I'm 73.   \n  \nIf you want to have a great, rewarding business and life, you need to accept this truth that most people refuse to believe:\n\nNothing’s over until YOU say it’s over. \n\n* You will succeed and you will fail.\n* You will be accepted and you will be rejected.\n* You will get it right the first time and it will take you 10x to get it right.\n* You will be a novice when you start and you have the possibility to be a pro at the end.\n\nEach one of those comes with a choice. Give up or try again.\n\nLife is a culmination of choices. Over a lifetime you will have thousands of them. They will determine what you have, what you do, and who you are.\n\nWant a life with freedom, money and no regrets? Get back up when you feel knocked down. Every time!!\n\nNothing’s over until YOU say it’s over.\n\nPlease Save this post so you’ll have a reminder that YOU get to choose the life you want.",
        "subreddit": "Entrepreneur",
        "author": "DaCmanLou",
        "score": 273,
        "num_comments": 55,
        "created_utc": 1768504592.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1qdsveh/its_your_choice/",
        "fetched_at": "2026-01-17T08:16:15.287371"
      },
      {
        "id": "1qaobz3",
        "title": "I scraped 200k+ Reddit posts to find out the best way to get your first freelance client. Here is what I found:",
        "selftext": "Hi everyone,\n\nLike many of you, when I started looking for clients, I was overwhelmed by anecdotal advice: \"Just cold email,\" \"Use Upwork,\" \"Network in person.\" I wanted to know what actually works.\n\nSo, I built a scraper to analyze the archives of r/freelance, r/upwork, r/webdev, and several other freelance subreddits. I processed over 200,000 posts and comments, used AI to filter for relevant information, and normalized the data to find out exactly how people got their first client and how long it took.\n\nHere are the key findings from the data:\n\n* In-Person is King (Speed-wise): The median time to land a client via In-Person Cold Outreach was just 1.5 days. It seems the \"uncomfortable\" work of showing up physically builds trust faster than anything else.\n* The \"Cold\" Hierarchy: If you are doing cold outreach, the medium matters significantly: In-Person > Cold Calling > DMs > Cold Emailing. Cold emailing was the least effective and slowest of the direct methods in the dataset.\n* Free Work Works: Offering free work seems to be one of the fastest ways to convert to a paying client, likely because it removes the initial friction.\n\nOverall, the median time to find a first client was around 21 days, not bad at all!\n\nMethodology & Data Constraints:\n\nWhile this analysis provides valuable insights, it is important to acknowledge the constraints of the data:\n\n* Source Bias: Data is sourced from Reddit communities, which may skew towards specific types of freelancers and experiences.\n* Self-Reporting: Timelines are based on user recollection, which can be subjective.\n* Survivorship Bias: Successful freelancers are more likely to share their stories than those who did not find clients.\n* Sample Size: While 4,000+ leads were identified, only \\~1,000 contained explicit \"time to first client\" data.\n\nThe archives I processed were from 2024. I am currently processing 2025 data and adding more subreddits, which should double or triple the number of leads and provide more accurate results.\n\nFull data if you want to look at it yourself : [Google Sheets](https://docs.google.com/spreadsheets/d/1cLCiQWlPsE3TXA7QE8I-oXyvR7Y1wfUOvj1G8289RmI/edit?usp=sharing)\n\nI'm curious, does this match your experience? Did in-person outreach work faster for you than online methods?\n\n**EDIT:** Reverified some data today; the \"free work\" category had fewer datapoints than I thought, and the AI hallucinated a bit. Since it's \"free work,\" it didn't know whether it needed to find time until the first paying client or time until the first free client. I expect it to probably take a bit more time than 7 days and maybe **bring in** several clients at once.\n\nAlso tried to look if a lot of spam got through (i.e., people just creating posts to advertise a product) and honestly, not a lot; I only saw one so far.\n\n**->** Sadly, I can't update images. The conclusions still seem to be holding up at least—I hope it's not confirmation bias. I will let you know more for sure with the new data.",
        "subreddit": "freelance",
        "author": "Tryhard_314",
        "score": 176,
        "num_comments": 52,
        "created_utc": 1768201888.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qaobz3/i_scraped_200k_reddit_posts_to_find_out_the_best/",
        "fetched_at": "2026-01-17T08:16:22.079145"
      },
      {
        "id": "1qeduru",
        "title": "3 side income streams I built while working full-time - $700+/month with minimal time investment",
        "selftext": "Been grinding side hustles for the past 4 years while keeping my full-time tech job. Finally at a point where I'm making consistent extra income without burning out. Here's the breakdown:  \nIncome Stream #1: Dividend Investing ($500/month passive)  \n  \nStarted with $200/month into dividend ETFs back in 2021  \nNow automatically contributes $600/month, reinvests dividends  \nGenuinely zero maintenance once set up  \n  \nIncome Stream #2: Microtask platforms ($200-400/month semi-passive)  \n  \nDo small online tasks during lunch breaks, while watching TV, etc.  \nTakes maybe 5-10 hours/month total  \nPerfect for dead time that would otherwise be wasted  \n  \nIncome Stream #3: Testing digital products (TBD)  \n  \nCreating info products in my niche  \nToo early for real numbers but optimistic  \n  \nThe strategy that changed everything:  \nDon't try to replace your income immediately. Start with things that fit into gaps in your schedule. The dividend income grows automatically while I can dial the active stuff up or down based on work demands.  \nFor anyone starting out:  \n  \nBegin with one truly passive income source (investments)  \nAdd flexible side hustles that don't require set hours  \nAutomate everything possible  \nBe patient - took me 2+ years to see real momentum  \n  \nWhat side hustles are you all running alongside your day jobs? Always looking for new ideas to test.",
        "subreddit": "Entrepreneur",
        "author": "Silent_Indication161",
        "score": 171,
        "num_comments": 49,
        "created_utc": 1768563957.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1qeduru/3_side_income_streams_i_built_while_working/",
        "fetched_at": "2026-01-17T08:16:15.287323"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 171,
        "num_comments": 47,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-17T08:16:22.079165"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 156,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-17T08:16:22.079161"
      },
      {
        "id": "1qehlaa",
        "title": "Quitting My $200k Engineering Job to Start a SaaS: What Nobody Will Ever Tell You",
        "selftext": "Two years ago I quit my staff engineer job (about $200k base) to go all in on a SaaS.\n\nOn paper, it sounds clean: “I believed in myself and took the leap.”\n\nIn real life, it’s messy, stressful, lonely, and way harder than people admit, especially as a solo founder.\n\n# Why I left\n\nI had the itch for a long time. I wanted to build something I owned. I wanted to stop spending my best hours making other people richer. I wanted to control my roadmap, my pace, and my upside.\n\nI didn’t quit because I hated engineering. I quit because I wanted to see what I could build if I wasn’t splitting my energy.\n\n# What nobody tells you\n\n# 1) You don’t just quit a job. You lose structure.\n\nA job gives you built-in momentum: meetings, deadlines, coworkers, validation, a clear definition of “done.”\n\nAs a solo founder, you can work 12 to 15 hours and still feel like you accomplished nothing, because there’s no external scoreboard until customers pay.\n\nAnd that lack of structure messes with your head.\n\n# 2) The work multiplies the second you go full time\n\nPeople think quitting means you finally get time to build.\n\nIt does, but now you’re also:\n\n* product\n* design\n* QA\n* support\n* marketing\n* sales\n* demos\n* onboarding\n* analytics\n* billing issues\n* retention\n* churn\n* content\n\nYou’re not building a SaaS. You’re building a company. And every part of the company shows up at your door daily.\n\n# 3) Coding is the easiest part\n\nThis was the biggest surprise.\n\nI can code all day. That’s familiar pain.\n\nMarketing is unfamiliar pain.\n\nWriting copy that doesn’t sound fake.  \nExplaining value in one sentence.  \nLearning channels.  \nRunning experiments.  \nFixing conversion leaks.  \nDoing demos and hearing “this is cool” and then… nothing.\n\nDistribution is the game. The product is just your entry ticket.\n\n# 4) Traction is not proportional to effort\n\nIn engineering, effort usually turns into output.\n\nIn SaaS, effort can disappear into the void.\n\nYou can ship feature after feature and the graph won’t move.  \nYou can rewrite onboarding and it won’t move.  \nYou can adjust pricing and it won’t move.\n\nThat mismatch is brutal and it creates a specific type of frustration that’s hard to explain to people who haven’t lived it.\n\n# 5) The lifestyle shift is real\n\nThere’s no “clocking out.”\n\nI’ve worked 7 days a week, 15 hours a day at times. Not as a flex. As a requirement. Because early stage SaaS can feel like pushing a car uphill with your bare hands.\n\nAnd when you’re solo, every delay is your fault.  \nEvery missed opportunity is your fault.  \nEvery bug is your fault.  \nEvery slow week is your fault.\n\nThat weight is heavy.\n\n# 6) You will question yourself constantly\n\nSome days you feel unstoppable.\n\nOther days you wonder if you made the dumbest decision of your life leaving a stable, high-paying role.\n\nThe emotional swings are insane:  \nConfidence to anxiety.  \nMomentum to doubt.  \nHope to frustration.\n\nIt’s not just building a product, it’s managing your psychology.\n\n# 7) The loneliness is underrated\n\nAs a solo founder, there’s nobody to share the burden with.  \nNo teammate to say “we’re fine.”  \nNo one who fully understands the problem you’re solving.\n\nEven when friends support you, most people don’t get it. They see “working from home” and assume it’s chill.\n\nIt’s not chill.\n\n# What’s kept me going\n\nHonestly: persistence, obsession, and learning fast.\n\nI stopped romanticizing motivation and started treating this like a long war.\n\nShip.  \nMeasure.  \nTalk to users.  \nIterate.  \nRepeat.\n\nSome weeks nothing works.  \nThen one small thing clicks and you remember why you started.\n\n# Where I’m at now\n\nThe SaaS is real, it’s growing, and it’s doing thousands in MRR.\n\nStill early. Still building. Still stressful.\n\nBut I’ve learned more in two years than I learned in a decade of jobs, because there’s no hiding. The market tells you the truth.\n\n# Question for the community\n\nFor those who quit a high-paying job to build SaaS:\n\nWhat was the hardest part for you?  \nAnd what do you wish you knew before you made the jump?",
        "subreddit": "SaaS",
        "author": "Own-Moment-429",
        "score": 122,
        "num_comments": 94,
        "created_utc": 1768574130.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1qehlaa/quitting_my_200k_engineering_job_to_start_a_saas/",
        "fetched_at": "2026-01-17T08:16:16.996393"
      }
    ]
  }
}