{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-31T01:09:53.747863"
  },
  "data": {
    "youtube": [
      {
        "videoId": "REpmmKN7EWU",
        "title": "7 Steps to Edit a Video in DaVinci Resolve (Start to Finish)",
        "description": "FREE PRACTICE MEDIA & CHEAT SHEET: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2026-01-09T13:30:37Z",
        "url": "https://www.youtube.com/watch?v=REpmmKN7EWU",
        "fetched_at": "2026-01-31T01:09:45.180247"
      },
      {
        "videoId": "Q1tCEvqakUo",
        "title": "Fastest Editing Workflow in DaVinci Resolve! - Perfect for Tutorials and How To Vids!",
        "description": "Get the FREE practice media here: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2025-10-14T14:00:41Z",
        "url": "https://www.youtube.com/watch?v=Q1tCEvqakUo",
        "fetched_at": "2026-01-31T01:09:45.180252"
      },
      {
        "videoId": "_XySZQrHPCE",
        "title": "Steal This Easy Vlog Editing Workflow, It&#39;ll Simplify Everything",
        "description": "Get 2 extra months free on an annual plan from Motion Array https://geni.us/tEEoIY 🎞️ New to video editing? Learn the ...",
        "channelTitle": "Tamara Gabriel",
        "publishedAt": "2025-07-18T11:18:22Z",
        "url": "https://www.youtube.com/watch?v=_XySZQrHPCE",
        "fetched_at": "2026-01-31T01:09:45.180268"
      },
      {
        "videoId": "mjiT0g3mYgw",
        "title": "9 Editing Tips To Save HOURS in DaVinci Resolve!",
        "description": "9 Editing Tips in DaVinci Resolve you probably didn't know! In this DaVinci Resolve tutorial, I'm going to show you 9 powerful ...",
        "channelTitle": "Sightseeing Stan",
        "publishedAt": "2025-05-26T14:01:15Z",
        "url": "https://www.youtube.com/watch?v=mjiT0g3mYgw",
        "fetched_at": "2026-01-31T01:09:45.180264"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-31T01:09:45.570971"
      },
      {
        "videoId": "aEYZ76Mf2Zw",
        "title": "How to edit 10x faster in 5 minutes",
        "description": "Serious about video editing? - https://editingelite.com/?video=aEYZ76Mf2Zw More free advice for editors: ...",
        "channelTitle": "Flick Edits",
        "publishedAt": "2024-11-16T13:05:59Z",
        "url": "https://www.youtube.com/watch?v=aEYZ76Mf2Zw",
        "fetched_at": "2026-01-31T01:09:45.180279"
      },
      {
        "videoId": "HS9v0ZAw9Fk",
        "title": "Amateur VS Pro Video Editing Workflow",
        "description": "Uncover your 3 mistakes holding back your progress: https://unsplice.com/help Are you tired of your video editing projects taking ...",
        "channelTitle": "Unsplice",
        "publishedAt": "2024-10-09T17:00:18Z",
        "url": "https://www.youtube.com/watch?v=HS9v0ZAw9Fk",
        "fetched_at": "2026-01-31T01:09:45.180254"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-01-31T01:09:45.180224"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2026-01-31T01:09:45.180237"
      },
      {
        "videoId": "QIJPxeI--QQ",
        "title": "Effective Editing Workflow that can save you hours! Davinci Resolve Beginner Tips",
        "description": "Download the HeartSupport Media files here: https://www.groundcontrol.film/heartsupport And you can download my Keyboard ...",
        "channelTitle": "MrAlexTech",
        "publishedAt": "2024-05-27T22:41:51Z",
        "url": "https://www.youtube.com/watch?v=QIJPxeI--QQ",
        "fetched_at": "2026-01-31T01:09:45.180272"
      }
    ],
    "reddit": [
      {
        "id": "1q6omig",
        "title": "Upwork newbie here, just ran straight-up malware from a “client” project. What the actual f***",
        "selftext": "Burner account because I’m beyond embarrassed and absolutely pissed.\n\nI’m new to Upwork. First “client” I get sends me a Next.js project and says “just run it locally and see if it works.”\n\nThey sent **malware**.\n\nAnd not sloppy malware. This was *deliberately hidden*.\n\nThey buried heavily obfuscated JavaScript **at the very bottom of** `nextjs.config.js`, AFTER `module.exports`, under a massive wall of blank lines so you wouldn’t even scroll there. Like, this was 100% intentional.\n\nOnce I actually de-obfuscated it, here’s what it was capable of:\n\n\\- Full file system access\n\n\\- Detecting the user’s home directory\n\n\\- Dynamically constructing file paths\n\n\\- Reading any file it had permission to read\n\n\\- Base64-encoding file contents (to hide what’s being sent)\n\n\\- Sending that data out via POST requests to remote servers\n\nTranslation: **if you ran it, assume your machine was compromised.**\n\nIf you are new here:\n\n* NEVER run client code blindly\n* Obfuscated JS = malicious. There is no legit reason for it here.\n* If a client says “just test it locally,” stop and think\n\n  \nI’m posting this out of pure rage because I don’t want another new dev to learn this lesson the hard way like I did.",
        "subreddit": "freelance",
        "author": "Jaded-Journalist2470",
        "score": 951,
        "num_comments": 85,
        "created_utc": 1767813175.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1q6omig/upwork_newbie_here_just_ran_straightup_malware/",
        "fetched_at": "2026-01-31T01:09:52.746597"
      },
      {
        "id": "1qrc1bf",
        "title": "let our angriest customer redesign our dashboard. its now our best selling feature",
        "selftext": "so we had this customer who was extremely frustrated with us(asking for refunds / angry emails on serivce etc). every week they'd email support with another complaint. my cofounder wanted to just refund them and move on\n\ninstead i got on a call and asked if theyd be willing to show me exactly what they hated. turned into a 2 hour screen share where they basically roasted our entire product lol\n\nat some point i just said screw it and asked \"what if you designed it yourself? what would it look like?\"\n\nthey sent me back a excalidraw file the next hour. it was ugly as hell but honestly it was genius\n\nwe had all these charts and graphs and filters because we thought it looked professional. they replaced it with like 5 big numbers and a single button that said \"export for my boss\"\n\nshowed it to the team and there was silence. our lead designer was honestly kinda offended. but i pushed us to build it exactly as the customer spec'd it. took maybe a week\n\nthat angry customer became our biggest referral source. theyve sent us like 12 clients\n\nnow we do this regularly. every quarter we find our most frustrated user and give them way too much access. they roast us and we build whatever they ask for\n\nturns out the people who complain the most are just the ones who care the most\n\nanyone else ever let customers dictate product decisions like this? curious if its worked for others",
        "subreddit": "Entrepreneur",
        "author": "BakerTheOptionMaker",
        "score": 566,
        "num_comments": 45,
        "created_utc": 1769794356.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1qrc1bf/let_our_angriest_customer_redesign_our_dashboard/",
        "fetched_at": "2026-01-31T01:09:46.186001"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 495,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-31T01:09:52.746573"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 451,
        "num_comments": 135,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-31T01:09:52.746634"
      },
      {
        "id": "1qaobz3",
        "title": "I scraped 200k+ Reddit posts to find out the best way to get your first freelance client. Here is what I found:",
        "selftext": "Hi everyone,\n\nLike many of you, when I started looking for clients, I was overwhelmed by anecdotal advice: \"Just cold email,\" \"Use Upwork,\" \"Network in person.\" I wanted to know what actually works.\n\nSo, I built a scraper to analyze the archives of r/freelance, r/upwork, r/webdev, and several other freelance subreddits. I processed over 200,000 posts and comments, used AI to filter for relevant information, and normalized the data to find out exactly how people got their first client and how long it took.\n\nHere are the key findings from the data:\n\n* In-Person is King (Speed-wise): The median time to land a client via In-Person Cold Outreach was just 1.5 days. It seems the \"uncomfortable\" work of showing up physically builds trust faster than anything else.\n* The \"Cold\" Hierarchy: If you are doing cold outreach, the medium matters significantly: In-Person > Cold Calling > DMs > Cold Emailing. Cold emailing was the least effective and slowest of the direct methods in the dataset.\n* Free Work Works: Offering free work seems to be one of the fastest ways to convert to a paying client, likely because it removes the initial friction.\n\nOverall, the median time to find a first client was around 21 days, not bad at all!\n\nMethodology & Data Constraints:\n\nWhile this analysis provides valuable insights, it is important to acknowledge the constraints of the data:\n\n* Source Bias: Data is sourced from Reddit communities, which may skew towards specific types of freelancers and experiences.\n* Self-Reporting: Timelines are based on user recollection, which can be subjective.\n* Survivorship Bias: Successful freelancers are more likely to share their stories than those who did not find clients.\n* Sample Size: While 4,000+ leads were identified, only \\~1,000 contained explicit \"time to first client\" data.\n\nThe archives I processed were from 2024. I am currently processing 2025 data and adding more subreddits, which should double or triple the number of leads and provide more accurate results.\n\nFull data if you want to look at it yourself : [Google Sheets](https://docs.google.com/spreadsheets/d/1cLCiQWlPsE3TXA7QE8I-oXyvR7Y1wfUOvj1G8289RmI/edit?usp=sharing)\n\nI'm curious, does this match your experience? Did in-person outreach work faster for you than online methods?\n\n**EDIT:** Reverified some data today; the \"free work\" category had fewer datapoints than I thought, and the AI hallucinated a bit. Since it's \"free work,\" it didn't know whether it needed to find time until the first paying client or time until the first free client. I expect it to probably take a bit more time than 7 days and maybe **bring in** several clients at once.\n\nAlso tried to look if a lot of spam got through (i.e., people just creating posts to advertise a product) and honestly, not a lot; I only saw one so far.\n\n**->** Sadly, I can't update images. The conclusions still seem to be holding up at least—I hope it's not confirmation bias. I will let you know more for sure with the new data.",
        "subreddit": "freelance",
        "author": "Tryhard_314",
        "score": 214,
        "num_comments": 75,
        "created_utc": 1768201888.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qaobz3/i_scraped_200k_reddit_posts_to_find_out_the_best/",
        "fetched_at": "2026-01-31T01:09:52.746595"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 172,
        "num_comments": 51,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-31T01:09:52.746615"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 161,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-31T01:09:52.746613"
      },
      {
        "id": "1qr9css",
        "title": "We sold our SaaS startup for $15M in 18 months. Here's exactly how we did it.",
        "selftext": "I'm a PM at [telos](https://www.telos-ai.org) now, but before this I was the founding engineer at a startup that sold for $15M in 18 months. Sharing bc I think this is relevant for founders here.\n\nThe founders had been running this playbook for years. One had 8 successful exits, the other had 3. When they hired me, they told me exactly how it would go. I was skeptical, but it worked exactly as they said.\n\nHere's the playbook:\n\n**Step 1: Pick a legacy industry (this is the most important step)**\n\nFind an industry as far from Silicon Valley as possible. The key criteria: customers and competitors should not be able to build anything themselves. Ideally, you or your co founder has domain expertise. If you don't, find a co founder who does\n\nWe sold to benefits brokers, the people who handle 401(k)s and HSAs. Other good verticals: oil and gas, medical SaaS, logistics, construction tech.\n\nWhat to avoid: anything where your customers are technical. Dev tools would be a terrible choice. If your buyer can look at your product and think \"I could build this,\" you're in the wrong market.\n\n**Step 2: Build a product and raise money, but not for the reasons you think**\n\nThe uncomfortable truth: the product doesn't have to be great. You shouldn't waste too much time making it perfect. The product is the least important part of this playbook.\n\nWhat matters is legitimacy & credibility. Raising money signals to people in these industries that you're a real company, not two people in a garage. Most people in legacy industries don't know Sequoia from some random angel syndicate, so don't waste time chasing name-brand VCs. Just raise around $1M and move on.\n\nHiring a few people also helps. It makes you look like a \"real\" company. The whole point here is building trust and brand recognition within the industry.\n\n**Step 3: Sign design partnerships with potential acquirers**\n\nI know most people on the internet advise against design partnerships, but for this playbook they're essential, with one critical caveat: your design partners need to be companies that could eventually acquire you.\n\nWe partnered with 4 big names in the employee benefits space. If you can, get them to invest in your company. Give their CEOs board seats. You're not optimizing for product feedback here. You're optimizing for relationships and positioning.\n\n**Step 4: Build deep rapport over 12+ months**\n\nThis is the step that takes the longest, but it's what makes everything else work.\n\nOur CEO was talking to all 4 design partner CEOs on a weekly basis. You need to understand what initiatives they have going on, what they care about, what keeps them up at night. You need to become a trusted advisor, someone they see as a technology expert who actually understands their space.\n\nIf these companies have subsidiaries, start meeting with them too. Cast a wide net within the org.\n\nWhile this is happening, you can talk to other customers and generate some revenue, but honestly, revenue is the least important metric in this playbook.\n\n**Step 5: Identify the opportunity**\n\nIf you've done steps 1 through 4 correctly, this part is actually easy.\n\nIn our case, one of our design partners had a subsidiary that grew rapidly. They suddenly needed an AI solution to handle some stuff around the benefits they were selling. What they needed was adjacent to our product, but not exactly what we built.\n\nThis is the sweet spot. They had a problem. We had the team, the trust, and enough product to be credible.\n\nInstead of offering to build them a feature, we offered to sell them the whole company. If you can create this dynamic with multiple design partners at once, even better. Deal heat is real.\n\n**Step 6: Close**\n\nCall it an acqui-hire, call it a quick sale, whatever. Close the deal.\n\nYou'll probably need to stay on afterward to build the solution you discussed, but that's fine. You just sold your company for 8 figures.\n\nTL;DR\n\n1. Go into a narrow legacy industry where buyers can't build\n2. Build credibility as a tech expert and domain expert\n3. Sign design partners who could be acquirers\n4. Build deep rapport over 12+ months\n5. Identify an adjacent opportunity\n6. Sell the company, not a feature\n\nI know this seems counterintuitive. This playbook basically does everything most people online advise against. Don't obsess over product. Don't focus on revenue. Do design partnerships. Optimize for relationships over growth.\n\nIf you're trying to build a billion dollar company, this is NOT the playbook for you. Many people here are swinging for that, and that's great. But if you want a low 8-figure exit in under 2 years, this works. I've seen it with my own eyes.\n\nHappy to answer questions.",
        "subreddit": "SaaS",
        "author": "rdizzy1234",
        "score": 125,
        "num_comments": 68,
        "created_utc": 1769788699.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1qr9css/we_sold_our_saas_startup_for_15m_in_18_months/",
        "fetched_at": "2026-01-31T01:09:47.751457"
      },
      {
        "id": "1qcsxvv",
        "title": "How I’m trying to build and maintain a “rainy day” fund as a freelancer",
        "selftext": "I do a mix of photography and digital art, so my income is all over the place. Some months are stacked with shoots, edits, and commissions. Other months it’s quiet in a way that makes you question every life choice.  \nNow I'm treating the rainy day fund less like a savings goal and more like part of the workflow.  \nWhen a payment comes in, I move a small percentage out immediately, even if it feels almost pointless on slower months. On good months, I don’t get aggressive or try to “catch up,” I just keep the same rule and let the volume do the work. That way I’m not making emotional decisions based on how busy I feel that week.  \nI also stopped framing it as money I’m not allowed to touch. It’s there for exactly the stuff that always happens as a freelancer. A client pushing a payment. A camera repair. A dry couple of weeks. If I dip into it, the only rule is that I slowly rebuild it once things pick back up, no guilt spiral attached. It’s still imperfect, but it’s the first system that doesn’t fall apart the second my schedule does. For context, I keep the rainy day money in the same place my freelance income lands. I use karat, but the main thing is just keeping it out of my personal spending flow.\n\nWould love to hear how other freelancers here handle their rainy day fund, especially if your work swings between creative and digital like mine.",
        "subreddit": "freelance",
        "author": "Historical_Bug_6870",
        "score": 97,
        "num_comments": 48,
        "created_utc": 1768410555.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qcsxvv/how_im_trying_to_build_and_maintain_a_rainy_day/",
        "fetched_at": "2026-01-31T01:09:52.746591"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 96,
        "num_comments": 48,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2026-01-31T01:09:52.746611"
      }
    ]
  }
}