{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-04T16:14:27.110986"
  },
  "data": {
    "youtube": [
      {
        "videoId": "xrX0l99LKAg",
        "title": "BOOKKEEPING BASICS for Small Business Owners: Do THIS Now!",
        "description": "Learn the bookkeeping basics for business owners and beginners. Get a Free Consultation: https://mycpacoach.com/contact/ QBO ...",
        "channelTitle": "Sherman - My CPA Coach",
        "publishedAt": "2025-10-27T21:59:32Z",
        "url": "https://www.youtube.com/watch?v=xrX0l99LKAg",
        "fetched_at": "2026-01-04T16:14:18.829652"
      },
      {
        "videoId": "24TFLVCceiQ",
        "title": "The Only BOOKKEEPING Tutorial You Need 2025 | For Beginners",
        "description": "Bookkeeping for beginners (2025) explained in under a minute, then a complete step-by-step tutorial. This is a 2 hour free course ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2025-10-02T18:18:19Z",
        "url": "https://www.youtube.com/watch?v=24TFLVCceiQ",
        "fetched_at": "2026-01-04T16:14:18.829633"
      },
      {
        "videoId": "9a04BsKv26M",
        "title": "Top 5 Accounting Software for Small Business (2026 Guide)",
        "description": "My top 5 Accounting Software for Small Businesses. In this updated Bookkeeping software guide, I share my top 5 online ...",
        "channelTitle": "Stewart Gauld",
        "publishedAt": "2025-08-27T11:30:07Z",
        "url": "https://www.youtube.com/watch?v=9a04BsKv26M",
        "fetched_at": "2026-01-04T16:14:18.829647"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2026-01-04T16:14:18.829622"
      },
      {
        "videoId": "q_UPVaJL5WA",
        "title": "The Truth About STARTING a Bookkeeping Business in 2025",
        "description": "Ready to pick one niche, get unstuck and get clients to ogrow your business faster? Grab the Profit Booster 1000 Niches PDF + ...",
        "channelTitle": "The Bookkeeping Shop",
        "publishedAt": "2025-05-14T17:30:24Z",
        "url": "https://www.youtube.com/watch?v=q_UPVaJL5WA",
        "fetched_at": "2026-01-04T16:14:18.829644"
      },
      {
        "videoId": "JEAkQLMxqtw",
        "title": "How to Set Up Your Books as a New Business Owner",
        "description": "Bookkeeping doesn't have to be scary—and getting it right from day one can save you major headaches down the road. In this ...",
        "channelTitle": "Mark J Kohler",
        "publishedAt": "2025-04-29T21:54:58Z",
        "url": "https://www.youtube.com/watch?v=JEAkQLMxqtw",
        "fetched_at": "2026-01-04T16:14:18.829628"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-04T16:14:18.829616"
      },
      {
        "videoId": "Kb_x8MxKQ5w",
        "title": "What is the best accounting software for small businesses in 2025?",
        "description": "What is the best accounting software for small businesses in 2025? In this video, I am walking through 3 of my favourite ...",
        "channelTitle": "Jamie Trull",
        "publishedAt": "2024-12-04T18:00:12Z",
        "url": "https://www.youtube.com/watch?v=Kb_x8MxKQ5w",
        "fetched_at": "2026-01-04T16:14:18.829655"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2026-01-04T16:14:18.829630"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-01-04T16:14:18.342665"
      }
    ],
    "reddit": [
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 495,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-04T16:14:26.109635"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 451,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-04T16:14:26.109681"
      },
      {
        "id": "1q3d1lc",
        "title": "To all the rich ($10 million +) entrepreneurs, how long was it before your business turned a profit?",
        "selftext": "How long before you starting making money? ",
        "subreddit": "Entrepreneur",
        "author": "facemacintyre",
        "score": 214,
        "num_comments": 149,
        "created_utc": 1767491731.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1q3d1lc/to_all_the_rich_10_million_entrepreneurs_how_long/",
        "fetched_at": "2026-01-04T16:14:19.411442"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 168,
        "num_comments": 43,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-04T16:14:26.109661"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 156,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-04T16:14:26.109659"
      },
      {
        "id": "1px5iot",
        "title": "The moment a DM quietly stops being “just a question” and starts being unpaid work",
        "selftext": "I’ve noticed something repeat over and over in freelance DMs.\n\nSomeone reaches out with a small question. You answer thoughtfully. They respond with appreciation. Then they follow up with another “quick thing.” Then another. At some point you realize you’re effectively consulting for free, but it feels awkward to interrupt because nothing explicitly changed.\n\nWhat took me a long time to see is that the shift isn’t emotional, it’s linguistic.\n\nEarly messages sound exploratory. Later messages start narrowing scope. They reference specific sections. They assume continuation. The person isn’t asking *if* you can help anymore, they’re implicitly assigning you work.\n\nOnce I started paying attention to the language instead of the vibe, setting boundaries stopped feeling as awkward for me. The conversation had already moved. I just hadn’t noticed.\n\nCurious if others have noticed the same thing or how you handle that transition without killing the relationship.",
        "subreddit": "freelance",
        "author": "MentalAdversity",
        "score": 101,
        "num_comments": 39,
        "created_utc": 1766861794.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1px5iot/the_moment_a_dm_quietly_stops_being_just_a/",
        "fetched_at": "2026-01-04T16:14:26.109646"
      },
      {
        "id": "1q35u3m",
        "title": "How to validate a startup idea with paid ads before building anything",
        "selftext": "I don't like customer interviews. People nod along because saying \"I don't need this\" to your face is awkward.\n\nSo I ran Google Ads instead.\n\nHad 3 ideas:\n\n* AI voice assistant for dental clinics\n* Patient scheduling for orthopedic practices\n* Appointment reminders for physiotherapy clinics\n\n**The setup:**\n\nI'm in India so budget is tight. Used free trials for everything except the ad spend.\n\n* Lovable for landing pages (free trial)\n* Tally for email forms (free)\n* Hotjar for heatmaps (free tier)\n* Ryze AI to create and launch the ads (free trial)\n\nJust pointed everything at each other and let it run. Didn't configure much.\n\n**What I learned matters:**\n\n* One CTA only. Just the email field. The moment you add \"learn more\" or \"see features\" you're muddying your data.\n* Track the thank you page, not the button click. Someone clicking submit isn't a signup. Someone landing on the confirmation page is.\n* Keep the page dead simple. No navigation, no footer links, nowhere to go except sign up or leave.\n\n**Keywords:**\n\nFor keywords I focused on high intent. If someone's searching pricing or comparing options, they're already shopping.\n\nGood: \"dental answering service pricing\", \"after hours answering for dentists\"\n\nBad: \"dental software\", \"clinic management\", \"healthcare AI\"\n\n**Results after 2 weeks ($72 spend):**\n\nDental: 22 signups (14.1% conversion) Ortho: 4 signups (4.5% conversion) Physio: 7 signups (5.9% conversion)\n\nDental got 5x more signups than ortho. Same spend. Same setup. Just different markets.\n\nBuilding dental now.",
        "subreddit": "SaaS",
        "author": "Healthy_Video_956",
        "score": 96,
        "num_comments": 27,
        "created_utc": 1767473653.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1q35u3m/how_to_validate_a_startup_idea_with_paid_ads/",
        "fetched_at": "2026-01-04T16:14:21.043326"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 90,
        "num_comments": 38,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2026-01-04T16:14:26.109657"
      },
      {
        "id": "1q3cggs",
        "title": "My only joy in life is Entrepreneurship",
        "selftext": "I think I have slowly become in a state where Entrepreneurship is my whole identity. Like when I talk to people if it ain't about Entrepreneurship I have nothing to talk about so I am a really boring person. I am not proud of what I have become but nothing excites me more than Entrepreneurship so games get boring, even social media becomes boring, sort of everything. Anyone who has ever had this problem and how they overcame this identity addiction please give me some advice. Thank you\n\nEdit: Thanks you guys for the concern and advices. I just want to let you guys know that I like Entrepreneurship not for the money but the joy of building. The reason I made this post is because I noticed myself being a boring person with no hobbies but Entrepreneurship. Hence, I wanted to ask advices on hobbies similar in likes of Entrepreneurship or something that I can engage as much fun in Entrepreneurship. Thanks!",
        "subreddit": "Entrepreneur",
        "author": "PlsStarlinkIneedwifi",
        "score": 77,
        "num_comments": 55,
        "created_utc": 1767490151.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1q3cggs/my_only_joy_in_life_is_entrepreneurship/",
        "fetched_at": "2026-01-04T16:14:19.411446"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 73,
        "num_comments": 28,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2026-01-04T16:14:26.109679"
      }
    ]
  }
}