{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-14T01:05:15.064012"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-14T01:05:06.675691"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-01-14T01:05:06.214839"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2026-01-14T01:05:06.214859"
      },
      {
        "videoId": "HdvTO9rvSm4",
        "title": "Best YouTube Editing Workflow in 2024! - DaVinci Resolve Video Editing Tips!",
        "description": "9 Nodes Workshop: https://www.groundcontrol.film/9-nodes-workshop — FREE Fusion Mini Course: ...",
        "channelTitle": "Casey Faris",
        "publishedAt": "2024-01-27T14:30:04Z",
        "url": "https://www.youtube.com/watch?v=HdvTO9rvSm4",
        "fetched_at": "2026-01-14T01:05:06.214852"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2026-01-14T01:05:06.214855"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2026-01-14T01:05:06.675688"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2026-01-14T01:05:06.675693"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2026-01-14T01:05:06.675696"
      },
      {
        "videoId": "Si9lLGDPwv8",
        "title": "The BEST Editing WORKFLOW in Adobe Premiere Pro",
        "description": "https://prba.link/LearnAfterEffects - Learn about the best start to finish editing workflow to have in Adobe Premiere pro in this ...",
        "channelTitle": "Premiere Basics",
        "publishedAt": "2021-04-28T12:53:25Z",
        "url": "https://www.youtube.com/watch?v=Si9lLGDPwv8",
        "fetched_at": "2026-01-14T01:05:06.214857"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2026-01-14T01:05:06.675677"
      }
    ],
    "reddit": [
      {
        "id": "1q6omig",
        "title": "Upwork newbie here, just ran straight-up malware from a “client” project. What the actual f***",
        "selftext": "Burner account because I’m beyond embarrassed and absolutely pissed.\n\nI’m new to Upwork. First “client” I get sends me a Next.js project and says “just run it locally and see if it works.”\n\nThey sent **malware**.\n\nAnd not sloppy malware. This was *deliberately hidden*.\n\nThey buried heavily obfuscated JavaScript **at the very bottom of** `nextjs.config.js`, AFTER `module.exports`, under a massive wall of blank lines so you wouldn’t even scroll there. Like, this was 100% intentional.\n\nOnce I actually de-obfuscated it, here’s what it was capable of:\n\n\\- Full file system access\n\n\\- Detecting the user’s home directory\n\n\\- Dynamically constructing file paths\n\n\\- Reading any file it had permission to read\n\n\\- Base64-encoding file contents (to hide what’s being sent)\n\n\\- Sending that data out via POST requests to remote servers\n\nTranslation: **if you ran it, assume your machine was compromised.**\n\nIf you are new here:\n\n* NEVER run client code blindly\n* Obfuscated JS = malicious. There is no legit reason for it here.\n* If a client says “just test it locally,” stop and think\n\n  \nI’m posting this out of pure rage because I don’t want another new dev to learn this lesson the hard way like I did.",
        "subreddit": "freelance",
        "author": "Jaded-Journalist2470",
        "score": 903,
        "num_comments": 71,
        "created_utc": 1767813175.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1q6omig/upwork_newbie_here_just_ran_straightup_malware/",
        "fetched_at": "2026-01-14T01:05:14.062657"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 495,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-14T01:05:14.062643"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 448,
        "num_comments": 134,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-14T01:05:14.062699"
      },
      {
        "id": "1qc0cwd",
        "title": "I scraped 48,000 court filings to stop guessing business ideas. Here are 3 \"boring\" niches bleeding $100k+.",
        "selftext": "I got tired of the \"startup lottery\". I spent 2 years building tools nobody wanted because I was solving annoyances, not liabilities.\n\nSo last month, I ran an experiment. I burned **$5,000 in API credits** to automate \"Market Research\". Instead of asking AI for ideas, I forced it to scrape US District Court filings and regulatory fine trackers to find where companies are *legally forced* to lose money.\n\n**The Logic:** If a business is paying a fine or settling a lawsuit, they aren't looking for a \"nice-to-have\" tool. They are looking for a tourniquet.\n\nI analyzed **48,000 data points**. Here are 3 patterns of \"Invisible Bleeds\" I found that are wide open for B2B solutions:\n\n**1. The \"Solar Paperwork\" Bleed ($100k+ Losses)** Solar installers are losing massive revenue on rejected warranty claims. Why? Field techs forget to geotag photos or upload serial numbers.\n\n* **The Opportunity:** A simple \"Field Verification Service\" (or app) that audits data before submission.\n* **The Metric:** One prevented rejection saves them \\~$12k.\n\n**2. The \"ADA\" Bleed ($6.9B Industry Loss)** E-commerce stores are getting hit with 4,000+ accessibility lawsuits annually. Average settlement: $20k-$50k.\n\n* **The Opportunity:** Don't sell \"better UX\". Sell \"Liability Shield Audits\".\n* **The Metric:** Fear of a lawsuit converts 10x better than \"conversion optimization\".\n\n**3. The \"Stitching\" Bleed (Manufacturing)** Mid-size apparel brands write off **$1M-$3M/year** on returns due to specific assembly defects manual QC misses.\n\n* **The Opportunity:** Automated QC / Computer Vision implementation.\n\n**The Lesson:** Stop brainstorming \"clever\" ideas. Go to Pacer (court records) or OSHA databases. Look for the fine. Look for the lawsuit. If you find where money is leaving involuntarily, you have found a business.\n\nI’m currently cleaning the full dataset of 3,700 verified US gaps. It's messy, but it beats guessing.\n\n**What’s the most \"boring\" expensive problem you’ve ever seen a company pay to fix?**",
        "subreddit": "Entrepreneur",
        "author": "Ogretribe",
        "score": 394,
        "num_comments": 150,
        "created_utc": 1768331713.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1qc0cwd/i_scraped_48000_court_filings_to_stop_guessing/",
        "fetched_at": "2026-01-14T01:05:07.374943"
      },
      {
        "id": "1qb88zv",
        "title": "My friend started selling the same product 2 days after I did",
        "selftext": "\nI’m just a little upset because I made and sold mini cakes for the first time in school on Friday, and they were sold out and it was great. And one of my decently closed friends was like “oh I want to sell the things I made like you.” I didn’t take much attention on that sentence until today when she posted on her story, the exact same flavor and piping of the mini cakes I made… I literally had to double take and I thought I was going insane. She also sold them for a dollar more than I did, she also sold out and I just feel so beat down. We eat lunch with a group together and she was talking about how she’s such a great entrepreneur and since she’s so successful she’s going to sell every single week, and talking about her future flavors and I kinda just stayed silent.. what am I supposed to do with this situation? :(( should I keep going or just don’t bother selling again? Should I keep my prices the same or up it to be the same as hers? I’m really lost. ",
        "subreddit": "smallbusiness",
        "author": "Spirited_Ad3624",
        "score": 296,
        "num_comments": 243,
        "created_utc": 1768254193.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1qb88zv/my_friend_started_selling_the_same_product_2_days/",
        "fetched_at": "2026-01-14T01:05:12.351970"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 172,
        "num_comments": 46,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-14T01:05:14.062677"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 154,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-14T01:05:14.062675"
      },
      {
        "id": "1qaobz3",
        "title": "I scraped 200k+ Reddit posts to find out the best way to get your first freelance client. Here is what I found:",
        "selftext": "Hi everyone,\n\nLike many of you, when I started looking for clients, I was overwhelmed by anecdotal advice: \"Just cold email,\" \"Use Upwork,\" \"Network in person.\" I wanted to know what actually works.\n\nSo, I built a scraper to analyze the archives of r/freelance, r/upwork, r/webdev, and several other freelance subreddits. I processed over 200,000 posts and comments, used AI to filter for relevant information, and normalized the data to find out exactly how people got their first client and how long it took.\n\nHere are the key findings from the data:\n\n* In-Person is King (Speed-wise): The median time to land a client via In-Person Cold Outreach was just 1.5 days. It seems the \"uncomfortable\" work of showing up physically builds trust faster than anything else.\n* The \"Cold\" Hierarchy: If you are doing cold outreach, the medium matters significantly: In-Person > Cold Calling > DMs > Cold Emailing. Cold emailing was the least effective and slowest of the direct methods in the dataset.\n* Free Work Works: Offering free work seems to be one of the fastest ways to convert to a paying client, likely because it removes the initial friction.\n\nOverall, the median time to find a first client was around 21 days, not bad at all!\n\nMethodology & Data Constraints:\n\nWhile this analysis provides valuable insights, it is important to acknowledge the constraints of the data:\n\n* Source Bias: Data is sourced from Reddit communities, which may skew towards specific types of freelancers and experiences.\n* Self-Reporting: Timelines are based on user recollection, which can be subjective.\n* Survivorship Bias: Successful freelancers are more likely to share their stories than those who did not find clients.\n* Sample Size: While 4,000+ leads were identified, only \\~1,000 contained explicit \"time to first client\" data.\n\nThe archives I processed were from 2024. I am currently processing 2025 data and adding more subreddits, which should double or triple the number of leads and provide more accurate results.\n\nFull data if you want to look at it yourself : [Google Sheets](https://docs.google.com/spreadsheets/d/1cLCiQWlPsE3TXA7QE8I-oXyvR7Y1wfUOvj1G8289RmI/edit?usp=sharing)\n\nI'm curious, does this match your experience? Did in-person outreach work faster for you than online methods?\n\n**EDIT:** Reverified some data today; the \"free work\" category had fewer datapoints than I thought, and the AI hallucinated a bit. Since it's \"free work,\" it didn't know whether it needed to find time until the first paying client or time until the first free client. I expect it to probably take a bit more time than 7 days and maybe **bring in** several clients at once.\n\nAlso tried to look if a lot of spam got through (i.e., people just creating posts to advertise a product) and honestly, not a lot; I only saw one so far.\n\n**->** Sadly, I can't update images. The conclusions still seem to be holding up at least—I hope it's not confirmation bias. I will let you know more for sure with the new data.",
        "subreddit": "freelance",
        "author": "Tryhard_314",
        "score": 121,
        "num_comments": 43,
        "created_utc": 1768201888.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qaobz3/i_scraped_200k_reddit_posts_to_find_out_the_best/",
        "fetched_at": "2026-01-14T01:05:14.062654"
      },
      {
        "id": "1px5iot",
        "title": "The moment a DM quietly stops being “just a question” and starts being unpaid work",
        "selftext": "I’ve noticed something repeat over and over in freelance DMs.\n\nSomeone reaches out with a small question. You answer thoughtfully. They respond with appreciation. Then they follow up with another “quick thing.” Then another. At some point you realize you’re effectively consulting for free, but it feels awkward to interrupt because nothing explicitly changed.\n\nWhat took me a long time to see is that the shift isn’t emotional, it’s linguistic.\n\nEarly messages sound exploratory. Later messages start narrowing scope. They reference specific sections. They assume continuation. The person isn’t asking *if* you can help anymore, they’re implicitly assigning you work.\n\nOnce I started paying attention to the language instead of the vibe, setting boundaries stopped feeling as awkward for me. The conversation had already moved. I just hadn’t noticed.\n\nCurious if others have noticed the same thing or how you handle that transition without killing the relationship.",
        "subreddit": "freelance",
        "author": "MentalAdversity",
        "score": 117,
        "num_comments": 59,
        "created_utc": 1766861794.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1px5iot/the_moment_a_dm_quietly_stops_being_just_a/",
        "fetched_at": "2026-01-14T01:05:14.062659"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 96,
        "num_comments": 44,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2026-01-14T01:05:14.062671"
      }
    ]
  }
}