{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-05T08:21:31.975961"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-05T08:21:23.134490"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-01-05T08:21:22.924698"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2026-01-05T08:21:22.924714"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2026-01-05T08:21:23.134493"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2026-01-05T08:21:22.924709"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2026-01-05T08:21:23.134486"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2026-01-05T08:21:23.134496"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2026-01-05T08:21:22.924716"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2026-01-05T08:21:23.134475"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2026-01-05T08:21:22.924712"
      }
    ],
    "reddit": [
      {
        "id": "1q491y1",
        "title": "My cofounder quit last month. I found out why yesterday.",
        "selftext": "We started this company together 3 years ago. For context, we're best friends since college and we were going to build something great. You know, change the world and all that naive stuff.\n\nLast month, he told me he was leaving. He said he had an opportunity he couldn't pass up. It was a job at Google and he was given the usual - stability, benefits, stock.\n\nI understood. I was hurt but I understood. We all know that this entrep shit is hard. Not everyone can do it forever and so I said no hard feelings and I meant it.\n\nBut yesterday, his wife texted me. She said she wanted me to know the real reason he left.\n\nHe'd been having panic attacks for 6 months. Every Sunday night he would lock himself in the bathroom and cry. He'd lost 20 pounds because he couldn't eat from the anxiety. He was seeing a therapist twice a week and it wasn't enough.\n\nShe said \"he didn't want to tell you because he thought you'd think he was weak. But I think you deserve to know what this was doing to him.\"\n\nI really sat with that message for a long time.\n\nWe were in this together and I had no idea he was drowning. He smiled on our Zoom calls and said things were fine. He kept working and the whole time he was falling apart.\n\nI keep thinking about all the times I pushed harder. \"We just need to get through this quarter.\" \"This is the hard part, it gets easier.\" \"We're so close.\"\n\nWas I the reason he was having panic attacks?\n\nOut from this, I called him last night. We talked for 2 hours. I apologized for not seeing it. He apologized for not telling me. We both cried.\n\nHe said something that I keep thinking about. He said \"I wanted it to work so badly that I forgot to check if I was okay.\"\n\nI'm still going to build this company but I'm going to do something I've never done. I'm going to actually pay attention to how I'm doing - me. \n\nBecause what's the point of building something if you destroy yourself in the process?",
        "subreddit": "Entrepreneur",
        "author": "kubrador",
        "score": 1534,
        "num_comments": 162,
        "created_utc": 1767579203.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1q491y1/my_cofounder_quit_last_month_i_found_out_why/",
        "fetched_at": "2026-01-05T08:21:23.923277"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 495,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-05T08:21:30.974600"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 445,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-05T08:21:30.974653"
      },
      {
        "id": "1q3d1lc",
        "title": "To all the rich ($10 million +) entrepreneurs, how long was it before your business turned a profit?",
        "selftext": "How long before you starting making money? ",
        "subreddit": "Entrepreneur",
        "author": "facemacintyre",
        "score": 299,
        "num_comments": 208,
        "created_utc": 1767491731.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1q3d1lc/to_all_the_rich_10_million_entrepreneurs_how_long/",
        "fetched_at": "2026-01-05T08:21:23.923330"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 168,
        "num_comments": 43,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-05T08:21:30.974629"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 157,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-05T08:21:30.974627"
      },
      {
        "id": "1q3yzex",
        "title": "No one talks about how mentally crushing it is seeing your peers matriculate into careers while trying to build a business that still has zero results",
        "selftext": "Does anyone else feel this way? 24M, I graduated with a bachelors in biology and minor in chemistry. I was originally going to apply to medical school and become a physician, but I've always been an entrepreneur at heart trying to focus on my personal brand. 2 years out of college now, while I've made decent money, ive reinvested everything back into my brand, and currently this year, my business is failing compared to year 1. Seeing all my friends become doctors, nurses, etc. while Im this unemployed 24 year old trying to make his dreams work is just crushing. I feel like im absolutely worthless.",
        "subreddit": "Entrepreneur",
        "author": "Pristine_Finger_2178",
        "score": 130,
        "num_comments": 97,
        "created_utc": 1767554745.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1q3yzex/no_one_talks_about_how_mentally_crushing_it_is/",
        "fetched_at": "2026-01-05T08:21:23.923282"
      },
      {
        "id": "1px5iot",
        "title": "The moment a DM quietly stops being “just a question” and starts being unpaid work",
        "selftext": "I’ve noticed something repeat over and over in freelance DMs.\n\nSomeone reaches out with a small question. You answer thoughtfully. They respond with appreciation. Then they follow up with another “quick thing.” Then another. At some point you realize you’re effectively consulting for free, but it feels awkward to interrupt because nothing explicitly changed.\n\nWhat took me a long time to see is that the shift isn’t emotional, it’s linguistic.\n\nEarly messages sound exploratory. Later messages start narrowing scope. They reference specific sections. They assume continuation. The person isn’t asking *if* you can help anymore, they’re implicitly assigning you work.\n\nOnce I started paying attention to the language instead of the vibe, setting boundaries stopped feeling as awkward for me. The conversation had already moved. I just hadn’t noticed.\n\nCurious if others have noticed the same thing or how you handle that transition without killing the relationship.",
        "subreddit": "freelance",
        "author": "MentalAdversity",
        "score": 104,
        "num_comments": 40,
        "created_utc": 1766861794.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1px5iot/the_moment_a_dm_quietly_stops_being_just_a/",
        "fetched_at": "2026-01-05T08:21:30.974612"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 92,
        "num_comments": 38,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2026-01-05T08:21:30.974624"
      },
      {
        "id": "1pa0pwu",
        "title": "Client refusing payment after major upgrades — should I wipe the servers or dispute?",
        "selftext": "Hey,  \n  \nI agreed with a client to work on his project and fix several issues. While I was working locally on my machine, his live website got hacked, so he asked me to recover his old server. I did recover it, but because of the security breach I told him that just fixing a few issues wouldn’t be enough — we needed to upgrade everything.\n\nSo I upgraded his website from **Laravel 5 → Laravel 11** and **Nova 4 → Nova 5**, created **two new servers** (the original also had two for old apps/functions), installed **cPanel**, and updated all systems for security and stability.\n\nAfter that, I continued working on his original project scope and also asked him to open a new milestone for the additional work. Now he is saying that he “doesn’t see progress” and that “nothing works,” even though I’ve completed around **90% of the original scope + new scope**.\n\nThis is happening on Freelancer.com. If he wins the dispute, I might even have to pay an additional **$100**, which is insane. Has anyone dealt with this before? Is it better to delete the work on the two servers or keep everything as is and try my luck with the dispute?\n\nAny advice or similar experiences would help.\n\nThanks..",
        "subreddit": "freelance",
        "author": "BryarGh",
        "score": 71,
        "num_comments": 28,
        "created_utc": 1764452737.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pa0pwu/client_refusing_payment_after_major_upgrades/",
        "fetched_at": "2026-01-05T08:21:30.974650"
      }
    ]
  }
}