{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-02-16T08:36:11.385803"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-02-16T08:36:02.977094"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-02-16T08:36:02.632733"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2026-02-16T08:36:02.632748"
      },
      {
        "videoId": "Gua2Bo_G-J0",
        "title": "The ACCOUNTING BASICS for BEGINNERS",
        "description": "Accounting is the process of recording, organizing, understanding, reporting on, and analyzing financial information of a business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2023-08-24T20:30:01Z",
        "url": "https://www.youtube.com/watch?v=Gua2Bo_G-J0",
        "fetched_at": "2026-02-16T08:36:02.977096"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2026-02-16T08:36:02.632744"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2026-02-16T08:36:02.977090"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2026-02-16T08:36:02.977092"
      },
      {
        "videoId": "o5ENktjJ0Rc",
        "title": "Video Editing Workflow | File Management",
        "description": "Here is my video editing workflow when it comes to video project file management. Having a good file structure is extremely ...",
        "channelTitle": "Andrik Langfield",
        "publishedAt": "2021-06-10T15:00:20Z",
        "url": "https://www.youtube.com/watch?v=o5ENktjJ0Rc",
        "fetched_at": "2026-02-16T08:36:02.632750"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2026-02-16T08:36:02.977079"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2026-02-16T08:36:02.632747"
      }
    ],
    "reddit": [
      {
        "id": "1q6omig",
        "title": "Upwork newbie here, just ran straight-up malware from a “client” project. What the actual f***",
        "selftext": "Burner account because I’m beyond embarrassed and absolutely pissed.\n\nI’m new to Upwork. First “client” I get sends me a Next.js project and says “just run it locally and see if it works.”\n\nThey sent **malware**.\n\nAnd not sloppy malware. This was *deliberately hidden*.\n\nThey buried heavily obfuscated JavaScript **at the very bottom of** `nextjs.config.js`, AFTER `module.exports`, under a massive wall of blank lines so you wouldn’t even scroll there. Like, this was 100% intentional.\n\nOnce I actually de-obfuscated it, here’s what it was capable of:\n\n\\- Full file system access\n\n\\- Detecting the user’s home directory\n\n\\- Dynamically constructing file paths\n\n\\- Reading any file it had permission to read\n\n\\- Base64-encoding file contents (to hide what’s being sent)\n\n\\- Sending that data out via POST requests to remote servers\n\nTranslation: **if you ran it, assume your machine was compromised.**\n\nIf you are new here:\n\n* NEVER run client code blindly\n* Obfuscated JS = malicious. There is no legit reason for it here.\n* If a client says “just test it locally,” stop and think\n\n  \nI’m posting this out of pure rage because I don’t want another new dev to learn this lesson the hard way like I did.",
        "subreddit": "freelance",
        "author": "Jaded-Journalist2470",
        "score": 967,
        "num_comments": 89,
        "created_utc": 1767813175.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1q6omig/upwork_newbie_here_just_ran_straightup_malware/",
        "fetched_at": "2026-02-16T08:36:10.384460"
      },
      {
        "id": "1r3fqba",
        "title": "Cousin’s fiancée wants 10% equity in my software company for one client introduction. Cousin is pressuring me to sign. Am I wrong for refusing? I will not promote",
        "selftext": "Cousin’s fiancée (A) inherited her dad’s insurance book after he passed. One of her clients needed software to replace their Google Sheets operations. She told me about it, which is what kicked off the project. I’m a software dev working full-time, and I’ve since invested hundreds of hours building the entire product solo. 51 database models, optimization algorithms, full backend architecture. Nobody else has written a line of code or put in a dollar. Product isn’t finished yet. I’m splitting time between learning their operations and building on the side.\n\nShe introduced me to the client. Demo went well. My mistake: we never defined terms beforehand.\n\nThen she demanded 50/50 ownership of the entire company. Said she “brought me on” and this was “her company.” I countered with: 50/50 revenue on the client she introduced (lifetime), 20% commission on future clients she brings, and a path to earn 10% equity after closing 5 clients in 12 months with vesting. She rejected it, said it made her feel like a “sales employee,” got emotional on a call, brought up her deceased father, hung up on me, and later said she’d be “spiteful at family events.”\n\nMy cousin then started negotiating on her behalf because he felt “embarrassed” for suggesting she come to me. He pushed equity from 20% down to 10%, framing it as “just voting power.” I proposed a completely different structure: two separate companies, mine owns the software, hers acts as a referral business, commercial agreement between them, no equity. He ignored that and sent me a formal agreement. Keep in mind the original terms changed, this agreement would now be between myself and him as she is too busy with her job and insurance. He’s now stating that he’ll execute her part.\n\nThe agreement includes:\n\n\t∙\t10% equity earn-in over 4 years\n\n\t∙\tAnti-dilution: his 10% can never drop below 10% without his consent. All future dilution (investors etc) comes from MY shares only\n\n\t∙\tTermination: he can only be removed for material breach uncured for 120 DAYS or felony conviction\n\n\t∙\tChange of control: any buyer must honor all his revenue rights forever\n\n\t∙\t50/50 revenue on all clients he sources with no sunset and no defined responsibilities\n\n\t∙\tZero performance obligations anywhere in the document\n\n\t∙\tThe agreement is between me and my cousin, not me and A\n\nHe’s pressuring me to sign saying “there’s no way you don’t agree with this.”\n\nWhat I think is fair: Two separate companies. 50/50 revenue on clients she sources for 24 months per client then it sunsets. Defined responsibilities she must perform to keep the 50% rate (client check-ins, training, support triage, QBRs). Drops to 15% if she stops doing the work. Either party can terminate with 60-90 days notice. No equity at all.\n\nKeep in mind, this client is somehow related to A. She’s essentially gatekeeping this client for leverage. It would be a very meaningful first client. However, my family also has longstanding ties to this client as well, however I don’t plan to go around her whether this deal works out or not.\n\nWhy I’m comfortable walking away: I have 25+ other distribution channels mapped out, a warm intro to another potential client, and a full GTM strategy that doesn’t depend on her. She is the reason I started building, and I respect that. But “they need software” and hundreds of hours of building the solution are very different contributions.\n\nKeep in mind, I’m also pressured to agree because at the end of the day, this is my cousin. They would hold this over me forever. To make matters worse, our weddings are at the end of this year (1 week apart), in the same city.\n\nAm I being unreasonable? Would you sign this? ",
        "subreddit": "startups",
        "author": "oneoffv",
        "score": 684,
        "num_comments": 660,
        "created_utc": 1770957283.0,
        "permalink": "https://www.reddit.com/r/startups/comments/1r3fqba/cousins_fiancée_wants_10_equity_in_my_software/",
        "fetched_at": "2026-02-16T08:36:07.118047"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 507,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-02-16T08:36:10.384416"
      },
      {
        "id": "1qaobz3",
        "title": "I scraped 200k+ Reddit posts to find out the best way to get your first freelance client. Here is what I found:",
        "selftext": "Hi everyone,\n\nLike many of you, when I started looking for clients, I was overwhelmed by anecdotal advice: \"Just cold email,\" \"Use Upwork,\" \"Network in person.\" I wanted to know what actually works.\n\nSo, I built a scraper to analyze the archives of r/freelance, r/upwork, r/webdev, and several other freelance subreddits. I processed over 200,000 posts and comments, used AI to filter for relevant information, and normalized the data to find out exactly how people got their first client and how long it took.\n\nHere are the key findings from the data:\n\n* In-Person is King (Speed-wise): The median time to land a client via In-Person Cold Outreach was just 1.5 days. It seems the \"uncomfortable\" work of showing up physically builds trust faster than anything else.\n* The \"Cold\" Hierarchy: If you are doing cold outreach, the medium matters significantly: In-Person > Cold Calling > DMs > Cold Emailing. Cold emailing was the least effective and slowest of the direct methods in the dataset.\n* Free Work Works: Offering free work seems to be one of the fastest ways to convert to a paying client, likely because it removes the initial friction.\n\nOverall, the median time to find a first client was around 21 days, not bad at all!\n\nMethodology & Data Constraints:\n\nWhile this analysis provides valuable insights, it is important to acknowledge the constraints of the data:\n\n* Source Bias: Data is sourced from Reddit communities, which may skew towards specific types of freelancers and experiences.\n* Self-Reporting: Timelines are based on user recollection, which can be subjective.\n* Survivorship Bias: Successful freelancers are more likely to share their stories than those who did not find clients.\n* Sample Size: While 4,000+ leads were identified, only \\~1,000 contained explicit \"time to first client\" data.\n\nThe archives I processed were from 2024. I am currently processing 2025 data and adding more subreddits, which should double or triple the number of leads and provide more accurate results.\n\nFull data if you want to look at it yourself : [Google Sheets](https://docs.google.com/spreadsheets/d/1cLCiQWlPsE3TXA7QE8I-oXyvR7Y1wfUOvj1G8289RmI/edit?usp=sharing)\n\nI'm curious, does this match your experience? Did in-person outreach work faster for you than online methods?\n\n**EDIT:** Reverified some data today; the \"free work\" category had fewer datapoints than I thought, and the AI hallucinated a bit. Since it's \"free work,\" it didn't know whether it needed to find time until the first paying client or time until the first free client. I expect it to probably take a bit more time than 7 days and maybe **bring in** several clients at once.\n\nAlso tried to look if a lot of spam got through (i.e., people just creating posts to advertise a product) and honestly, not a lot; I only saw one so far.\n\n**->** Sadly, I can't update images. The conclusions still seem to be holding up at least—I hope it's not confirmation bias. I will let you know more for sure with the new data.",
        "subreddit": "freelance",
        "author": "Tryhard_314",
        "score": 224,
        "num_comments": 77,
        "created_utc": 1768201888.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qaobz3/i_scraped_200k_reddit_posts_to_find_out_the_best/",
        "fetched_at": "2026-02-16T08:36:10.384458"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 176,
        "num_comments": 51,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-02-16T08:36:10.384473"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 162,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-02-16T08:36:10.384471"
      },
      {
        "id": "1r5nb8q",
        "title": "I got a dump trailer and now I can’t keep up with the requests, and I’m not organized at all",
        "selftext": "I started this side hustle about 6 months ago, just one dump trailer, only after work and on weekends. Now I easily get 3–4 jobs a day when the weather is good and I’m getting lost between calls, WhatsApp messages, and random notes in my phone.  \n  \nI’ve already messed up the time with clients twice, and one time I got to the landfill at 4:55 pm when they close at 5:00 pm, fully loaded, just because I stacked three pick-ups on top of each other. I don’t want to turn down jobs, but at this pace I feel like I’m going to crash it. How do you stay organized when it’s “just” a side hustle but it starts to look like a full-time job?  \n",
        "subreddit": "smallbusiness",
        "author": "CoralMoan",
        "score": 147,
        "num_comments": 74,
        "created_utc": 1771183142.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1r5nb8q/i_got_a_dump_trailer_and_now_i_cant_keep_up_with/",
        "fetched_at": "2026-02-16T08:36:08.622590"
      },
      {
        "id": "1r57d75",
        "title": "anyone else feel weird after starting something on their own",
        "selftext": "so i started building something few months ago\nnot huge\nnot funded\n\njust me trying to see if i can make something work\nand honestly the hardest part is not money\nits not even skills\n\nits this strange feeling like you are behind everyone\n\ni open linkedin and people raising funds\ntwitter people posting big numbers\nreddit people talking about 10k mrr like its normal\n\nand here i am trying to get first few paying users\nsome days i feel motivated\nother days i think maybe im just not cut for this\n\ni dont regret starting\nbut i didnt expect how much it messes with your head\n\ndoes anyone else feel like this sometimes\nor is it just part of the process?",
        "subreddit": "Entrepreneur",
        "author": "ryhanships",
        "score": 125,
        "num_comments": 90,
        "created_utc": 1771136413.0,
        "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1r57d75/anyone_else_feel_weird_after_starting_something/",
        "fetched_at": "2026-02-16T08:36:03.540707"
      },
      {
        "id": "1r5ibeh",
        "title": "Growing too fast and drowning in cash flow issues",
        "selftext": "Hey everyone, this is my first Reddit post, so I apologize if it’s a little rough.\n\nI'm 25 M and I’ve learned a ton from this community and really respect the advice that gets shared here. Now I’m the one who needs help.\n\nI own a small business that I started and fully funded myself. I own 100% of it. I do everything — the work, bookkeeping, taxes, invoicing, customer relations — all of it. and I've been in business for over 2 years\n\nWhen I first started, things were manageable. I paid for materials, tools, and consumables in cash. No loans, no credit cards, no investors, no debt. It felt safe and controlled.\n\nBut as the months went on, the business kept growing. Bigger clients came in. I moved into B2B work with net 30 terms. At first, I was balancing that with smaller cash-paying jobs, which helped with flow.\n\nNow I’m almost strictly B2B. Dee to me not having any physical time for the smaller intricate jobs that takes 6 hours to complete.\n\nAnd my cash flow is terrible.\n\nOn paper, I’m growing every month. I have recurring clients. Work keeps increasing. But because of net 30 terms, I’m constantly waiting to get paid while needing to buy materials for the next round of jobs. I’ve gotten to the point where I’m worried I won’t be able to afford next month’s materials — even though I have the work lined up.\n\nI’ve tried loans which i cant get approved due to my credit and being high risk and grants, but most “grant” programs I find just want fees to “move my application forward,” which feels sketchy. I don’t want to bury myself in bad debt.\n\nThis situation has stressed me to the point of mental exhaustion. I’ve honestly thought about shutting everything down just to relieve the pressure — even though I know the business is growing and has real potential. It feels like I’m growing too fast and I can’t keep up financially.\n\nHas anyone else dealt with rapid growth creating cash flow problems like this?\n\nHow do you manage net 30 clients without constantly feeling underwater?\n\nI don’t want to quit. I just don’t know how to stabilize this.\n\nAny advice would mean a lot.",
        "subreddit": "smallbusiness",
        "author": "UnluckyExtent5804",
        "score": 108,
        "num_comments": 170,
        "created_utc": 1771171571.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1r5ibeh/growing_too_fast_and_drowning_in_cash_flow_issues/",
        "fetched_at": "2026-02-16T08:36:08.622594"
      },
      {
        "id": "1qcsxvv",
        "title": "How I’m trying to build and maintain a “rainy day” fund as a freelancer",
        "selftext": "I do a mix of photography and digital art, so my income is all over the place. Some months are stacked with shoots, edits, and commissions. Other months it’s quiet in a way that makes you question every life choice.  \nNow I'm treating the rainy day fund less like a savings goal and more like part of the workflow.  \nWhen a payment comes in, I move a small percentage out immediately, even if it feels almost pointless on slower months. On good months, I don’t get aggressive or try to “catch up,” I just keep the same rule and let the volume do the work. That way I’m not making emotional decisions based on how busy I feel that week.  \nI also stopped framing it as money I’m not allowed to touch. It’s there for exactly the stuff that always happens as a freelancer. A client pushing a payment. A camera repair. A dry couple of weeks. If I dip into it, the only rule is that I slowly rebuild it once things pick back up, no guilt spiral attached. It’s still imperfect, but it’s the first system that doesn’t fall apart the second my schedule does. For context, I keep the rainy day money in the same place my freelance income lands. I use karat, but the main thing is just keeping it out of my personal spending flow.\n\nWould love to hear how other freelancers here handle their rainy day fund, especially if your work swings between creative and digital like mine.",
        "subreddit": "freelance",
        "author": "Historical_Bug_6870",
        "score": 101,
        "num_comments": 52,
        "created_utc": 1768410555.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qcsxvv/how_im_trying_to_build_and_maintain_a_rainy_day/",
        "fetched_at": "2026-02-16T08:36:10.384454"
      }
    ]
  }
}