{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-08T01:02:56.507045"
  },
  "data": {
    "youtube": [
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-08T01:02:48.114147"
      },
      {
        "videoId": "3MD9PgzBfbY",
        "title": "My Simple YouTube Video Editing Workflow in Resolve",
        "description": "Check out MotionVFX: http://tinyurl.com/GKMotionVFX ▷Use code \"GEORGE10\" for 10% off! In this one we're looking at how the ...",
        "channelTitle": "George Kamenov",
        "publishedAt": "2024-08-27T14:30:01Z",
        "url": "https://www.youtube.com/watch?v=3MD9PgzBfbY",
        "fetched_at": "2026-01-08T01:02:47.764626"
      },
      {
        "videoId": "eC8wfWc3dVU",
        "title": "Editing Workflow Hacks 💻✨#editing #videography #filmmaking #premierepro",
        "description": "",
        "channelTitle": "Gaku Lange",
        "publishedAt": "2024-08-06T10:58:05Z",
        "url": "https://www.youtube.com/watch?v=eC8wfWc3dVU",
        "fetched_at": "2026-01-08T01:02:47.764645"
      },
      {
        "videoId": "gOchfGvTogk",
        "title": "My simple video editing workflow | Make video editing easier!",
        "description": "Transform your photography today: https://www.scottedwardsyoutube.com Video editing is a craft. It takes a lot of time to make ...",
        "channelTitle": "Scott Edwards",
        "publishedAt": "2022-10-27T14:00:33Z",
        "url": "https://www.youtube.com/watch?v=gOchfGvTogk",
        "fetched_at": "2026-01-08T01:02:47.764641"
      },
      {
        "videoId": "pKpdibyljR4",
        "title": "The BOOKKEEPING BASICS for BEGINNERS",
        "description": "Bookkeeping is the recording of past financial data to make future business decisions. In this tutorial, you'll learn what ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-06-29T20:30:06Z",
        "url": "https://www.youtube.com/watch?v=pKpdibyljR4",
        "fetched_at": "2026-01-08T01:02:48.114142"
      },
      {
        "videoId": "N_el5FlXNiY",
        "title": "Bookkeeping Basics &amp; Accounting 101 for Small Business Owners",
        "description": "Knowing some bookkeeping basics is an important step in managing your business finances. Now while it may not be the most ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-05-13T16:15:00Z",
        "url": "https://www.youtube.com/watch?v=N_el5FlXNiY",
        "fetched_at": "2026-01-08T01:02:48.114150"
      },
      {
        "videoId": "xWv391G8Nyw",
        "title": "Learn the Basics of Bookkeeping [FREE QuickBooks Training]",
        "description": "Bookkeeping Basics plus Quickbooks Training! Sign up with Quickbooks using this link for a STEEP discount off the regular price!",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2022-01-28T16:45:02Z",
        "url": "https://www.youtube.com/watch?v=xWv391G8Nyw",
        "fetched_at": "2026-01-08T01:02:48.114145"
      },
      {
        "videoId": "clKVtfZLTaY",
        "title": "How I Edit My Videos | My Premiere Pro Workflow For Beginners",
        "description": "Thank you Musicbed for sponsoring today's video. Use our coupon code BECKIANDCHRIS at checkout to get your first month free ...",
        "channelTitle": "Becki and Chris",
        "publishedAt": "2021-04-08T14:03:03Z",
        "url": "https://www.youtube.com/watch?v=clKVtfZLTaY",
        "fetched_at": "2026-01-08T01:02:47.764652"
      },
      {
        "videoId": "3KeG7hHzUy4",
        "title": "Accounting Basics for Small Business Owners [By a CPA]",
        "description": "Learn the accounting basics for small business from a CPA. Today, you will learn the role of accounting in small business.",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2020-10-12T11:00:02Z",
        "url": "https://www.youtube.com/watch?v=3KeG7hHzUy4",
        "fetched_at": "2026-01-08T01:02:48.114130"
      },
      {
        "videoId": "Ve7C_0XpFmA",
        "title": "How To EDIT From START To FINISH - EDITING WORKFLOW",
        "description": "BACK TO SCHOOL SALE!!! NEW LIGHTROOM PRESETS ONLY $9.99! - https://goo.gl/YKAtkY Presets for your videos ONLY ...",
        "channelTitle": "Matti Haapoja",
        "publishedAt": "2017-08-29T15:51:01Z",
        "url": "https://www.youtube.com/watch?v=Ve7C_0XpFmA",
        "fetched_at": "2026-01-08T01:02:47.764649"
      }
    ],
    "reddit": [
      {
        "id": "1q6t6nk",
        "title": "Fired my \"best\" employee and sales went UP the next day.",
        "selftext": "I run a small coffee shop and had this one barista who everyone loved. Customers asked for her by name, she knew everyones orders, super bubbly personality. I thought she was irreplaceable honestly.\n\nBut I started noticing our numbers were off. Not hugely but enough that I was losing sleep over it. Inventory didnt match sales, we were going through way more supplies than we should for our ticket averages. I initially blamed it on waste or bad tracking on my end.\n\nLong story short, caught her on camera giving free drinks to friends and taking cash sales without ringing them up. When I confronted her she got defensive and said \"everyone does this at coffee shops\" and that I should be grateful she brought in so many regulars. I had to let her go.\n\nHere's the crazy part. I was terrified wed lose customers. But ever since she left our sales have actually been up. Not just a little better but like consistently better numbers. I think she was pocketing way more than I even realized and her \"regulars\" were probably just people getting free stuff.\n\nMy other employees seemed relieved too which was unexpected. Apparently shed been creating drama and making their shifts miserable but I was so focused on the customer facing stuff I didnt see it.\n\nLesson learned I guess, sometimes the person who seems the most valuable is actually costing you the most. Both in actual money (glad I had some saved up for situations like this) and in team morale.",
        "subreddit": "smallbusiness",
        "author": "StraightAd9769",
        "score": 754,
        "num_comments": 69,
        "created_utc": 1767823462.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1q6t6nk/fired_my_best_employee_and_sales_went_up_the_next/",
        "fetched_at": "2026-01-08T01:02:53.718987"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 490,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-08T01:02:55.505696"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 453,
        "num_comments": 130,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-08T01:02:55.505742"
      },
      {
        "id": "1q6gqe7",
        "title": "I got lucky, hit 500k ARR and sold my SAAS",
        "selftext": "Hello guys,\n\nIn theory, when launching a SaaS, you validate the need first.   \n  \nIf potential clients pay, you build.   \n  \nIn practice? We all make the same rookie mistake: We start with an idea, then try to find someone to sell it to.   \n  \nIt’s usually a disaster.\n\nIn 2023, I did exactly that. \n\nActually, I did worse. \n\nI copied someone else’s idea for my market without knowing if it would work.\n\nHere is the story:\n\nIt's 2023. I’m new to SaaS, naive, and I think \"YCombinator model = Guaranteed Success.\"    \n  \nI  spot a company called OneText. They do \"text-to-buy\" for e-commerce in the USA. \n\nI think: \"Let's bring this to Europe! But with WhatsApp.\"\n\nI spend 6 months building a clone. \n\nResult? We launch the MVP. Nobody wants it. \n\nNOBODY.   \n  \nEurope wasn't ready for text-based purchasing. \n\nA total zero. 6 months of work thrown in the trash.\n\n\n\nSo, I pivot. \n\nNew logic: \"Let's find companies already selling WhatsApp tools in Europe making real money, and just copy them.\" \n\nI find Shopify apps making $2-3M. \n\nNot a creative idea but at least there is a market.\n\nWe clone the MVP features in 2 weeks. I try to sell it... and miracle. \n\nClients. Happy clients. Retention.\n\nIn 6 months, we grew from $0 to $50k MRR almost exclusively through cold outreach.\n\n\n\nWe had no vision. We didn't love the project, and we didn't know how to innovate. \n\nSo, we contacted buyers and sold the SaaS for 7 figures in just a few weeks. \n\n(This was early 2025).\n\n[Here is the SaaS I sold and the proof](https://www.linkedin.com/posts/jeremyhorowitz1_after-45-yrs-352-deals-5-lost-lois-i-activity-7297946777532391424-x-zZ?utm_source=share&utm_medium=member_desktop&rcm=ACoAAC6Qr-cBuSULRKCL1d1JL7e1LIgV7c6UZ3c) \n\n\n\nA few months ago, I launched a new SaaS. This time, before writing ONE LINE of code, I sold the solution using a PowerPoint deck. We hit $7k MRR before coding a single feature. \n\nToday, we are over $30k/month.\n\nThe lesson: Don't waste time. SELL BEFORE YOU CODE.\n\nDon't be a donkey like I was and waste 6 months of your life.\n\n\n\nBTW, [here is what I’m building now](https://gojiberry.ai) (I hope we will reach $1m ARR very soon) \n\nGood luck!",
        "subreddit": "SaaS",
        "author": "Ecstatic-Tough6503",
        "score": 222,
        "num_comments": 46,
        "created_utc": 1767796001.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1q6gqe7/i_got_lucky_hit_500k_arr_and_sold_my_saas/",
        "fetched_at": "2026-01-08T01:02:50.635452"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 164,
        "num_comments": 44,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-08T01:02:55.505722"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 157,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-08T01:02:55.505720"
      },
      {
        "id": "1q6go1t",
        "title": "My 8 year old son started a business to buy a drone how should I handle this?",
        "selftext": "I need some advice on how to handle a situation with my 8-year-old son that started during this Christmas vacation.\n\nThe Backstory:\nMy sister runs a small side business making cupcakes. She had a stall at her school’s end-of-term event and asked me to help her with sales. My son came along to help and, for the first time, saw a small amount of money turn into a pile of cash as we sold out in two hours. He was fascinated by how money is made.\n\nWhat happened next:\nA week later, he asked me for a drone. I told him I wouldn't buy it for him. After he realized I wasn’t going to budge, he asked if he could start a business to earn the money himself, inspired by the day at the cupcake stall.\nHe convinced my sister to teach him how to make chocolates. He invested ₹300 of his own pocket money into molds and chocolate compound. He and his cousin made 100 chocolates and, before we even woke up the next morning, they had sold them all for ₹5 each, making ₹500. They have since bought more supplies and sold even more.\n\nThe advice I need:\nWhile I am very happy and proud of what he has achieved, I’m honestly not sure how to handle this.\n-Should I fully support this and let him continue?\n-Should I be setting specific rules for him?\n-How do I manage a child of this age starting a \"business\" venture?\n-Any other advice you might have for me?\nI’m looking for perspectives on the best way to guide him through this.",
        "subreddit": "smallbusiness",
        "author": "AbidKhan-0",
        "score": 148,
        "num_comments": 129,
        "created_utc": 1767795842.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1q6go1t/my_8_year_old_son_started_a_business_to_buy_a/",
        "fetched_at": "2026-01-08T01:02:53.719005"
      },
      {
        "id": "1px5iot",
        "title": "The moment a DM quietly stops being “just a question” and starts being unpaid work",
        "selftext": "I’ve noticed something repeat over and over in freelance DMs.\n\nSomeone reaches out with a small question. You answer thoughtfully. They respond with appreciation. Then they follow up with another “quick thing.” Then another. At some point you realize you’re effectively consulting for free, but it feels awkward to interrupt because nothing explicitly changed.\n\nWhat took me a long time to see is that the shift isn’t emotional, it’s linguistic.\n\nEarly messages sound exploratory. Later messages start narrowing scope. They reference specific sections. They assume continuation. The person isn’t asking *if* you can help anymore, they’re implicitly assigning you work.\n\nOnce I started paying attention to the language instead of the vibe, setting boundaries stopped feeling as awkward for me. The conversation had already moved. I just hadn’t noticed.\n\nCurious if others have noticed the same thing or how you handle that transition without killing the relationship.",
        "subreddit": "freelance",
        "author": "MentalAdversity",
        "score": 112,
        "num_comments": 53,
        "created_utc": 1766861794.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1px5iot/the_moment_a_dm_quietly_stops_being_just_a/",
        "fetched_at": "2026-01-08T01:02:55.505706"
      },
      {
        "id": "1q693d0",
        "title": "I nearly ruined my health and life working at a remote startup",
        "selftext": "I’m writing this from a place of deep burnout and physical exhaustion. A few years ago, I made a career decision that I thought would be my \"big break.\" Instead, it turned into a multi-year downward spiral that cost me my health, my family time, and my sanity—all for a salary that wasn't even worth the medical bills I’m paying now. I'm shouting into the void here because I need to get this off my chest before I lose my mind.\n\nIf you’re a dev currently eyeing a \"remote startup,\" please read my story before you sign that offer.\n\n**The \"Flexible Timing\" Trap.** They sold me on remote work with \"flexible hours.\" What that actually meant was flexible for them, not for me. I was essentially on-call 24/7. My phone would blow up at 2 AM, 6 AM, midnight, or on Sundays (this happened more often than you think). It didn’t matter. If they had a random thought or a minor bug, they expected me to fix it ASAP. I failed multiple times trying to set boundaries.\n\n**Management by Chaos.** We were a \"team of 5,\" which sounds intimate until I realized it meant I would be managed by five different people. I was the only one actually implementing anything; the other four were just there to ask me for \"quick updates\" every hour. Because there were no clear meeting times, my day was a constant stream of individual calls. Instead of having one manager, I had five different stakeholders breathing down my neck, none of whom bothered to talk to each other before dumping their conflicting priorities on me. The mental overhead was exhausting—I was in a state of perpetual context switching, which made it impossible to find any 'flow' or build deep expertise.\n\n**The WhatsApp Hellscape.** We didn't use Jira. We didn't use Teams. We used WhatsApp. It is the single worst tool for professional work. Instructions were lost in encrypted calls and random texts. Because there was no paper trail, they would change requirements mid-stream and then blame me when the result didn't match the imaginary goalposts they moved three times in their heads.\n\n**The Physical Toll.** The worst part was the time zone difference. I was working nights, fighting against my own circadian rhythm. My immunity tanked. I caught every infection going around, and my medical bills started eating a huge chunk of my paycheck. My family had to suffer too—staying up late to make me dinner, adjusting their entire lives around my schedule. It wasn’t just my job; it was a lifestyle disease.\n\n**The \"Junior CTO\" Scam.** I was mid-level, but they expected me to build the entire business infrastructure from the ground up even though I was hired as an Individual Contributor (and not as a CTO or Architect). They hired me because I was cheaper than a Senior Architect, then forced me to learn new frameworks in days and apply them flawlessly. When the \"un-scalable\" systems (that they rushed!) inevitably broke, I was the one who had to bear the failure.\n\nThey used the phrase \"growth mindset\" to mask the fact that they had no plan. I wasn't growing; I was just being used as a guinea pig for a million directionless experiments.\n\n**TL;DR:** I took a \"flexible\" remote role at a tiny startup. I ended up with zero boundaries, five bosses, a broken body, and a career that felt directionless. Don't let \"learning opportunities\" be the bait that hooks you into a toxic environment.",
        "subreddit": "SaaS",
        "author": "PreviousEntrance2335",
        "score": 99,
        "num_comments": 66,
        "created_utc": 1767771036.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1q693d0/i_nearly_ruined_my_health_and_life_working_at_a/",
        "fetched_at": "2026-01-08T01:02:50.635456"
      },
      {
        "id": "1pku5yi",
        "title": "Lost potential clients because my Instagram looked \"inactive.\" Now I'm spending entire Sundays filming reels.",
        "selftext": "I just spent my entire Sunday filming Instagram reels and I'm losing my mind.\n\nFreelance brand designer, three years in. Work is fine. But somehow I became a content creator along the way and I don't remember signing up for that.\n\nI spend 6-8 hours a week shooting reels for Instagram because apparently that's how you get discovered now. Writing LinkedIn posts about random design tips because the algorithm buries you if you don't post. Filming TikToks in my living room at night because that's the only time left after actual client work.\n\nNone of this makes me money. It's all \"visibility\" and \"building your brand.\" Fine, whatever. But I'm exhausted.\n\nTried hiring someone but quotes were $800-1200 a month. Tried posting less but inquiries dropped by half. Had two potential clients ghost me after checking my Instagram. One of them straight up said it looked \"dead.\"\n\nNow I'm working 50 hour weeks but only 35 are billable. I see other freelancers posting constantly looking put together. How? Either I'm broken at this or everyone's just hiding it better.\n\nStarting to think I should just get a regular job where I can actually log off.\n\nTrying out a few AI tools to cut down filming time. APOB for generating video content, Canva for captions, and Descript for audio. Early days but seems like it might save 2-3 hours a week. Output feels kind of generic though. Videos look a bit too polished in a fake way and captions need heavy editing. Not sure if this is actually solving anything or just trading one problem for another.\n\nAlso going to try batch filming this weekend. We'll see.\n\nStill feels like I'm just rearranging deck chairs on the Titanic here.",
        "subreddit": "freelance",
        "author": "Any-Farm-1033",
        "score": 92,
        "num_comments": 40,
        "created_utc": 1765551959.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pku5yi/lost_potential_clients_because_my_instagram/",
        "fetched_at": "2026-01-08T01:02:55.505717"
      }
    ]
  }
}