{
  "metadata": {
    "total_items": 20,
    "sources": {
      "youtube": 10,
      "reddit": 10
    },
    "fetched_at": "2026-01-27T16:20:05.766615"
  },
  "data": {
    "youtube": [
      {
        "videoId": "N1EcCnuMKGA",
        "title": "Xero Tutorial | Ultimate Small Business Accounting Software",
        "description": "Learn Xero the right way from the start! In this 2026 beginner-friendly tutorial, I'll walk you step-by-step through everything you ...",
        "channelTitle": "Kevin Stratvert",
        "publishedAt": "2026-01-12T08:00:34Z",
        "url": "https://www.youtube.com/watch?v=N1EcCnuMKGA",
        "fetched_at": "2026-01-27T16:19:56.690037"
      },
      {
        "videoId": "xrX0l99LKAg",
        "title": "BOOKKEEPING BASICS for Small Business Owners: Do THIS Now!",
        "description": "Learn the bookkeeping basics for business owners and beginners. Get a Free Consultation: https://mycpacoach.com/contact/ QBO ...",
        "channelTitle": "Sherman - My CPA Coach",
        "publishedAt": "2025-10-27T21:59:32Z",
        "url": "https://www.youtube.com/watch?v=xrX0l99LKAg",
        "fetched_at": "2026-01-27T16:19:56.690035"
      },
      {
        "videoId": "24TFLVCceiQ",
        "title": "The Only BOOKKEEPING Tutorial You Need 2025 | For Beginners",
        "description": "Bookkeeping for beginners (2025) explained in under a minute, then a complete step-by-step tutorial. This is a 2 hour free course ...",
        "channelTitle": "LYFE Accounting",
        "publishedAt": "2025-10-02T18:18:19Z",
        "url": "https://www.youtube.com/watch?v=24TFLVCceiQ",
        "fetched_at": "2026-01-27T16:19:56.690014"
      },
      {
        "videoId": "9a04BsKv26M",
        "title": "Top 5 Accounting Software for Small Business (2026 Guide)",
        "description": "My top 5 Accounting Software for Small Businesses. In this updated Bookkeeping software guide, I share my top 5 online ...",
        "channelTitle": "Stewart Gauld",
        "publishedAt": "2025-08-27T11:30:07Z",
        "url": "https://www.youtube.com/watch?v=9a04BsKv26M",
        "fetched_at": "2026-01-27T16:19:56.690030"
      },
      {
        "videoId": "aaAZ7qSpD4A",
        "title": "Small Business Accounting: The Ultimate Checklist",
        "description": "Download the FREE Checklist Here: https://claracfo.com/responsibility If you've ever been frustrated by dropped balls or confusion ...",
        "channelTitle": "Financial Tech Lab by Clara CFO Group",
        "publishedAt": "2025-06-30T23:00:02Z",
        "url": "https://www.youtube.com/watch?v=aaAZ7qSpD4A",
        "fetched_at": "2026-01-27T16:19:56.690008"
      },
      {
        "videoId": "q_UPVaJL5WA",
        "title": "The Truth About STARTING a Bookkeeping Business in 2025",
        "description": "Ready to pick one niche, get unstuck and get clients to ogrow your business faster? Grab the Profit Booster 1000 Niches PDF + ...",
        "channelTitle": "The Bookkeeping Shop",
        "publishedAt": "2025-05-14T17:30:24Z",
        "url": "https://www.youtube.com/watch?v=q_UPVaJL5WA",
        "fetched_at": "2026-01-27T16:19:56.690026"
      },
      {
        "videoId": "JEAkQLMxqtw",
        "title": "How to Set Up Your Books as a New Business Owner",
        "description": "Bookkeeping doesn't have to be scary—and getting it right from day one can save you major headaches down the road. In this ...",
        "channelTitle": "Mark J Kohler",
        "publishedAt": "2025-04-29T21:54:58Z",
        "url": "https://www.youtube.com/watch?v=JEAkQLMxqtw",
        "fetched_at": "2026-01-27T16:19:56.690010"
      },
      {
        "videoId": "fkNEj5oB4n0",
        "title": "Best Small Business Accounting Software: Free vs. Paid – What’s Really Worth It? (2025)",
        "description": "Find the right accounting software: https://softwareconnect.com/go/small-business-accounting-software-bf011 Whether you're a ...",
        "channelTitle": "Software Connect",
        "publishedAt": "2025-03-05T19:30:05Z",
        "url": "https://www.youtube.com/watch?v=fkNEj5oB4n0",
        "fetched_at": "2026-01-27T16:19:56.690001"
      },
      {
        "videoId": "Kb_x8MxKQ5w",
        "title": "What is the best accounting software for small businesses in 2025?",
        "description": "What is the best accounting software for small businesses in 2025? In this video, I am walking through 3 of my favourite ...",
        "channelTitle": "Jamie Trull",
        "publishedAt": "2024-12-04T18:00:12Z",
        "url": "https://www.youtube.com/watch?v=Kb_x8MxKQ5w",
        "fetched_at": "2026-01-27T16:19:56.690034"
      },
      {
        "videoId": "zSWcjU3DYig",
        "title": "Small Business Accounting &amp; Tax Bootcamp - Learn the basics you need to know!",
        "description": "Learn the basics about your small business accounting and tax requirements. Let me simplify this area of your business, once and ...",
        "channelTitle": "Business Finance Coach",
        "publishedAt": "2024-09-14T15:53:30Z",
        "url": "https://www.youtube.com/watch?v=zSWcjU3DYig",
        "fetched_at": "2026-01-27T16:19:56.690013"
      }
    ],
    "reddit": [
      {
        "id": "1q6omig",
        "title": "Upwork newbie here, just ran straight-up malware from a “client” project. What the actual f***",
        "selftext": "Burner account because I’m beyond embarrassed and absolutely pissed.\n\nI’m new to Upwork. First “client” I get sends me a Next.js project and says “just run it locally and see if it works.”\n\nThey sent **malware**.\n\nAnd not sloppy malware. This was *deliberately hidden*.\n\nThey buried heavily obfuscated JavaScript **at the very bottom of** `nextjs.config.js`, AFTER `module.exports`, under a massive wall of blank lines so you wouldn’t even scroll there. Like, this was 100% intentional.\n\nOnce I actually de-obfuscated it, here’s what it was capable of:\n\n\\- Full file system access\n\n\\- Detecting the user’s home directory\n\n\\- Dynamically constructing file paths\n\n\\- Reading any file it had permission to read\n\n\\- Base64-encoding file contents (to hide what’s being sent)\n\n\\- Sending that data out via POST requests to remote servers\n\nTranslation: **if you ran it, assume your machine was compromised.**\n\nIf you are new here:\n\n* NEVER run client code blindly\n* Obfuscated JS = malicious. There is no legit reason for it here.\n* If a client says “just test it locally,” stop and think\n\n  \nI’m posting this out of pure rage because I don’t want another new dev to learn this lesson the hard way like I did.",
        "subreddit": "freelance",
        "author": "Jaded-Journalist2470",
        "score": 950,
        "num_comments": 83,
        "created_utc": 1767813175.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1q6omig/upwork_newbie_here_just_ran_straightup_malware/",
        "fetched_at": "2026-01-27T16:20:04.765233"
      },
      {
        "id": "9imfv9",
        "title": "Please Read This Before Posting or Commenting",
        "selftext": "**Violating [the rules of this subreddit](https://old.reddit.com/r/freelance/about/rules) will cause your post/comment will be removed and you will be banned PERMANENTLY. This is your only warning!** If you are unsure about whether a potential post or comment is suitable, [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffreelance) for guidance **before** posting it.\n\nIf you're asking a question, there's a good chance that it has already been answered! **[Read the wiki](/r/freelance/wiki/) and do a [search](https://www.reddit.com/r/freelance/search?q=&restrict_sr=on&sort=relevance&t=all) before submitting your post.**\n\nJust because your question involves freelancing does not mean that it is the best subreddit for it. Depending on your question, one of these other subreddits might be more appropriate:\n\n* /r/bigseo\n* /r/careerguidance\n* /r/copywriting\n* /r/DigitalNomad\n* /r/forhire\n* /r/freelanceUK\n* /r/freelanceWriters\n* /r/graphic_design\n* /r/jobs\n* /r/photography\n* /r/tax\n* /r/TranslationStudies\n* /r/UpWork\n* /r/videography\n* /r/webdev",
        "subreddit": "freelance",
        "author": "martey",
        "score": 498,
        "num_comments": 0,
        "created_utc": 1537827417.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/9imfv9/please_read_this_before_posting_or_commenting/",
        "fetched_at": "2026-01-27T16:20:04.765215"
      },
      {
        "id": "1p65rry",
        "title": "Client ghosted me twice… then used my whole proposal to “build the app himself with ChatGPT”",
        "selftext": "Had a client I’d been talking to for almost two years.\nComplex mobile app, two sided, video editing, payments, creator map flow… the real deal.\n\nI spent hours writing a full proposal, documenting the exact APIs, tools, workflows, stack.. everything.\nMVP price was ~$17K.\n\nHe hesitated.\nGhosted.\nCame back.\nGhosted again.\nCame back asking about payment plans.\nThen disappeared.\n\nAfter 10 days, he texts me:\n\n“Bro I built the full app myself using ChatGPT + Lovable for $500.\nFull backend on Supabase, Ayrshare, Banuba, email login, maps, everything.\nWanna show you.”\n\nBro basically used my entire documentation as a blueprint.\n\nThen asked if I can help him hourly.\n\nI said no. Got too much on my plate and not trying to be anyone’s free CTO.\n\nJust curious if other freelancers are starting to see clients suddenly become “AI developers” overnight because ChatGPT spits out some boilerplate code.\nHow do you deal with these situations without losing time or patience?\n",
        "subreddit": "freelance",
        "author": "Southern-State-2488",
        "score": 458,
        "num_comments": 135,
        "created_utc": 1764053727.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1p65rry/client_ghosted_me_twice_then_used_my_whole/",
        "fetched_at": "2026-01-27T16:20:04.765277"
      },
      {
        "id": "1qnk3sa",
        "title": "What to actually say when a client says \"that's more than we budgeted\"",
        "selftext": "Got this objection last month and for once I didn't panic or immediately offer a discount.\n\n Here's what I've learned works:\n\n **Objection: \"That's more than we budgeted\"**\n\n Old me: \"I could do it for \\[lower number\\]...\" (instant regret)\n\n New me: \"I understand. What budget range are you working with? Sometimes I can adjust the scope to fit.\"\n\n Then I offer a smaller version. Same rate, less scope.\n\n **Objection: \"Can you do it for $X?\"**\n\n Old me: Awkward silence, then \"...sure\"\n\n New me: \"I can definitely work within that budget. At $X, I'd recommend we focus on \\[specific piece\\]. You'd get \\[outcome\\] without the \\[removed elements\\]. Would that work?\"\n\n **Objection: \"We got a lower quote from someone else\"**\n\n Old me: Panic\n\n New me: \"That makes sense — there's a wide range. Does their quote include \\[specific thing\\]? What's their revision policy?\"\n\n Then: \"I'm confident in my pricing because \\[one sentence on value\\]. But if they're a better fit for your budget, I completely understand.\"\n\n **The principle: Never lower your rate. Adjust scope instead.**\n\n It took me years to internalize this. The first few times feel uncomfortable. But once you do it, you stop resenting projects and clients stop expecting discounts.\n\n Anyone else have scripts that work for them?",
        "subreddit": "smallbusiness",
        "author": "U-S-Hey",
        "score": 252,
        "num_comments": 64,
        "created_utc": 1769443445.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1qnk3sa/what_to_actually_say_when_a_client_says_thats/",
        "fetched_at": "2026-01-27T16:20:02.807967"
      },
      {
        "id": "1qaobz3",
        "title": "I scraped 200k+ Reddit posts to find out the best way to get your first freelance client. Here is what I found:",
        "selftext": "Hi everyone,\n\nLike many of you, when I started looking for clients, I was overwhelmed by anecdotal advice: \"Just cold email,\" \"Use Upwork,\" \"Network in person.\" I wanted to know what actually works.\n\nSo, I built a scraper to analyze the archives of r/freelance, r/upwork, r/webdev, and several other freelance subreddits. I processed over 200,000 posts and comments, used AI to filter for relevant information, and normalized the data to find out exactly how people got their first client and how long it took.\n\nHere are the key findings from the data:\n\n* In-Person is King (Speed-wise): The median time to land a client via In-Person Cold Outreach was just 1.5 days. It seems the \"uncomfortable\" work of showing up physically builds trust faster than anything else.\n* The \"Cold\" Hierarchy: If you are doing cold outreach, the medium matters significantly: In-Person > Cold Calling > DMs > Cold Emailing. Cold emailing was the least effective and slowest of the direct methods in the dataset.\n* Free Work Works: Offering free work seems to be one of the fastest ways to convert to a paying client, likely because it removes the initial friction.\n\nOverall, the median time to find a first client was around 21 days, not bad at all!\n\nMethodology & Data Constraints:\n\nWhile this analysis provides valuable insights, it is important to acknowledge the constraints of the data:\n\n* Source Bias: Data is sourced from Reddit communities, which may skew towards specific types of freelancers and experiences.\n* Self-Reporting: Timelines are based on user recollection, which can be subjective.\n* Survivorship Bias: Successful freelancers are more likely to share their stories than those who did not find clients.\n* Sample Size: While 4,000+ leads were identified, only \\~1,000 contained explicit \"time to first client\" data.\n\nThe archives I processed were from 2024. I am currently processing 2025 data and adding more subreddits, which should double or triple the number of leads and provide more accurate results.\n\nFull data if you want to look at it yourself : [Google Sheets](https://docs.google.com/spreadsheets/d/1cLCiQWlPsE3TXA7QE8I-oXyvR7Y1wfUOvj1G8289RmI/edit?usp=sharing)\n\nI'm curious, does this match your experience? Did in-person outreach work faster for you than online methods?\n\n**EDIT:** Reverified some data today; the \"free work\" category had fewer datapoints than I thought, and the AI hallucinated a bit. Since it's \"free work,\" it didn't know whether it needed to find time until the first paying client or time until the first free client. I expect it to probably take a bit more time than 7 days and maybe **bring in** several clients at once.\n\nAlso tried to look if a lot of spam got through (i.e., people just creating posts to advertise a product) and honestly, not a lot; I only saw one so far.\n\n**->** Sadly, I can't update images. The conclusions still seem to be holding up at least—I hope it's not confirmation bias. I will let you know more for sure with the new data.",
        "subreddit": "freelance",
        "author": "Tryhard_314",
        "score": 208,
        "num_comments": 73,
        "created_utc": 1768201888.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1qaobz3/i_scraped_200k_reddit_posts_to_find_out_the_best/",
        "fetched_at": "2026-01-27T16:20:04.765231"
      },
      {
        "id": "1pgllc1",
        "title": "LPT: You are not supposed to have 40 hours/week of billable work each week",
        "selftext": "I struggle with this too. Freelancers have to deal with much more marketing/sales stuff.\n\nOn top of that, tax bureaucracy as a freelancer is a ton of work compared to a regular employee. This is even worse in earlier years of this new career path.\n\nFreelancing is also more stressful than a regular job so we need more downtime and relaxtion hours than a regular employee\n\n\nI don't want to quote a specific number. But weekly billable hours for a freelancer should be:\n\n> 40 hours - Hours required for extra side work - Few more extra relaxation hours",
        "subreddit": "freelance",
        "author": "MysteryMan526",
        "score": 168,
        "num_comments": 49,
        "created_utc": 1765122599.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pgllc1/lpt_you_are_not_supposed_to_have_40_hoursweek_of/",
        "fetched_at": "2026-01-27T16:20:04.765259"
      },
      {
        "id": "1pj2y4s",
        "title": "My Client is asking me to make the payment of 150 USD upfront so they can release the payment. (I feel like it's an elaborate scam )",
        "selftext": "So I worked a gig for 3,000 USD. (In the contract, I did agree to bear all the transfer charges.)  \nAnd once I submitted the project, I was asked to choose between bank transfer, PayPal, and crypto. I chose the route through bank transfer, and they have initiated the payment, but it is on hold.  \nI asked them to please deduct the amount from their side, but they say it's reserved for company personnel only \n\nI had been sent a lodgement receipt and asked to make the payment of 150 USD\n\nbefore my payment is processed. I am sure this isn't how it works, or please correct me\n\nPlease help me",
        "subreddit": "freelance",
        "author": "Maleficent_Low7831",
        "score": 161,
        "num_comments": 61,
        "created_utc": 1765374342.0,
        "permalink": "https://www.reddit.com/r/freelance/comments/1pj2y4s/my_client_is_asking_me_to_make_the_payment_of_150/",
        "fetched_at": "2026-01-27T16:20:04.765257"
      },
      {
        "id": "1qnm8n0",
        "title": "I stopped getting restricted on LinkedIn after I fixed these 6 account health metrics",
        "selftext": "I got restricted on LinkedIn twice in 4 months while doing legit B2B outbound, and it was the overall pattern of my account looking “low-trust.”\n\nHere’re my mistakes. This is not “how to evade,” it’s what reduced restrictions once I cleaned up behavior and stopped chasing volume.\n\n1/ I had 380 pending connection requests just sitting there. Apparently LinkedIn gets suspicious when you have too many pending invites because it means low acceptance rate, so you look like spam. They recommend keeping it under 500 but from what I read now even that's pushing it, more like 200-300 is safer. Now I just withdraw old invites, LinkedIn doesn't notify these people, so I can re-invite them in 3 weeks.\n\n2/ there's a weekly invitation limit now, 100-200 invites per week depending on your account. I was aiming for 230 a week to get the following. I thought I was fine because I stayed under daily limits. But the weekly number matters just as much.\n\n3/ I set my tool to send only 35 requests every day at the same time. But real people can send 20 today at 10:00 AM, 40 tomorrow at 16:30 and 0 on Friday. So now I use randomization for everything. I vary daily limits between 20-30 and different timing.\n\n4/ I was only sending connection requests and sending messages, but I also needed to like posts, write comments etc. Real people browse, read content and reply in comments.\n\nWhat other triggers have you seen that cause restrictions (especially the non-obvious ones)?\n\n",
        "subreddit": "SaaS",
        "author": "WhispersAndWinksx",
        "score": 159,
        "num_comments": 22,
        "created_utc": 1769447829.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1qnm8n0/i_stopped_getting_restricted_on_linkedin_after_i/",
        "fetched_at": "2026-01-27T16:19:59.349669"
      },
      {
        "id": "1qnky4n",
        "title": "Looking for advice on growing my garden business and side hustles for extra cash",
        "selftext": "Hey everyone! I've been running a small garden business (landscaping, maintenance, that sort of thing) and I'm trying to figure out how to grow it and get more clients. Right now it's just me and I'm doing okay, but I feel like I could be doing more to expand.\n\nAlso, on days when things are slow or I have downtime, I'm looking for ways to make some extra money on the side. I've heard people mention different side hustles and I'm open to pretty much anything that doesn't require a huge time commitment.\n\nAny tips on either front? How do you guys find new clients for service based businesses? And what do you do when you've got a few free hours here and there to make some extra cash?\n\nAppreciate any advice!",
        "subreddit": "smallbusiness",
        "author": "FreshMaterial9484",
        "score": 123,
        "num_comments": 23,
        "created_utc": 1769445203.0,
        "permalink": "https://www.reddit.com/r/smallbusiness/comments/1qnky4n/looking_for_advice_on_growing_my_garden_business/",
        "fetched_at": "2026-01-27T16:20:02.807986"
      },
      {
        "id": "1qngtxz",
        "title": "Most \"vibe coders\" are just scammers with a ChatGPT subscription",
        "selftext": "I’m done being polite about this. The current state of \"MVP development\" is an absolute clown show.\n\nI scroll through Twitter and see these \"founders\" bragging about building a SaaS in a weekend using nothing but vibes and Cursor. Then I see the poor non-technical founders hiring these guys, thinking they’re getting a steal.\n\nHere is the hard truth: You aren't getting a deal. You are getting scammed.\n\nI’ve spent the last six months cleaning up the mess left behind by these \"24-hour ship\" agencies. Honestly, it’s becoming the bulk of my consulting work lately. It is horrifying. These aren't developers. They are professional copy-pasters. They don’t know how code works; they only know how to hit \"Tab\" on an AI suggestion.\n\nThey are selling you a car with a glossy paint job that has a lawnmower engine and no brakes.\n\nHere is why your \"vibe coded\" app is absolute trash (and why I usually end up billing for a total rewrite):\n\n*   **They literally can’t read code.** If the AI hallucinates a security flaw, they ship the security flaw. I audited a project last week where user passwords were being stored in plain text because the \"dev\" didn't know what hashing was. That’s not a bug; that’s a lawsuit waiting to happen. I had to patch that emergency live while the client basically hyperventilated.\n*   **The shitty architecture.** They pile library on top of library because they don't know how to write a simple function. Your simple to-do list app ends up being 500MB because they imported the entire internet to make a button change color. When I come in to fix these, I’m usually deleting 60% of the codebase just to make the thing load under 5 seconds.\n*   **It’s unmaintainable garbage.** The second you ask for a feature that the AI can't easily one-shot, the project dies. They can't debug it because they never understood it in the first place. They ghost you, and that's usually when I get the desperate email to come save the sinking ship. You're left with a zip file of spaghetti code that no serious engineer will touch without a hazmat suit.\n\nStop falling for the \"we move fast\" hype. Moving fast into a brick wall isn't progress.\n\nIf you are hiring a dev and they can't explain how the database talks to the frontend without looking at a prompt window, fire them immediately. You are burning your seed money on digital landfill.\n\nAny other senior devs making a killing right now just rewriting this slop from scratch? My calendar is basically full of it.",
        "subreddit": "SaaS",
        "author": "Warm-Reaction-456",
        "score": 115,
        "num_comments": 77,
        "created_utc": 1769436127.0,
        "permalink": "https://www.reddit.com/r/SaaS/comments/1qngtxz/most_vibe_coders_are_just_scammers_with_a_chatgpt/",
        "fetched_at": "2026-01-27T16:19:59.349696"
      }
    ]
  }
}